----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 64, 512, 1024]           9,408
       BatchNorm2d-2        [-1, 64, 512, 1024]             128
            Conv2d-3        [-1, 64, 512, 1024]           9,408
              ReLU-4        [-1, 64, 512, 1024]               0
         MaxPool2d-5         [-1, 64, 256, 512]               0
            Conv2d-6         [-1, 64, 256, 512]           4,096
       BatchNorm2d-7        [-1, 64, 512, 1024]             128
       BatchNorm2d-8         [-1, 64, 256, 512]             128
              ReLU-9        [-1, 64, 512, 1024]               0
             ReLU-10         [-1, 64, 256, 512]               0
        MaxPool2d-11         [-1, 64, 256, 512]               0
           Conv2d-12         [-1, 64, 256, 512]           4,096
           Conv2d-13         [-1, 64, 256, 512]          36,864
      BatchNorm2d-14         [-1, 64, 256, 512]             128
      BatchNorm2d-15         [-1, 64, 256, 512]             128
             ReLU-16         [-1, 64, 256, 512]               0
           Conv2d-17         [-1, 64, 256, 512]          36,864
             ReLU-18         [-1, 64, 256, 512]               0
      BatchNorm2d-19         [-1, 64, 256, 512]             128
           Conv2d-20        [-1, 256, 256, 512]          16,384
             ReLU-21         [-1, 64, 256, 512]               0
           Conv2d-22        [-1, 256, 256, 512]          16,384
      BatchNorm2d-23        [-1, 256, 256, 512]             512
      BatchNorm2d-24        [-1, 256, 256, 512]             512
           Conv2d-25        [-1, 256, 256, 512]          16,384
           Conv2d-26        [-1, 256, 256, 512]          16,384
      BatchNorm2d-27        [-1, 256, 256, 512]             512
      BatchNorm2d-28        [-1, 256, 256, 512]             512
             ReLU-29        [-1, 256, 256, 512]               0
       Bottleneck-30        [-1, 256, 256, 512]               0
             ReLU-31        [-1, 256, 256, 512]               0
       Bottleneck-32        [-1, 256, 256, 512]               0
           Conv2d-33         [-1, 64, 256, 512]          16,384
           Conv2d-34         [-1, 64, 256, 512]          16,384
      BatchNorm2d-35         [-1, 64, 256, 512]             128
      BatchNorm2d-36         [-1, 64, 256, 512]             128
             ReLU-37         [-1, 64, 256, 512]               0
             ReLU-38         [-1, 64, 256, 512]               0
           Conv2d-39         [-1, 64, 256, 512]          36,864
           Conv2d-40         [-1, 64, 256, 512]          36,864
      BatchNorm2d-41         [-1, 64, 256, 512]             128
             ReLU-42         [-1, 64, 256, 512]               0
      BatchNorm2d-43         [-1, 64, 256, 512]             128
           Conv2d-44        [-1, 256, 256, 512]          16,384
             ReLU-45         [-1, 64, 256, 512]               0
      BatchNorm2d-46        [-1, 256, 256, 512]             512
           Conv2d-47        [-1, 256, 256, 512]          16,384
             ReLU-48        [-1, 256, 256, 512]               0
       Bottleneck-49        [-1, 256, 256, 512]               0
           Conv2d-50         [-1, 64, 256, 512]          16,384
      BatchNorm2d-51        [-1, 256, 256, 512]             512
      BatchNorm2d-52         [-1, 64, 256, 512]             128
             ReLU-53         [-1, 64, 256, 512]               0
             ReLU-54        [-1, 256, 256, 512]               0
       Bottleneck-55        [-1, 256, 256, 512]               0
           Conv2d-56         [-1, 64, 256, 512]          36,864
           Conv2d-57         [-1, 64, 256, 512]          16,384
      BatchNorm2d-58         [-1, 64, 256, 512]             128
             ReLU-59         [-1, 64, 256, 512]               0
           Conv2d-60        [-1, 256, 256, 512]          16,384
      BatchNorm2d-61         [-1, 64, 256, 512]             128
      BatchNorm2d-62        [-1, 256, 256, 512]             512
             ReLU-63         [-1, 64, 256, 512]               0
             ReLU-64        [-1, 256, 256, 512]               0
       Bottleneck-65        [-1, 256, 256, 512]               0
           Conv2d-66         [-1, 64, 256, 512]          36,864
           Conv2d-67        [-1, 128, 256, 512]          32,768
      BatchNorm2d-68        [-1, 128, 256, 512]             256
      BatchNorm2d-69         [-1, 64, 256, 512]             128
             ReLU-70        [-1, 128, 256, 512]               0
             ReLU-71         [-1, 64, 256, 512]               0
           Conv2d-72        [-1, 128, 128, 256]         147,456
           Conv2d-73        [-1, 256, 256, 512]          16,384
      BatchNorm2d-74        [-1, 128, 128, 256]             256
             ReLU-75        [-1, 128, 128, 256]               0
      BatchNorm2d-76        [-1, 256, 256, 512]             512
           Conv2d-77        [-1, 512, 128, 256]          65,536
             ReLU-78        [-1, 256, 256, 512]               0
       Bottleneck-79        [-1, 256, 256, 512]               0
      BatchNorm2d-80        [-1, 512, 128, 256]           1,024
           Conv2d-81        [-1, 128, 256, 512]          32,768
           Conv2d-82        [-1, 512, 128, 256]         131,072
      BatchNorm2d-83        [-1, 512, 128, 256]           1,024
      BatchNorm2d-84        [-1, 128, 256, 512]             256
             ReLU-85        [-1, 512, 128, 256]               0
       Bottleneck-86        [-1, 512, 128, 256]               0
             ReLU-87        [-1, 128, 256, 512]               0
           Conv2d-88        [-1, 128, 128, 256]          65,536
           Conv2d-89        [-1, 128, 128, 256]         147,456
      BatchNorm2d-90        [-1, 128, 128, 256]             256
      BatchNorm2d-91        [-1, 128, 128, 256]             256
             ReLU-92        [-1, 128, 128, 256]               0
             ReLU-93        [-1, 128, 128, 256]               0
           Conv2d-94        [-1, 128, 128, 256]         147,456
           Conv2d-95        [-1, 512, 128, 256]          65,536
      BatchNorm2d-96        [-1, 128, 128, 256]             256
      BatchNorm2d-97        [-1, 512, 128, 256]           1,024
             ReLU-98        [-1, 128, 128, 256]               0
           Conv2d-99        [-1, 512, 128, 256]          65,536
          Conv2d-100        [-1, 512, 128, 256]         131,072
     BatchNorm2d-101        [-1, 512, 128, 256]           1,024
     BatchNorm2d-102        [-1, 512, 128, 256]           1,024
            ReLU-103        [-1, 512, 128, 256]               0
      Bottleneck-104        [-1, 512, 128, 256]               0
            ReLU-105        [-1, 512, 128, 256]               0
      Bottleneck-106        [-1, 512, 128, 256]               0
          Conv2d-107        [-1, 128, 128, 256]          65,536
          Conv2d-108        [-1, 128, 128, 256]          65,536
     BatchNorm2d-109        [-1, 128, 128, 256]             256
     BatchNorm2d-110        [-1, 128, 128, 256]             256
            ReLU-111        [-1, 128, 128, 256]               0
          Conv2d-112        [-1, 128, 128, 256]         147,456
            ReLU-113        [-1, 128, 128, 256]               0
          Conv2d-114        [-1, 128, 128, 256]         147,456
     BatchNorm2d-115        [-1, 128, 128, 256]             256
     BatchNorm2d-116        [-1, 128, 128, 256]             256
            ReLU-117        [-1, 128, 128, 256]               0
          Conv2d-118        [-1, 512, 128, 256]          65,536
            ReLU-119        [-1, 128, 128, 256]               0
          Conv2d-120        [-1, 512, 128, 256]          65,536
     BatchNorm2d-121        [-1, 512, 128, 256]           1,024
     BatchNorm2d-122        [-1, 512, 128, 256]           1,024
            ReLU-123        [-1, 512, 128, 256]               0
      Bottleneck-124        [-1, 512, 128, 256]               0
            ReLU-125        [-1, 512, 128, 256]               0
      Bottleneck-126        [-1, 512, 128, 256]               0
          Conv2d-127        [-1, 128, 128, 256]          65,536
          Conv2d-128        [-1, 128, 128, 256]          65,536
     BatchNorm2d-129        [-1, 128, 128, 256]             256
     BatchNorm2d-130        [-1, 128, 128, 256]             256
            ReLU-131        [-1, 128, 128, 256]               0
          Conv2d-132        [-1, 128, 128, 256]         147,456
            ReLU-133        [-1, 128, 128, 256]               0
          Conv2d-134        [-1, 128, 128, 256]         147,456
     BatchNorm2d-135        [-1, 128, 128, 256]             256
     BatchNorm2d-136        [-1, 128, 128, 256]             256
            ReLU-137        [-1, 128, 128, 256]               0
          Conv2d-138        [-1, 512, 128, 256]          65,536
            ReLU-139        [-1, 128, 128, 256]               0
          Conv2d-140        [-1, 512, 128, 256]          65,536
     BatchNorm2d-141        [-1, 512, 128, 256]           1,024
     BatchNorm2d-142        [-1, 512, 128, 256]           1,024
            ReLU-143        [-1, 512, 128, 256]               0
      Bottleneck-144        [-1, 512, 128, 256]               0
            ReLU-145        [-1, 512, 128, 256]               0
      Bottleneck-146        [-1, 512, 128, 256]               0
          Conv2d-147        [-1, 256, 128, 256]         131,072
          Conv2d-148        [-1, 128, 128, 256]          65,536
     BatchNorm2d-149        [-1, 256, 128, 256]             512
     BatchNorm2d-150        [-1, 128, 128, 256]             256
            ReLU-151        [-1, 256, 128, 256]               0
            ReLU-152        [-1, 128, 128, 256]               0
          Conv2d-153         [-1, 256, 64, 128]         589,824
          Conv2d-154        [-1, 128, 128, 256]         147,456
     BatchNorm2d-155         [-1, 256, 64, 128]             512
     BatchNorm2d-156        [-1, 128, 128, 256]             256
            ReLU-157         [-1, 256, 64, 128]               0
            ReLU-158        [-1, 128, 128, 256]               0
          Conv2d-159        [-1, 1024, 64, 128]         262,144
          Conv2d-160        [-1, 512, 128, 256]          65,536
     BatchNorm2d-161        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-162        [-1, 512, 128, 256]           1,024
            ReLU-163        [-1, 512, 128, 256]               0
      Bottleneck-164        [-1, 512, 128, 256]               0
          Conv2d-165        [-1, 1024, 64, 128]         524,288
          Conv2d-166        [-1, 256, 128, 256]         131,072
     BatchNorm2d-167        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-168        [-1, 256, 128, 256]             512
            ReLU-169        [-1, 256, 128, 256]               0
            ReLU-170        [-1, 1024, 64, 128]               0
      Bottleneck-171        [-1, 1024, 64, 128]               0
          Conv2d-172         [-1, 256, 64, 128]         589,824
          Conv2d-173         [-1, 256, 64, 128]         262,144
     BatchNorm2d-174         [-1, 256, 64, 128]             512
     BatchNorm2d-175         [-1, 256, 64, 128]             512
            ReLU-176         [-1, 256, 64, 128]               0
          Conv2d-177        [-1, 1024, 64, 128]         262,144
            ReLU-178         [-1, 256, 64, 128]               0
          Conv2d-179         [-1, 256, 64, 128]         589,824
     BatchNorm2d-180        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-181         [-1, 256, 64, 128]             512
          Conv2d-182        [-1, 1024, 64, 128]         524,288
            ReLU-183         [-1, 256, 64, 128]               0
     BatchNorm2d-184        [-1, 1024, 64, 128]           2,048
          Conv2d-185        [-1, 1024, 64, 128]         262,144
            ReLU-186        [-1, 1024, 64, 128]               0
      Bottleneck-187        [-1, 1024, 64, 128]               0
          Conv2d-188         [-1, 256, 64, 128]         262,144
     BatchNorm2d-189        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-190         [-1, 256, 64, 128]             512
            ReLU-191        [-1, 1024, 64, 128]               0
      Bottleneck-192        [-1, 1024, 64, 128]               0
          Conv2d-193         [-1, 256, 64, 128]         262,144
            ReLU-194         [-1, 256, 64, 128]               0
          Conv2d-195         [-1, 256, 64, 128]         589,824
     BatchNorm2d-196         [-1, 256, 64, 128]             512
     BatchNorm2d-197         [-1, 256, 64, 128]             512
            ReLU-198         [-1, 256, 64, 128]               0
          Conv2d-199         [-1, 256, 64, 128]         589,824
            ReLU-200         [-1, 256, 64, 128]               0
          Conv2d-201        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-202         [-1, 256, 64, 128]             512
     BatchNorm2d-203        [-1, 1024, 64, 128]           2,048
            ReLU-204         [-1, 256, 64, 128]               0
          Conv2d-205        [-1, 1024, 64, 128]         262,144
            ReLU-206        [-1, 1024, 64, 128]               0
      Bottleneck-207        [-1, 1024, 64, 128]               0
          Conv2d-208         [-1, 256, 64, 128]         262,144
     BatchNorm2d-209        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-210         [-1, 256, 64, 128]             512
            ReLU-211        [-1, 1024, 64, 128]               0
      Bottleneck-212        [-1, 1024, 64, 128]               0
          Conv2d-213         [-1, 256, 64, 128]         262,144
     BatchNorm2d-214         [-1, 256, 64, 128]             512
            ReLU-215         [-1, 256, 64, 128]               0
            ReLU-216         [-1, 256, 64, 128]               0
          Conv2d-217         [-1, 256, 64, 128]         589,824
          Conv2d-218         [-1, 256, 64, 128]         589,824
     BatchNorm2d-219         [-1, 256, 64, 128]             512
            ReLU-220         [-1, 256, 64, 128]               0
     BatchNorm2d-221         [-1, 256, 64, 128]             512
          Conv2d-222        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-223        [-1, 1024, 64, 128]           2,048
            ReLU-224         [-1, 256, 64, 128]               0
            ReLU-225        [-1, 1024, 64, 128]               0
      Bottleneck-226        [-1, 1024, 64, 128]               0
          Conv2d-227        [-1, 1024, 64, 128]         262,144
          Conv2d-228         [-1, 256, 64, 128]         262,144
     BatchNorm2d-229         [-1, 256, 64, 128]             512
     BatchNorm2d-230        [-1, 1024, 64, 128]           2,048
            ReLU-231         [-1, 256, 64, 128]               0
          Conv2d-232         [-1, 256, 64, 128]         589,824
            ReLU-233        [-1, 1024, 64, 128]               0
      Bottleneck-234        [-1, 1024, 64, 128]               0
          Conv2d-235         [-1, 256, 64, 128]         262,144
     BatchNorm2d-236         [-1, 256, 64, 128]             512
            ReLU-237         [-1, 256, 64, 128]               0
     BatchNorm2d-238         [-1, 256, 64, 128]             512
          Conv2d-239        [-1, 1024, 64, 128]         262,144
            ReLU-240         [-1, 256, 64, 128]               0
     BatchNorm2d-241        [-1, 1024, 64, 128]           2,048
          Conv2d-242         [-1, 256, 64, 128]         589,824
            ReLU-243        [-1, 1024, 64, 128]               0
      Bottleneck-244        [-1, 1024, 64, 128]               0
          Conv2d-245         [-1, 256, 64, 128]         262,144
     BatchNorm2d-246         [-1, 256, 64, 128]             512
     BatchNorm2d-247         [-1, 256, 64, 128]             512
            ReLU-248         [-1, 256, 64, 128]               0
            ReLU-249         [-1, 256, 64, 128]               0
          Conv2d-250         [-1, 256, 64, 128]         589,824
          Conv2d-251        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-252         [-1, 256, 64, 128]             512
            ReLU-253         [-1, 256, 64, 128]               0
     BatchNorm2d-254        [-1, 1024, 64, 128]           2,048
          Conv2d-255        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-256        [-1, 1024, 64, 128]           2,048
            ReLU-257        [-1, 1024, 64, 128]               0
      Bottleneck-258        [-1, 1024, 64, 128]               0
            ReLU-259        [-1, 1024, 64, 128]               0
      Bottleneck-260        [-1, 1024, 64, 128]               0
          Conv2d-261         [-1, 256, 64, 128]         262,144
          Conv2d-262         [-1, 512, 64, 128]         524,288
     BatchNorm2d-263         [-1, 512, 64, 128]           1,024
     BatchNorm2d-264         [-1, 256, 64, 128]             512
            ReLU-265         [-1, 512, 64, 128]               0
            ReLU-266         [-1, 256, 64, 128]               0
          Conv2d-267          [-1, 512, 32, 64]       2,359,296
          Conv2d-268         [-1, 256, 64, 128]         589,824
     BatchNorm2d-269          [-1, 512, 32, 64]           1,024
            ReLU-270          [-1, 512, 32, 64]               0
     BatchNorm2d-271         [-1, 256, 64, 128]             512
          Conv2d-272         [-1, 2048, 32, 64]       1,048,576
            ReLU-273         [-1, 256, 64, 128]               0
     BatchNorm2d-274         [-1, 2048, 32, 64]           4,096
          Conv2d-275        [-1, 1024, 64, 128]         262,144
          Conv2d-276         [-1, 2048, 32, 64]       2,097,152
     BatchNorm2d-277         [-1, 2048, 32, 64]           4,096
     BatchNorm2d-278        [-1, 1024, 64, 128]           2,048
            ReLU-279         [-1, 2048, 32, 64]               0
      Bottleneck-280         [-1, 2048, 32, 64]               0
          Conv2d-281          [-1, 512, 32, 64]       1,048,576
            ReLU-282        [-1, 1024, 64, 128]               0
      Bottleneck-283        [-1, 1024, 64, 128]               0
          Conv2d-284         [-1, 256, 64, 128]         262,144
     BatchNorm2d-285          [-1, 512, 32, 64]           1,024
            ReLU-286          [-1, 512, 32, 64]               0
     BatchNorm2d-287         [-1, 256, 64, 128]             512
          Conv2d-288          [-1, 512, 32, 64]       2,359,296
            ReLU-289         [-1, 256, 64, 128]               0
     BatchNorm2d-290          [-1, 512, 32, 64]           1,024
            ReLU-291          [-1, 512, 32, 64]               0
          Conv2d-292         [-1, 256, 64, 128]         589,824
          Conv2d-293         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-294         [-1, 2048, 32, 64]           4,096
     BatchNorm2d-295         [-1, 256, 64, 128]             512
            ReLU-296         [-1, 2048, 32, 64]               0
      Bottleneck-297         [-1, 2048, 32, 64]               0
          Conv2d-298          [-1, 512, 32, 64]       1,048,576
            ReLU-299         [-1, 256, 64, 128]               0
          Conv2d-300        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-301          [-1, 512, 32, 64]           1,024
            ReLU-302          [-1, 512, 32, 64]               0
     BatchNorm2d-303        [-1, 1024, 64, 128]           2,048
          Conv2d-304          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-305          [-1, 512, 32, 64]           1,024
            ReLU-306        [-1, 1024, 64, 128]               0
      Bottleneck-307        [-1, 1024, 64, 128]               0
            ReLU-308          [-1, 512, 32, 64]               0
          Conv2d-309         [-1, 512, 64, 128]         524,288
          Conv2d-310         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-311         [-1, 2048, 32, 64]           4,096
     BatchNorm2d-312         [-1, 512, 64, 128]           1,024
            ReLU-313         [-1, 512, 64, 128]               0
            ReLU-314         [-1, 2048, 32, 64]               0
      Bottleneck-315         [-1, 2048, 32, 64]               0
          Conv2d-316          [-1, 512, 32, 64]       2,359,296
AdaptiveAvgPool2d-317           [-1, 2048, 1, 1]               0
     BatchNorm2d-318          [-1, 512, 32, 64]           1,024
            ReLU-319          [-1, 512, 32, 64]               0
          Conv2d-320         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-321         [-1, 2048, 32, 64]           4,096
          Conv2d-322         [-1, 2048, 32, 64]       2,097,152
     BatchNorm2d-323         [-1, 2048, 32, 64]           4,096
            ReLU-324         [-1, 2048, 32, 64]               0
      Bottleneck-325         [-1, 2048, 32, 64]               0
          Conv2d-326          [-1, 512, 32, 64]       1,048,576
     BatchNorm2d-327          [-1, 512, 32, 64]           1,024
            ReLU-328          [-1, 512, 32, 64]               0
          Conv2d-329          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-330          [-1, 512, 32, 64]           1,024
            ReLU-331          [-1, 512, 32, 64]               0
          Conv2d-332         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-333         [-1, 2048, 32, 64]           4,096
            ReLU-334         [-1, 2048, 32, 64]               0
      Bottleneck-335         [-1, 2048, 32, 64]               0
          Conv2d-336          [-1, 512, 32, 64]       1,048,576
     BatchNorm2d-337          [-1, 512, 32, 64]           1,024
            ReLU-338          [-1, 512, 32, 64]               0
          Conv2d-339          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-340          [-1, 512, 32, 64]           1,024
            ReLU-341          [-1, 512, 32, 64]               0
          Conv2d-342         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-343         [-1, 2048, 32, 64]           4,096
            ReLU-344         [-1, 2048, 32, 64]               0
      Bottleneck-345         [-1, 2048, 32, 64]               0
AdaptiveAvgPool2d-346           [-1, 2048, 1, 1]               0
          Linear-347                 [-1, 1000]       2,049,000
          ResNet-348                 [-1, 1000]               0
          Linear-349                 [-1, 1000]       2,049,000
          ResNet-350                 [-1, 1000]               0
================================================================
Total params: 51,114,064
Trainable params: 25,557,032
Non-trainable params: 25,557,032
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 23952.06
Params size (MB): 194.98
Estimated Total Size (MB): 24171.05
----------------------------------------------------------------
None
