----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 250, 167]           9,408
       BatchNorm2d-2         [-1, 64, 250, 167]             128
              ReLU-3         [-1, 64, 250, 167]               0
            Conv2d-4         [-1, 64, 250, 167]           9,408
         MaxPool2d-5          [-1, 64, 125, 84]               0
            Conv2d-6          [-1, 64, 125, 84]          36,864
       BatchNorm2d-7         [-1, 64, 250, 167]             128
       BatchNorm2d-8          [-1, 64, 125, 84]             128
              ReLU-9         [-1, 64, 250, 167]               0
        MaxPool2d-10          [-1, 64, 125, 84]               0
             ReLU-11          [-1, 64, 125, 84]               0
           Conv2d-12          [-1, 64, 125, 84]          36,864
           Conv2d-13          [-1, 64, 125, 84]          36,864
      BatchNorm2d-14          [-1, 64, 125, 84]             128
      BatchNorm2d-15          [-1, 64, 125, 84]             128
             ReLU-16          [-1, 64, 125, 84]               0
           Conv2d-17          [-1, 64, 125, 84]          36,864
             ReLU-18          [-1, 64, 125, 84]               0
       BasicBlock-19          [-1, 64, 125, 84]               0
           Conv2d-20          [-1, 64, 125, 84]          36,864
      BatchNorm2d-21          [-1, 64, 125, 84]             128
      BatchNorm2d-22          [-1, 64, 125, 84]             128
             ReLU-23          [-1, 64, 125, 84]               0
       BasicBlock-24          [-1, 64, 125, 84]               0
           Conv2d-25          [-1, 64, 125, 84]          36,864
             ReLU-26          [-1, 64, 125, 84]               0
           Conv2d-27          [-1, 64, 125, 84]          36,864
      BatchNorm2d-28          [-1, 64, 125, 84]             128
             ReLU-29          [-1, 64, 125, 84]               0
      BatchNorm2d-30          [-1, 64, 125, 84]             128
           Conv2d-31          [-1, 64, 125, 84]          36,864
             ReLU-32          [-1, 64, 125, 84]               0
       BasicBlock-33          [-1, 64, 125, 84]               0
      BatchNorm2d-34          [-1, 64, 125, 84]             128
             ReLU-35          [-1, 64, 125, 84]               0
       BasicBlock-36          [-1, 64, 125, 84]               0
           Conv2d-37          [-1, 128, 63, 42]          73,728
           Conv2d-38          [-1, 128, 63, 42]          73,728
      BatchNorm2d-39          [-1, 128, 63, 42]             256
             ReLU-40          [-1, 128, 63, 42]               0
      BatchNorm2d-41          [-1, 128, 63, 42]             256
           Conv2d-42          [-1, 128, 63, 42]         147,456
             ReLU-43          [-1, 128, 63, 42]               0
      BatchNorm2d-44          [-1, 128, 63, 42]             256
           Conv2d-45          [-1, 128, 63, 42]         147,456
           Conv2d-46          [-1, 128, 63, 42]           8,192
      BatchNorm2d-47          [-1, 128, 63, 42]             256
      BatchNorm2d-48          [-1, 128, 63, 42]             256
           Conv2d-49          [-1, 128, 63, 42]           8,192
             ReLU-50          [-1, 128, 63, 42]               0
       BasicBlock-51          [-1, 128, 63, 42]               0
      BatchNorm2d-52          [-1, 128, 63, 42]             256
           Conv2d-53          [-1, 128, 63, 42]         147,456
             ReLU-54          [-1, 128, 63, 42]               0
       BasicBlock-55          [-1, 128, 63, 42]               0
      BatchNorm2d-56          [-1, 128, 63, 42]             256
           Conv2d-57          [-1, 128, 63, 42]         147,456
             ReLU-58          [-1, 128, 63, 42]               0
           Conv2d-59          [-1, 128, 63, 42]         147,456
      BatchNorm2d-60          [-1, 128, 63, 42]             256
             ReLU-61          [-1, 128, 63, 42]               0
      BatchNorm2d-62          [-1, 128, 63, 42]             256
           Conv2d-63          [-1, 128, 63, 42]         147,456
             ReLU-64          [-1, 128, 63, 42]               0
       BasicBlock-65          [-1, 128, 63, 42]               0
      BatchNorm2d-66          [-1, 128, 63, 42]             256
           Conv2d-67          [-1, 256, 32, 21]         294,912
             ReLU-68          [-1, 128, 63, 42]               0
       BasicBlock-69          [-1, 128, 63, 42]               0
           Conv2d-70          [-1, 256, 32, 21]         294,912
      BatchNorm2d-71          [-1, 256, 32, 21]             512
      BatchNorm2d-72          [-1, 256, 32, 21]             512
             ReLU-73          [-1, 256, 32, 21]               0
             ReLU-74          [-1, 256, 32, 21]               0
           Conv2d-75          [-1, 256, 32, 21]         589,824
           Conv2d-76          [-1, 256, 32, 21]         589,824
      BatchNorm2d-77          [-1, 256, 32, 21]             512
      BatchNorm2d-78          [-1, 256, 32, 21]             512
           Conv2d-79          [-1, 256, 32, 21]          32,768
           Conv2d-80          [-1, 256, 32, 21]          32,768
      BatchNorm2d-81          [-1, 256, 32, 21]             512
             ReLU-82          [-1, 256, 32, 21]               0
       BasicBlock-83          [-1, 256, 32, 21]               0
           Conv2d-84          [-1, 256, 32, 21]         589,824
      BatchNorm2d-85          [-1, 256, 32, 21]             512
      BatchNorm2d-86          [-1, 256, 32, 21]             512
             ReLU-87          [-1, 256, 32, 21]               0
       BasicBlock-88          [-1, 256, 32, 21]               0
           Conv2d-89          [-1, 256, 32, 21]         589,824
             ReLU-90          [-1, 256, 32, 21]               0
           Conv2d-91          [-1, 256, 32, 21]         589,824
      BatchNorm2d-92          [-1, 256, 32, 21]             512
      BatchNorm2d-93          [-1, 256, 32, 21]             512
             ReLU-94          [-1, 256, 32, 21]               0
           Conv2d-95          [-1, 256, 32, 21]         589,824
             ReLU-96          [-1, 256, 32, 21]               0
       BasicBlock-97          [-1, 256, 32, 21]               0
           Conv2d-98          [-1, 512, 16, 11]       1,179,648
      BatchNorm2d-99          [-1, 256, 32, 21]             512
     BatchNorm2d-100          [-1, 512, 16, 11]           1,024
            ReLU-101          [-1, 256, 32, 21]               0
      BasicBlock-102          [-1, 256, 32, 21]               0
          Conv2d-103          [-1, 512, 16, 11]       1,179,648
            ReLU-104          [-1, 512, 16, 11]               0
     BatchNorm2d-105          [-1, 512, 16, 11]           1,024
            ReLU-106          [-1, 512, 16, 11]               0
          Conv2d-107          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-108          [-1, 512, 16, 11]           1,024
          Conv2d-109          [-1, 512, 16, 11]       2,359,296
          Conv2d-110          [-1, 512, 16, 11]         131,072
     BatchNorm2d-111          [-1, 512, 16, 11]           1,024
     BatchNorm2d-112          [-1, 512, 16, 11]           1,024
          Conv2d-113          [-1, 512, 16, 11]         131,072
            ReLU-114          [-1, 512, 16, 11]               0
      BasicBlock-115          [-1, 512, 16, 11]               0
     BatchNorm2d-116          [-1, 512, 16, 11]           1,024
          Conv2d-117          [-1, 512, 16, 11]       2,359,296
            ReLU-118          [-1, 512, 16, 11]               0
      BasicBlock-119          [-1, 512, 16, 11]               0
     BatchNorm2d-120          [-1, 512, 16, 11]           1,024
          Conv2d-121          [-1, 512, 16, 11]       2,359,296
            ReLU-122          [-1, 512, 16, 11]               0
          Conv2d-123          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-124          [-1, 512, 16, 11]           1,024
            ReLU-125          [-1, 512, 16, 11]               0
     BatchNorm2d-126          [-1, 512, 16, 11]           1,024
          Conv2d-127          [-1, 512, 16, 11]       2,359,296
            ReLU-128          [-1, 512, 16, 11]               0
      BasicBlock-129          [-1, 512, 16, 11]               0
     BatchNorm2d-130          [-1, 512, 16, 11]           1,024
AdaptiveAvgPool2d-131            [-1, 512, 1, 1]               0
            ReLU-132          [-1, 512, 16, 11]               0
      BasicBlock-133          [-1, 512, 16, 11]               0
AdaptiveAvgPool2d-134            [-1, 512, 1, 1]               0
          Linear-135                 [-1, 1000]         513,000
          ResNet-136                 [-1, 1000]               0
          Linear-137                 [-1, 1000]         513,000
          ResNet-138                 [-1, 1000]               0
================================================================
Total params: 23,379,024
Trainable params: 11,689,512
Non-trainable params: 11,689,512
----------------------------------------------------------------
Input size (MB): 1.91
Forward/backward pass size (MB): 422.85
Params size (MB): 89.18
Estimated Total Size (MB): 513.94
----------------------------------------------------------------
None
