----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 64, 512, 1024]           9,408
            Conv2d-2        [-1, 64, 512, 1024]           9,408
       BatchNorm2d-3        [-1, 64, 512, 1024]             128
              ReLU-4        [-1, 64, 512, 1024]               0
         MaxPool2d-5         [-1, 64, 256, 512]               0
       BatchNorm2d-6        [-1, 64, 512, 1024]             128
              ReLU-7        [-1, 64, 512, 1024]               0
         MaxPool2d-8         [-1, 64, 256, 512]               0
            Conv2d-9         [-1, 64, 256, 512]          36,864
           Conv2d-10         [-1, 64, 256, 512]          36,864
      BatchNorm2d-11         [-1, 64, 256, 512]             128
      BatchNorm2d-12         [-1, 64, 256, 512]             128
             ReLU-13         [-1, 64, 256, 512]               0
             ReLU-14         [-1, 64, 256, 512]               0
           Conv2d-15         [-1, 64, 256, 512]          36,864
           Conv2d-16         [-1, 64, 256, 512]          36,864
      BatchNorm2d-17         [-1, 64, 256, 512]             128
      BatchNorm2d-18         [-1, 64, 256, 512]             128
             ReLU-19         [-1, 64, 256, 512]               0
       BasicBlock-20         [-1, 64, 256, 512]               0
             ReLU-21         [-1, 64, 256, 512]               0
       BasicBlock-22         [-1, 64, 256, 512]               0
           Conv2d-23         [-1, 64, 256, 512]          36,864
           Conv2d-24         [-1, 64, 256, 512]          36,864
      BatchNorm2d-25         [-1, 64, 256, 512]             128
      BatchNorm2d-26         [-1, 64, 256, 512]             128
             ReLU-27         [-1, 64, 256, 512]               0
           Conv2d-28         [-1, 64, 256, 512]          36,864
             ReLU-29         [-1, 64, 256, 512]               0
           Conv2d-30         [-1, 64, 256, 512]          36,864
      BatchNorm2d-31         [-1, 64, 256, 512]             128
      BatchNorm2d-32         [-1, 64, 256, 512]             128
             ReLU-33         [-1, 64, 256, 512]               0
       BasicBlock-34         [-1, 64, 256, 512]               0
             ReLU-35         [-1, 64, 256, 512]               0
       BasicBlock-36         [-1, 64, 256, 512]               0
           Conv2d-37        [-1, 128, 128, 256]          73,728
           Conv2d-38        [-1, 128, 128, 256]          73,728
      BatchNorm2d-39        [-1, 128, 128, 256]             256
      BatchNorm2d-40        [-1, 128, 128, 256]             256
             ReLU-41        [-1, 128, 128, 256]               0
             ReLU-42        [-1, 128, 128, 256]               0
           Conv2d-43        [-1, 128, 128, 256]         147,456
           Conv2d-44        [-1, 128, 128, 256]         147,456
      BatchNorm2d-45        [-1, 128, 128, 256]             256
      BatchNorm2d-46        [-1, 128, 128, 256]             256
           Conv2d-47        [-1, 128, 128, 256]           8,192
           Conv2d-48        [-1, 128, 128, 256]           8,192
      BatchNorm2d-49        [-1, 128, 128, 256]             256
      BatchNorm2d-50        [-1, 128, 128, 256]             256
             ReLU-51        [-1, 128, 128, 256]               0
       BasicBlock-52        [-1, 128, 128, 256]               0
             ReLU-53        [-1, 128, 128, 256]               0
       BasicBlock-54        [-1, 128, 128, 256]               0
           Conv2d-55        [-1, 128, 128, 256]         147,456
           Conv2d-56        [-1, 128, 128, 256]         147,456
      BatchNorm2d-57        [-1, 128, 128, 256]             256
      BatchNorm2d-58        [-1, 128, 128, 256]             256
             ReLU-59        [-1, 128, 128, 256]               0
           Conv2d-60        [-1, 128, 128, 256]         147,456
             ReLU-61        [-1, 128, 128, 256]               0
           Conv2d-62        [-1, 128, 128, 256]         147,456
      BatchNorm2d-63        [-1, 128, 128, 256]             256
      BatchNorm2d-64        [-1, 128, 128, 256]             256
             ReLU-65        [-1, 128, 128, 256]               0
       BasicBlock-66        [-1, 128, 128, 256]               0
           Conv2d-67         [-1, 256, 64, 128]         294,912
             ReLU-68        [-1, 128, 128, 256]               0
       BasicBlock-69        [-1, 128, 128, 256]               0
           Conv2d-70         [-1, 256, 64, 128]         294,912
      BatchNorm2d-71         [-1, 256, 64, 128]             512
             ReLU-72         [-1, 256, 64, 128]               0
      BatchNorm2d-73         [-1, 256, 64, 128]             512
           Conv2d-74         [-1, 256, 64, 128]         589,824
             ReLU-75         [-1, 256, 64, 128]               0
           Conv2d-76         [-1, 256, 64, 128]         589,824
      BatchNorm2d-77         [-1, 256, 64, 128]             512
      BatchNorm2d-78         [-1, 256, 64, 128]             512
           Conv2d-79         [-1, 256, 64, 128]          32,768
           Conv2d-80         [-1, 256, 64, 128]          32,768
      BatchNorm2d-81         [-1, 256, 64, 128]             512
      BatchNorm2d-82         [-1, 256, 64, 128]             512
             ReLU-83         [-1, 256, 64, 128]               0
       BasicBlock-84         [-1, 256, 64, 128]               0
           Conv2d-85         [-1, 256, 64, 128]         589,824
             ReLU-86         [-1, 256, 64, 128]               0
       BasicBlock-87         [-1, 256, 64, 128]               0
           Conv2d-88         [-1, 256, 64, 128]         589,824
      BatchNorm2d-89         [-1, 256, 64, 128]             512
             ReLU-90         [-1, 256, 64, 128]               0
      BatchNorm2d-91         [-1, 256, 64, 128]             512
           Conv2d-92         [-1, 256, 64, 128]         589,824
             ReLU-93         [-1, 256, 64, 128]               0
           Conv2d-94         [-1, 256, 64, 128]         589,824
      BatchNorm2d-95         [-1, 256, 64, 128]             512
      BatchNorm2d-96         [-1, 256, 64, 128]             512
             ReLU-97         [-1, 256, 64, 128]               0
       BasicBlock-98         [-1, 256, 64, 128]               0
           Conv2d-99          [-1, 512, 32, 64]       1,179,648
            ReLU-100         [-1, 256, 64, 128]               0
      BasicBlock-101         [-1, 256, 64, 128]               0
          Conv2d-102          [-1, 512, 32, 64]       1,179,648
     BatchNorm2d-103          [-1, 512, 32, 64]           1,024
            ReLU-104          [-1, 512, 32, 64]               0
     BatchNorm2d-105          [-1, 512, 32, 64]           1,024
          Conv2d-106          [-1, 512, 32, 64]       2,359,296
            ReLU-107          [-1, 512, 32, 64]               0
          Conv2d-108          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-109          [-1, 512, 32, 64]           1,024
     BatchNorm2d-110          [-1, 512, 32, 64]           1,024
          Conv2d-111          [-1, 512, 32, 64]         131,072
          Conv2d-112          [-1, 512, 32, 64]         131,072
     BatchNorm2d-113          [-1, 512, 32, 64]           1,024
     BatchNorm2d-114          [-1, 512, 32, 64]           1,024
            ReLU-115          [-1, 512, 32, 64]               0
      BasicBlock-116          [-1, 512, 32, 64]               0
          Conv2d-117          [-1, 512, 32, 64]       2,359,296
            ReLU-118          [-1, 512, 32, 64]               0
      BasicBlock-119          [-1, 512, 32, 64]               0
          Conv2d-120          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-121          [-1, 512, 32, 64]           1,024
            ReLU-122          [-1, 512, 32, 64]               0
     BatchNorm2d-123          [-1, 512, 32, 64]           1,024
          Conv2d-124          [-1, 512, 32, 64]       2,359,296
            ReLU-125          [-1, 512, 32, 64]               0
          Conv2d-126          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-127          [-1, 512, 32, 64]           1,024
     BatchNorm2d-128          [-1, 512, 32, 64]           1,024
            ReLU-129          [-1, 512, 32, 64]               0
      BasicBlock-130          [-1, 512, 32, 64]               0
AdaptiveAvgPool2d-131            [-1, 512, 1, 1]               0
            ReLU-132          [-1, 512, 32, 64]               0
      BasicBlock-133          [-1, 512, 32, 64]               0
AdaptiveAvgPool2d-134            [-1, 512, 1, 1]               0
          Linear-135                 [-1, 1000]         513,000
          ResNet-136                 [-1, 1000]               0
          Linear-137                 [-1, 1000]         513,000
          ResNet-138                 [-1, 1000]               0
================================================================
Total params: 23,379,024
Trainable params: 11,689,512
Non-trainable params: 11,689,512
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 5248.04
Params size (MB): 89.18
Estimated Total Size (MB): 5361.22
----------------------------------------------------------------
None
