----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 32, 511, 1023]             864
       BatchNorm2d-2        [-1, 32, 511, 1023]              64
              ReLU-3        [-1, 32, 511, 1023]               0
            Conv2d-4        [-1, 64, 509, 1021]          18,432
       BatchNorm2d-5        [-1, 64, 509, 1021]             128
              ReLU-6        [-1, 64, 509, 1021]               0
            Conv2d-7        [-1, 64, 509, 1021]             576
            Conv2d-8       [-1, 128, 509, 1021]           8,192
   SeparableConv2d-9       [-1, 128, 509, 1021]               0
      BatchNorm2d-10       [-1, 128, 509, 1021]             256
             ReLU-11       [-1, 128, 509, 1021]               0
             ReLU-12       [-1, 128, 509, 1021]               0
           Conv2d-13       [-1, 128, 509, 1021]           1,152
           Conv2d-14       [-1, 128, 509, 1021]          16,384
  SeparableConv2d-15       [-1, 128, 509, 1021]               0
      BatchNorm2d-16       [-1, 128, 509, 1021]             256
        MaxPool2d-17        [-1, 128, 255, 511]               0
           Conv2d-18        [-1, 128, 255, 511]           8,192
      BatchNorm2d-19        [-1, 128, 255, 511]             256
            Block-20        [-1, 128, 255, 511]               0
             ReLU-21        [-1, 128, 255, 511]               0
           Conv2d-22        [-1, 128, 255, 511]           1,152
           Conv2d-23        [-1, 256, 255, 511]          32,768
  SeparableConv2d-24        [-1, 256, 255, 511]               0
      BatchNorm2d-25        [-1, 256, 255, 511]             512
             ReLU-26        [-1, 256, 255, 511]               0
             ReLU-27        [-1, 256, 255, 511]               0
           Conv2d-28        [-1, 256, 255, 511]           2,304
           Conv2d-29        [-1, 256, 255, 511]          65,536
  SeparableConv2d-30        [-1, 256, 255, 511]               0
      BatchNorm2d-31        [-1, 256, 255, 511]             512
        MaxPool2d-32        [-1, 256, 128, 256]               0
           Conv2d-33        [-1, 256, 128, 256]          32,768
      BatchNorm2d-34        [-1, 256, 128, 256]             512
            Block-35        [-1, 256, 128, 256]               0
             ReLU-36        [-1, 256, 128, 256]               0
           Conv2d-37        [-1, 256, 128, 256]           2,304
           Conv2d-38        [-1, 728, 128, 256]         186,368
  SeparableConv2d-39        [-1, 728, 128, 256]               0
      BatchNorm2d-40        [-1, 728, 128, 256]           1,456
             ReLU-41        [-1, 728, 128, 256]               0
             ReLU-42        [-1, 728, 128, 256]               0
           Conv2d-43        [-1, 728, 128, 256]           6,552
           Conv2d-44        [-1, 728, 128, 256]         529,984
  SeparableConv2d-45        [-1, 728, 128, 256]               0
      BatchNorm2d-46        [-1, 728, 128, 256]           1,456
        MaxPool2d-47         [-1, 728, 64, 128]               0
           Conv2d-48         [-1, 728, 64, 128]         186,368
      BatchNorm2d-49         [-1, 728, 64, 128]           1,456
            Block-50         [-1, 728, 64, 128]               0
             ReLU-51         [-1, 728, 64, 128]               0
           Conv2d-52         [-1, 728, 64, 128]           6,552
           Conv2d-53         [-1, 728, 64, 128]         529,984
  SeparableConv2d-54         [-1, 728, 64, 128]               0
      BatchNorm2d-55         [-1, 728, 64, 128]           1,456
             ReLU-56         [-1, 728, 64, 128]               0
             ReLU-57         [-1, 728, 64, 128]               0
           Conv2d-58         [-1, 728, 64, 128]           6,552
           Conv2d-59         [-1, 728, 64, 128]         529,984
  SeparableConv2d-60         [-1, 728, 64, 128]               0
      BatchNorm2d-61         [-1, 728, 64, 128]           1,456
             ReLU-62         [-1, 728, 64, 128]               0
             ReLU-63         [-1, 728, 64, 128]               0
           Conv2d-64         [-1, 728, 64, 128]           6,552
           Conv2d-65         [-1, 728, 64, 128]         529,984
  SeparableConv2d-66         [-1, 728, 64, 128]               0
      BatchNorm2d-67         [-1, 728, 64, 128]           1,456
            Block-68         [-1, 728, 64, 128]               0
             ReLU-69         [-1, 728, 64, 128]               0
           Conv2d-70         [-1, 728, 64, 128]           6,552
           Conv2d-71         [-1, 728, 64, 128]         529,984
  SeparableConv2d-72         [-1, 728, 64, 128]               0
      BatchNorm2d-73         [-1, 728, 64, 128]           1,456
             ReLU-74         [-1, 728, 64, 128]               0
             ReLU-75         [-1, 728, 64, 128]               0
           Conv2d-76         [-1, 728, 64, 128]           6,552
           Conv2d-77         [-1, 728, 64, 128]         529,984
  SeparableConv2d-78         [-1, 728, 64, 128]               0
      BatchNorm2d-79         [-1, 728, 64, 128]           1,456
             ReLU-80         [-1, 728, 64, 128]               0
             ReLU-81         [-1, 728, 64, 128]               0
           Conv2d-82         [-1, 728, 64, 128]           6,552
           Conv2d-83         [-1, 728, 64, 128]         529,984
  SeparableConv2d-84         [-1, 728, 64, 128]               0
      BatchNorm2d-85         [-1, 728, 64, 128]           1,456
            Block-86         [-1, 728, 64, 128]               0
             ReLU-87         [-1, 728, 64, 128]               0
           Conv2d-88         [-1, 728, 64, 128]           6,552
           Conv2d-89         [-1, 728, 64, 128]         529,984
  SeparableConv2d-90         [-1, 728, 64, 128]               0
      BatchNorm2d-91         [-1, 728, 64, 128]           1,456
             ReLU-92         [-1, 728, 64, 128]               0
             ReLU-93         [-1, 728, 64, 128]               0
           Conv2d-94         [-1, 728, 64, 128]           6,552
           Conv2d-95         [-1, 728, 64, 128]         529,984
  SeparableConv2d-96         [-1, 728, 64, 128]               0
      BatchNorm2d-97         [-1, 728, 64, 128]           1,456
             ReLU-98         [-1, 728, 64, 128]               0
             ReLU-99         [-1, 728, 64, 128]               0
          Conv2d-100         [-1, 728, 64, 128]           6,552
          Conv2d-101         [-1, 728, 64, 128]         529,984
 SeparableConv2d-102         [-1, 728, 64, 128]               0
     BatchNorm2d-103         [-1, 728, 64, 128]           1,456
           Block-104         [-1, 728, 64, 128]               0
            ReLU-105         [-1, 728, 64, 128]               0
          Conv2d-106         [-1, 728, 64, 128]           6,552
          Conv2d-107         [-1, 728, 64, 128]         529,984
 SeparableConv2d-108         [-1, 728, 64, 128]               0
     BatchNorm2d-109         [-1, 728, 64, 128]           1,456
            ReLU-110         [-1, 728, 64, 128]               0
            ReLU-111         [-1, 728, 64, 128]               0
          Conv2d-112         [-1, 728, 64, 128]           6,552
          Conv2d-113         [-1, 728, 64, 128]         529,984
 SeparableConv2d-114         [-1, 728, 64, 128]               0
     BatchNorm2d-115         [-1, 728, 64, 128]           1,456
            ReLU-116         [-1, 728, 64, 128]               0
            ReLU-117         [-1, 728, 64, 128]               0
          Conv2d-118         [-1, 728, 64, 128]           6,552
          Conv2d-119         [-1, 728, 64, 128]         529,984
 SeparableConv2d-120         [-1, 728, 64, 128]               0
     BatchNorm2d-121         [-1, 728, 64, 128]           1,456
           Block-122         [-1, 728, 64, 128]               0
            ReLU-123         [-1, 728, 64, 128]               0
          Conv2d-124         [-1, 728, 64, 128]           6,552
          Conv2d-125         [-1, 728, 64, 128]         529,984
 SeparableConv2d-126         [-1, 728, 64, 128]               0
     BatchNorm2d-127         [-1, 728, 64, 128]           1,456
            ReLU-128         [-1, 728, 64, 128]               0
            ReLU-129         [-1, 728, 64, 128]               0
          Conv2d-130         [-1, 728, 64, 128]           6,552
          Conv2d-131         [-1, 728, 64, 128]         529,984
 SeparableConv2d-132         [-1, 728, 64, 128]               0
     BatchNorm2d-133         [-1, 728, 64, 128]           1,456
            ReLU-134         [-1, 728, 64, 128]               0
            ReLU-135         [-1, 728, 64, 128]               0
          Conv2d-136         [-1, 728, 64, 128]           6,552
          Conv2d-137         [-1, 728, 64, 128]         529,984
 SeparableConv2d-138         [-1, 728, 64, 128]               0
     BatchNorm2d-139         [-1, 728, 64, 128]           1,456
           Block-140         [-1, 728, 64, 128]               0
            ReLU-141         [-1, 728, 64, 128]               0
          Conv2d-142         [-1, 728, 64, 128]           6,552
          Conv2d-143         [-1, 728, 64, 128]         529,984
 SeparableConv2d-144         [-1, 728, 64, 128]               0
     BatchNorm2d-145         [-1, 728, 64, 128]           1,456
            ReLU-146         [-1, 728, 64, 128]               0
            ReLU-147         [-1, 728, 64, 128]               0
          Conv2d-148         [-1, 728, 64, 128]           6,552
          Conv2d-149         [-1, 728, 64, 128]         529,984
 SeparableConv2d-150         [-1, 728, 64, 128]               0
     BatchNorm2d-151         [-1, 728, 64, 128]           1,456
            ReLU-152         [-1, 728, 64, 128]               0
            ReLU-153         [-1, 728, 64, 128]               0
          Conv2d-154         [-1, 728, 64, 128]           6,552
          Conv2d-155         [-1, 728, 64, 128]         529,984
 SeparableConv2d-156         [-1, 728, 64, 128]               0
     BatchNorm2d-157         [-1, 728, 64, 128]           1,456
           Block-158         [-1, 728, 64, 128]               0
            ReLU-159         [-1, 728, 64, 128]               0
          Conv2d-160         [-1, 728, 64, 128]           6,552
          Conv2d-161         [-1, 728, 64, 128]         529,984
 SeparableConv2d-162         [-1, 728, 64, 128]               0
     BatchNorm2d-163         [-1, 728, 64, 128]           1,456
            ReLU-164         [-1, 728, 64, 128]               0
            ReLU-165         [-1, 728, 64, 128]               0
          Conv2d-166         [-1, 728, 64, 128]           6,552
          Conv2d-167         [-1, 728, 64, 128]         529,984
 SeparableConv2d-168         [-1, 728, 64, 128]               0
     BatchNorm2d-169         [-1, 728, 64, 128]           1,456
            ReLU-170         [-1, 728, 64, 128]               0
            ReLU-171         [-1, 728, 64, 128]               0
          Conv2d-172         [-1, 728, 64, 128]           6,552
          Conv2d-173         [-1, 728, 64, 128]         529,984
 SeparableConv2d-174         [-1, 728, 64, 128]               0
     BatchNorm2d-175         [-1, 728, 64, 128]           1,456
           Block-176         [-1, 728, 64, 128]               0
            ReLU-177         [-1, 728, 64, 128]               0
          Conv2d-178         [-1, 728, 64, 128]           6,552
          Conv2d-179         [-1, 728, 64, 128]         529,984
 SeparableConv2d-180         [-1, 728, 64, 128]               0
     BatchNorm2d-181         [-1, 728, 64, 128]           1,456
            ReLU-182         [-1, 728, 64, 128]               0
            ReLU-183         [-1, 728, 64, 128]               0
          Conv2d-184         [-1, 728, 64, 128]           6,552
          Conv2d-185         [-1, 728, 64, 128]         529,984
 SeparableConv2d-186         [-1, 728, 64, 128]               0
     BatchNorm2d-187         [-1, 728, 64, 128]           1,456
            ReLU-188         [-1, 728, 64, 128]               0
            ReLU-189         [-1, 728, 64, 128]               0
          Conv2d-190         [-1, 728, 64, 128]           6,552
          Conv2d-191         [-1, 728, 64, 128]         529,984
 SeparableConv2d-192         [-1, 728, 64, 128]               0
     BatchNorm2d-193         [-1, 728, 64, 128]           1,456
           Block-194         [-1, 728, 64, 128]               0
            ReLU-195         [-1, 728, 64, 128]               0
          Conv2d-196         [-1, 728, 64, 128]           6,552
          Conv2d-197         [-1, 728, 64, 128]         529,984
 SeparableConv2d-198         [-1, 728, 64, 128]               0
     BatchNorm2d-199         [-1, 728, 64, 128]           1,456
            ReLU-200         [-1, 728, 64, 128]               0
            ReLU-201         [-1, 728, 64, 128]               0
          Conv2d-202         [-1, 728, 64, 128]           6,552
          Conv2d-203        [-1, 1024, 64, 128]         745,472
 SeparableConv2d-204        [-1, 1024, 64, 128]               0
     BatchNorm2d-205        [-1, 1024, 64, 128]           2,048
       MaxPool2d-206         [-1, 1024, 32, 64]               0
          Conv2d-207         [-1, 1024, 32, 64]         745,472
     BatchNorm2d-208         [-1, 1024, 32, 64]           2,048
           Block-209         [-1, 1024, 32, 64]               0
          Conv2d-210         [-1, 1024, 32, 64]           9,216
          Conv2d-211         [-1, 1536, 32, 64]       1,572,864
 SeparableConv2d-212         [-1, 1536, 32, 64]               0
     BatchNorm2d-213         [-1, 1536, 32, 64]           3,072
            ReLU-214         [-1, 1536, 32, 64]               0
          Conv2d-215         [-1, 1536, 32, 64]          13,824
          Conv2d-216         [-1, 2048, 32, 64]       3,145,728
 SeparableConv2d-217         [-1, 2048, 32, 64]               0
     BatchNorm2d-218         [-1, 2048, 32, 64]           4,096
            ReLU-219         [-1, 2048, 32, 64]               0
          Linear-220                 [-1, 1000]       2,049,000
================================================================
Total params: 22,855,952
Trainable params: 22,855,952
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 18659.50
Params size (MB): 87.19
Estimated Total Size (MB): 18770.69
----------------------------------------------------------------
None
