----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 250, 167]           9,408
       BatchNorm2d-2         [-1, 64, 250, 167]             128
              ReLU-3         [-1, 64, 250, 167]               0
            Conv2d-4         [-1, 64, 250, 167]           9,408
         MaxPool2d-5          [-1, 64, 125, 84]               0
            Conv2d-6          [-1, 64, 125, 84]           4,096
       BatchNorm2d-7          [-1, 64, 125, 84]             128
       BatchNorm2d-8         [-1, 64, 250, 167]             128
              ReLU-9          [-1, 64, 125, 84]               0
             ReLU-10         [-1, 64, 250, 167]               0
           Conv2d-11          [-1, 64, 125, 84]          36,864
        MaxPool2d-12          [-1, 64, 125, 84]               0
           Conv2d-13          [-1, 64, 125, 84]           4,096
      BatchNorm2d-14          [-1, 64, 125, 84]             128
      BatchNorm2d-15          [-1, 64, 125, 84]             128
             ReLU-16          [-1, 64, 125, 84]               0
             ReLU-17          [-1, 64, 125, 84]               0
           Conv2d-18         [-1, 256, 125, 84]          16,384
           Conv2d-19          [-1, 64, 125, 84]          36,864
      BatchNorm2d-20         [-1, 256, 125, 84]             512
      BatchNorm2d-21          [-1, 64, 125, 84]             128
           Conv2d-22         [-1, 256, 125, 84]          16,384
             ReLU-23          [-1, 64, 125, 84]               0
           Conv2d-24         [-1, 256, 125, 84]          16,384
      BatchNorm2d-25         [-1, 256, 125, 84]             512
           Conv2d-26         [-1, 256, 125, 84]          16,384
      BatchNorm2d-27         [-1, 256, 125, 84]             512
             ReLU-28         [-1, 256, 125, 84]               0
       Bottleneck-29         [-1, 256, 125, 84]               0
           Conv2d-30          [-1, 64, 125, 84]          16,384
      BatchNorm2d-31          [-1, 64, 125, 84]             128
      BatchNorm2d-32         [-1, 256, 125, 84]             512
             ReLU-33          [-1, 64, 125, 84]               0
           Conv2d-34          [-1, 64, 125, 84]          36,864
             ReLU-35         [-1, 256, 125, 84]               0
       Bottleneck-36         [-1, 256, 125, 84]               0
      BatchNorm2d-37          [-1, 64, 125, 84]             128
             ReLU-38          [-1, 64, 125, 84]               0
           Conv2d-39          [-1, 64, 125, 84]          16,384
           Conv2d-40         [-1, 256, 125, 84]          16,384
      BatchNorm2d-41         [-1, 256, 125, 84]             512
             ReLU-42         [-1, 256, 125, 84]               0
       Bottleneck-43         [-1, 256, 125, 84]               0
      BatchNorm2d-44          [-1, 64, 125, 84]             128
           Conv2d-45          [-1, 64, 125, 84]          16,384
      BatchNorm2d-46          [-1, 64, 125, 84]             128
             ReLU-47          [-1, 64, 125, 84]               0
             ReLU-48          [-1, 64, 125, 84]               0
           Conv2d-49          [-1, 64, 125, 84]          36,864
           Conv2d-50          [-1, 64, 125, 84]          36,864
      BatchNorm2d-51          [-1, 64, 125, 84]             128
      BatchNorm2d-52          [-1, 64, 125, 84]             128
             ReLU-53          [-1, 64, 125, 84]               0
           Conv2d-54         [-1, 256, 125, 84]          16,384
             ReLU-55          [-1, 64, 125, 84]               0
           Conv2d-56         [-1, 256, 125, 84]          16,384
      BatchNorm2d-57         [-1, 256, 125, 84]             512
             ReLU-58         [-1, 256, 125, 84]               0
       Bottleneck-59         [-1, 256, 125, 84]               0
      BatchNorm2d-60         [-1, 256, 125, 84]             512
           Conv2d-61         [-1, 128, 125, 84]          32,768
      BatchNorm2d-62         [-1, 128, 125, 84]             256
             ReLU-63         [-1, 256, 125, 84]               0
       Bottleneck-64         [-1, 256, 125, 84]               0
             ReLU-65         [-1, 128, 125, 84]               0
           Conv2d-66          [-1, 64, 125, 84]          16,384
           Conv2d-67          [-1, 128, 63, 42]         147,456
      BatchNorm2d-68          [-1, 128, 63, 42]             256
      BatchNorm2d-69          [-1, 64, 125, 84]             128
             ReLU-70          [-1, 128, 63, 42]               0
           Conv2d-71          [-1, 512, 63, 42]          65,536
             ReLU-72          [-1, 64, 125, 84]               0
           Conv2d-73          [-1, 64, 125, 84]          36,864
      BatchNorm2d-74          [-1, 512, 63, 42]           1,024
           Conv2d-75          [-1, 512, 63, 42]         131,072
      BatchNorm2d-76          [-1, 64, 125, 84]             128
      BatchNorm2d-77          [-1, 512, 63, 42]           1,024
             ReLU-78          [-1, 64, 125, 84]               0
             ReLU-79          [-1, 512, 63, 42]               0
       Bottleneck-80          [-1, 512, 63, 42]               0
           Conv2d-81         [-1, 256, 125, 84]          16,384
           Conv2d-82          [-1, 128, 63, 42]          65,536
      BatchNorm2d-83          [-1, 128, 63, 42]             256
      BatchNorm2d-84         [-1, 256, 125, 84]             512
             ReLU-85          [-1, 128, 63, 42]               0
           Conv2d-86          [-1, 128, 63, 42]         147,456
             ReLU-87         [-1, 256, 125, 84]               0
       Bottleneck-88         [-1, 256, 125, 84]               0
           Conv2d-89         [-1, 128, 125, 84]          32,768
      BatchNorm2d-90          [-1, 128, 63, 42]             256
             ReLU-91          [-1, 128, 63, 42]               0
      BatchNorm2d-92         [-1, 128, 125, 84]             256
           Conv2d-93          [-1, 512, 63, 42]          65,536
             ReLU-94         [-1, 128, 125, 84]               0
      BatchNorm2d-95          [-1, 512, 63, 42]           1,024
           Conv2d-96          [-1, 128, 63, 42]         147,456
             ReLU-97          [-1, 512, 63, 42]               0
       Bottleneck-98          [-1, 512, 63, 42]               0
           Conv2d-99          [-1, 128, 63, 42]          65,536
     BatchNorm2d-100          [-1, 128, 63, 42]             256
     BatchNorm2d-101          [-1, 128, 63, 42]             256
            ReLU-102          [-1, 128, 63, 42]               0
            ReLU-103          [-1, 128, 63, 42]               0
          Conv2d-104          [-1, 512, 63, 42]          65,536
          Conv2d-105          [-1, 128, 63, 42]         147,456
     BatchNorm2d-106          [-1, 512, 63, 42]           1,024
     BatchNorm2d-107          [-1, 128, 63, 42]             256
            ReLU-108          [-1, 128, 63, 42]               0
          Conv2d-109          [-1, 512, 63, 42]         131,072
          Conv2d-110          [-1, 512, 63, 42]          65,536
     BatchNorm2d-111          [-1, 512, 63, 42]           1,024
     BatchNorm2d-112          [-1, 512, 63, 42]           1,024
            ReLU-113          [-1, 512, 63, 42]               0
      Bottleneck-114          [-1, 512, 63, 42]               0
            ReLU-115          [-1, 512, 63, 42]               0
      Bottleneck-116          [-1, 512, 63, 42]               0
          Conv2d-117          [-1, 128, 63, 42]          65,536
          Conv2d-118          [-1, 128, 63, 42]          65,536
     BatchNorm2d-119          [-1, 128, 63, 42]             256
     BatchNorm2d-120          [-1, 128, 63, 42]             256
            ReLU-121          [-1, 128, 63, 42]               0
            ReLU-122          [-1, 128, 63, 42]               0
          Conv2d-123          [-1, 128, 63, 42]         147,456
          Conv2d-124          [-1, 128, 63, 42]         147,456
     BatchNorm2d-125          [-1, 128, 63, 42]             256
     BatchNorm2d-126          [-1, 128, 63, 42]             256
            ReLU-127          [-1, 128, 63, 42]               0
            ReLU-128          [-1, 128, 63, 42]               0
          Conv2d-129          [-1, 512, 63, 42]          65,536
          Conv2d-130          [-1, 512, 63, 42]          65,536
     BatchNorm2d-131          [-1, 512, 63, 42]           1,024
     BatchNorm2d-132          [-1, 512, 63, 42]           1,024
            ReLU-133          [-1, 512, 63, 42]               0
      Bottleneck-134          [-1, 512, 63, 42]               0
            ReLU-135          [-1, 512, 63, 42]               0
      Bottleneck-136          [-1, 512, 63, 42]               0
          Conv2d-137          [-1, 256, 63, 42]         131,072
          Conv2d-138          [-1, 128, 63, 42]          65,536
     BatchNorm2d-139          [-1, 256, 63, 42]             512
     BatchNorm2d-140          [-1, 128, 63, 42]             256
            ReLU-141          [-1, 256, 63, 42]               0
            ReLU-142          [-1, 128, 63, 42]               0
          Conv2d-143          [-1, 256, 32, 21]         589,824
          Conv2d-144          [-1, 128, 63, 42]         147,456
     BatchNorm2d-145          [-1, 256, 32, 21]             512
     BatchNorm2d-146          [-1, 128, 63, 42]             256
            ReLU-147          [-1, 256, 32, 21]               0
            ReLU-148          [-1, 128, 63, 42]               0
          Conv2d-149         [-1, 1024, 32, 21]         262,144
          Conv2d-150          [-1, 512, 63, 42]          65,536
     BatchNorm2d-151         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-152          [-1, 512, 63, 42]           1,024
          Conv2d-153         [-1, 1024, 32, 21]         524,288
            ReLU-154          [-1, 512, 63, 42]               0
      Bottleneck-155          [-1, 512, 63, 42]               0
     BatchNorm2d-156         [-1, 1024, 32, 21]           2,048
          Conv2d-157          [-1, 128, 63, 42]          65,536
            ReLU-158         [-1, 1024, 32, 21]               0
      Bottleneck-159         [-1, 1024, 32, 21]               0
          Conv2d-160          [-1, 256, 32, 21]         262,144
     BatchNorm2d-161          [-1, 128, 63, 42]             256
     BatchNorm2d-162          [-1, 256, 32, 21]             512
            ReLU-163          [-1, 128, 63, 42]               0
          Conv2d-164          [-1, 128, 63, 42]         147,456
            ReLU-165          [-1, 256, 32, 21]               0
          Conv2d-166          [-1, 256, 32, 21]         589,824
     BatchNorm2d-167          [-1, 128, 63, 42]             256
     BatchNorm2d-168          [-1, 256, 32, 21]             512
            ReLU-169          [-1, 128, 63, 42]               0
          Conv2d-170          [-1, 512, 63, 42]          65,536
            ReLU-171          [-1, 256, 32, 21]               0
          Conv2d-172         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-173          [-1, 512, 63, 42]           1,024
     BatchNorm2d-174         [-1, 1024, 32, 21]           2,048
            ReLU-175          [-1, 512, 63, 42]               0
      Bottleneck-176          [-1, 512, 63, 42]               0
            ReLU-177         [-1, 1024, 32, 21]               0
      Bottleneck-178         [-1, 1024, 32, 21]               0
          Conv2d-179          [-1, 256, 63, 42]         131,072
          Conv2d-180          [-1, 256, 32, 21]         262,144
     BatchNorm2d-181          [-1, 256, 63, 42]             512
     BatchNorm2d-182          [-1, 256, 32, 21]             512
            ReLU-183          [-1, 256, 63, 42]               0
            ReLU-184          [-1, 256, 32, 21]               0
          Conv2d-185          [-1, 256, 32, 21]         589,824
          Conv2d-186          [-1, 256, 32, 21]         589,824
     BatchNorm2d-187          [-1, 256, 32, 21]             512
     BatchNorm2d-188          [-1, 256, 32, 21]             512
            ReLU-189          [-1, 256, 32, 21]               0
            ReLU-190          [-1, 256, 32, 21]               0
          Conv2d-191         [-1, 1024, 32, 21]         262,144
          Conv2d-192         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-193         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-194         [-1, 1024, 32, 21]           2,048
            ReLU-195         [-1, 1024, 32, 21]               0
      Bottleneck-196         [-1, 1024, 32, 21]               0
          Conv2d-197         [-1, 1024, 32, 21]         524,288
          Conv2d-198          [-1, 256, 32, 21]         262,144
     BatchNorm2d-199         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-200          [-1, 256, 32, 21]             512
            ReLU-201         [-1, 1024, 32, 21]               0
      Bottleneck-202         [-1, 1024, 32, 21]               0
            ReLU-203          [-1, 256, 32, 21]               0
          Conv2d-204          [-1, 256, 32, 21]         262,144
          Conv2d-205          [-1, 256, 32, 21]         589,824
     BatchNorm2d-206          [-1, 256, 32, 21]             512
            ReLU-207          [-1, 256, 32, 21]               0
          Conv2d-208         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-209         [-1, 1024, 32, 21]           2,048
            ReLU-210         [-1, 1024, 32, 21]               0
      Bottleneck-211         [-1, 1024, 32, 21]               0
          Conv2d-212          [-1, 256, 32, 21]         262,144
     BatchNorm2d-213          [-1, 256, 32, 21]             512
     BatchNorm2d-214          [-1, 256, 32, 21]             512
            ReLU-215          [-1, 256, 32, 21]               0
          Conv2d-216          [-1, 256, 32, 21]         589,824
            ReLU-217          [-1, 256, 32, 21]               0
     BatchNorm2d-218          [-1, 256, 32, 21]             512
          Conv2d-219          [-1, 256, 32, 21]         589,824
            ReLU-220          [-1, 256, 32, 21]               0
          Conv2d-221         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-222          [-1, 256, 32, 21]             512
     BatchNorm2d-223         [-1, 1024, 32, 21]           2,048
            ReLU-224          [-1, 256, 32, 21]               0
            ReLU-225         [-1, 1024, 32, 21]               0
      Bottleneck-226         [-1, 1024, 32, 21]               0
          Conv2d-227          [-1, 256, 32, 21]         262,144
          Conv2d-228         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-229          [-1, 256, 32, 21]             512
            ReLU-230          [-1, 256, 32, 21]               0
     BatchNorm2d-231         [-1, 1024, 32, 21]           2,048
          Conv2d-232          [-1, 256, 32, 21]         589,824
            ReLU-233         [-1, 1024, 32, 21]               0
      Bottleneck-234         [-1, 1024, 32, 21]               0
     BatchNorm2d-235          [-1, 256, 32, 21]             512
            ReLU-236          [-1, 256, 32, 21]               0
          Conv2d-237          [-1, 256, 32, 21]         262,144
          Conv2d-238         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-239         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-240          [-1, 256, 32, 21]             512
            ReLU-241         [-1, 1024, 32, 21]               0
      Bottleneck-242         [-1, 1024, 32, 21]               0
          Conv2d-243          [-1, 256, 32, 21]         262,144
            ReLU-244          [-1, 256, 32, 21]               0
          Conv2d-245          [-1, 256, 32, 21]         589,824
     BatchNorm2d-246          [-1, 256, 32, 21]             512
            ReLU-247          [-1, 256, 32, 21]               0
     BatchNorm2d-248          [-1, 256, 32, 21]             512
          Conv2d-249          [-1, 256, 32, 21]         589,824
            ReLU-250          [-1, 256, 32, 21]               0
     BatchNorm2d-251          [-1, 256, 32, 21]             512
            ReLU-252          [-1, 256, 32, 21]               0
          Conv2d-253         [-1, 1024, 32, 21]         262,144
          Conv2d-254         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-255         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-256         [-1, 1024, 32, 21]           2,048
            ReLU-257         [-1, 1024, 32, 21]               0
      Bottleneck-258         [-1, 1024, 32, 21]               0
            ReLU-259         [-1, 1024, 32, 21]               0
      Bottleneck-260         [-1, 1024, 32, 21]               0
          Conv2d-261          [-1, 256, 32, 21]         262,144
          Conv2d-262          [-1, 256, 32, 21]         262,144
     BatchNorm2d-263          [-1, 256, 32, 21]             512
            ReLU-264          [-1, 256, 32, 21]               0
     BatchNorm2d-265          [-1, 256, 32, 21]             512
          Conv2d-266          [-1, 256, 32, 21]         589,824
            ReLU-267          [-1, 256, 32, 21]               0
     BatchNorm2d-268          [-1, 256, 32, 21]             512
            ReLU-269          [-1, 256, 32, 21]               0
          Conv2d-270          [-1, 256, 32, 21]         589,824
          Conv2d-271         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-272         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-273          [-1, 256, 32, 21]             512
            ReLU-274         [-1, 1024, 32, 21]               0
      Bottleneck-275         [-1, 1024, 32, 21]               0
            ReLU-276          [-1, 256, 32, 21]               0
          Conv2d-277          [-1, 256, 32, 21]         262,144
          Conv2d-278         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-279          [-1, 256, 32, 21]             512
            ReLU-280          [-1, 256, 32, 21]               0
     BatchNorm2d-281         [-1, 1024, 32, 21]           2,048
          Conv2d-282          [-1, 256, 32, 21]         589,824
     BatchNorm2d-283          [-1, 256, 32, 21]             512
            ReLU-284         [-1, 1024, 32, 21]               0
      Bottleneck-285         [-1, 1024, 32, 21]               0
            ReLU-286          [-1, 256, 32, 21]               0
          Conv2d-287          [-1, 256, 32, 21]         262,144
          Conv2d-288         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-289         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-290          [-1, 256, 32, 21]             512
            ReLU-291         [-1, 1024, 32, 21]               0
      Bottleneck-292         [-1, 1024, 32, 21]               0
            ReLU-293          [-1, 256, 32, 21]               0
          Conv2d-294          [-1, 256, 32, 21]         262,144
          Conv2d-295          [-1, 256, 32, 21]         589,824
     BatchNorm2d-296          [-1, 256, 32, 21]             512
            ReLU-297          [-1, 256, 32, 21]               0
     BatchNorm2d-298          [-1, 256, 32, 21]             512
          Conv2d-299          [-1, 256, 32, 21]         589,824
     BatchNorm2d-300          [-1, 256, 32, 21]             512
            ReLU-301          [-1, 256, 32, 21]               0
            ReLU-302          [-1, 256, 32, 21]               0
          Conv2d-303         [-1, 1024, 32, 21]         262,144
          Conv2d-304         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-305         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-306         [-1, 1024, 32, 21]           2,048
            ReLU-307         [-1, 1024, 32, 21]               0
      Bottleneck-308         [-1, 1024, 32, 21]               0
          Conv2d-309          [-1, 256, 32, 21]         262,144
            ReLU-310         [-1, 1024, 32, 21]               0
      Bottleneck-311         [-1, 1024, 32, 21]               0
          Conv2d-312          [-1, 256, 32, 21]         262,144
     BatchNorm2d-313          [-1, 256, 32, 21]             512
            ReLU-314          [-1, 256, 32, 21]               0
          Conv2d-315          [-1, 256, 32, 21]         589,824
     BatchNorm2d-316          [-1, 256, 32, 21]             512
     BatchNorm2d-317          [-1, 256, 32, 21]             512
            ReLU-318          [-1, 256, 32, 21]               0
          Conv2d-319         [-1, 1024, 32, 21]         262,144
            ReLU-320          [-1, 256, 32, 21]               0
     BatchNorm2d-321         [-1, 1024, 32, 21]           2,048
          Conv2d-322          [-1, 256, 32, 21]         589,824
            ReLU-323         [-1, 1024, 32, 21]               0
      Bottleneck-324         [-1, 1024, 32, 21]               0
          Conv2d-325          [-1, 256, 32, 21]         262,144
     BatchNorm2d-326          [-1, 256, 32, 21]             512
     BatchNorm2d-327          [-1, 256, 32, 21]             512
            ReLU-328          [-1, 256, 32, 21]               0
            ReLU-329          [-1, 256, 32, 21]               0
          Conv2d-330          [-1, 256, 32, 21]         589,824
          Conv2d-331         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-332          [-1, 256, 32, 21]             512
            ReLU-333          [-1, 256, 32, 21]               0
     BatchNorm2d-334         [-1, 1024, 32, 21]           2,048
          Conv2d-335         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-336         [-1, 1024, 32, 21]           2,048
            ReLU-337         [-1, 1024, 32, 21]               0
      Bottleneck-338         [-1, 1024, 32, 21]               0
            ReLU-339         [-1, 1024, 32, 21]               0
      Bottleneck-340         [-1, 1024, 32, 21]               0
          Conv2d-341          [-1, 256, 32, 21]         262,144
          Conv2d-342          [-1, 256, 32, 21]         262,144
     BatchNorm2d-343          [-1, 256, 32, 21]             512
     BatchNorm2d-344          [-1, 256, 32, 21]             512
            ReLU-345          [-1, 256, 32, 21]               0
            ReLU-346          [-1, 256, 32, 21]               0
          Conv2d-347          [-1, 256, 32, 21]         589,824
          Conv2d-348          [-1, 256, 32, 21]         589,824
     BatchNorm2d-349          [-1, 256, 32, 21]             512
            ReLU-350          [-1, 256, 32, 21]               0
     BatchNorm2d-351          [-1, 256, 32, 21]             512
          Conv2d-352         [-1, 1024, 32, 21]         262,144
            ReLU-353          [-1, 256, 32, 21]               0
     BatchNorm2d-354         [-1, 1024, 32, 21]           2,048
          Conv2d-355         [-1, 1024, 32, 21]         262,144
            ReLU-356         [-1, 1024, 32, 21]               0
      Bottleneck-357         [-1, 1024, 32, 21]               0
          Conv2d-358          [-1, 256, 32, 21]         262,144
     BatchNorm2d-359         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-360          [-1, 256, 32, 21]             512
            ReLU-361          [-1, 256, 32, 21]               0
            ReLU-362         [-1, 1024, 32, 21]               0
      Bottleneck-363         [-1, 1024, 32, 21]               0
          Conv2d-364          [-1, 256, 32, 21]         589,824
          Conv2d-365          [-1, 256, 32, 21]         262,144
     BatchNorm2d-366          [-1, 256, 32, 21]             512
            ReLU-367          [-1, 256, 32, 21]               0
     BatchNorm2d-368          [-1, 256, 32, 21]             512
          Conv2d-369         [-1, 1024, 32, 21]         262,144
            ReLU-370          [-1, 256, 32, 21]               0
     BatchNorm2d-371         [-1, 1024, 32, 21]           2,048
          Conv2d-372          [-1, 256, 32, 21]         589,824
            ReLU-373         [-1, 1024, 32, 21]               0
      Bottleneck-374         [-1, 1024, 32, 21]               0
          Conv2d-375          [-1, 256, 32, 21]         262,144
     BatchNorm2d-376          [-1, 256, 32, 21]             512
     BatchNorm2d-377          [-1, 256, 32, 21]             512
            ReLU-378          [-1, 256, 32, 21]               0
            ReLU-379          [-1, 256, 32, 21]               0
          Conv2d-380          [-1, 256, 32, 21]         589,824
          Conv2d-381         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-382          [-1, 256, 32, 21]             512
            ReLU-383          [-1, 256, 32, 21]               0
     BatchNorm2d-384         [-1, 1024, 32, 21]           2,048
          Conv2d-385         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-386         [-1, 1024, 32, 21]           2,048
            ReLU-387         [-1, 1024, 32, 21]               0
      Bottleneck-388         [-1, 1024, 32, 21]               0
            ReLU-389         [-1, 1024, 32, 21]               0
      Bottleneck-390         [-1, 1024, 32, 21]               0
          Conv2d-391          [-1, 256, 32, 21]         262,144
          Conv2d-392          [-1, 256, 32, 21]         262,144
     BatchNorm2d-393          [-1, 256, 32, 21]             512
     BatchNorm2d-394          [-1, 256, 32, 21]             512
            ReLU-395          [-1, 256, 32, 21]               0
            ReLU-396          [-1, 256, 32, 21]               0
          Conv2d-397          [-1, 256, 32, 21]         589,824
          Conv2d-398          [-1, 256, 32, 21]         589,824
     BatchNorm2d-399          [-1, 256, 32, 21]             512
            ReLU-400          [-1, 256, 32, 21]               0
     BatchNorm2d-401          [-1, 256, 32, 21]             512
          Conv2d-402         [-1, 1024, 32, 21]         262,144
            ReLU-403          [-1, 256, 32, 21]               0
     BatchNorm2d-404         [-1, 1024, 32, 21]           2,048
          Conv2d-405         [-1, 1024, 32, 21]         262,144
            ReLU-406         [-1, 1024, 32, 21]               0
      Bottleneck-407         [-1, 1024, 32, 21]               0
          Conv2d-408          [-1, 256, 32, 21]         262,144
     BatchNorm2d-409         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-410          [-1, 256, 32, 21]             512
            ReLU-411          [-1, 256, 32, 21]               0
            ReLU-412         [-1, 1024, 32, 21]               0
      Bottleneck-413         [-1, 1024, 32, 21]               0
          Conv2d-414          [-1, 256, 32, 21]         589,824
          Conv2d-415          [-1, 256, 32, 21]         262,144
     BatchNorm2d-416          [-1, 256, 32, 21]             512
            ReLU-417          [-1, 256, 32, 21]               0
     BatchNorm2d-418          [-1, 256, 32, 21]             512
          Conv2d-419         [-1, 1024, 32, 21]         262,144
            ReLU-420          [-1, 256, 32, 21]               0
     BatchNorm2d-421         [-1, 1024, 32, 21]           2,048
          Conv2d-422          [-1, 256, 32, 21]         589,824
            ReLU-423         [-1, 1024, 32, 21]               0
      Bottleneck-424         [-1, 1024, 32, 21]               0
     BatchNorm2d-425          [-1, 256, 32, 21]             512
          Conv2d-426          [-1, 256, 32, 21]         262,144
            ReLU-427          [-1, 256, 32, 21]               0
          Conv2d-428         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-429          [-1, 256, 32, 21]             512
     BatchNorm2d-430         [-1, 1024, 32, 21]           2,048
            ReLU-431          [-1, 256, 32, 21]               0
          Conv2d-432          [-1, 256, 32, 21]         589,824
            ReLU-433         [-1, 1024, 32, 21]               0
      Bottleneck-434         [-1, 1024, 32, 21]               0
          Conv2d-435          [-1, 256, 32, 21]         262,144
     BatchNorm2d-436          [-1, 256, 32, 21]             512
     BatchNorm2d-437          [-1, 256, 32, 21]             512
            ReLU-438          [-1, 256, 32, 21]               0
            ReLU-439          [-1, 256, 32, 21]               0
          Conv2d-440         [-1, 1024, 32, 21]         262,144
          Conv2d-441          [-1, 256, 32, 21]         589,824
     BatchNorm2d-442         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-443          [-1, 256, 32, 21]             512
            ReLU-444          [-1, 256, 32, 21]               0
            ReLU-445         [-1, 1024, 32, 21]               0
      Bottleneck-446         [-1, 1024, 32, 21]               0
          Conv2d-447         [-1, 1024, 32, 21]         262,144
          Conv2d-448          [-1, 256, 32, 21]         262,144
     BatchNorm2d-449         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-450          [-1, 256, 32, 21]             512
            ReLU-451         [-1, 1024, 32, 21]               0
      Bottleneck-452         [-1, 1024, 32, 21]               0
          Conv2d-453          [-1, 256, 32, 21]         262,144
            ReLU-454          [-1, 256, 32, 21]               0
          Conv2d-455          [-1, 256, 32, 21]         589,824
     BatchNorm2d-456          [-1, 256, 32, 21]             512
            ReLU-457          [-1, 256, 32, 21]               0
     BatchNorm2d-458          [-1, 256, 32, 21]             512
          Conv2d-459          [-1, 256, 32, 21]         589,824
            ReLU-460          [-1, 256, 32, 21]               0
          Conv2d-461         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-462          [-1, 256, 32, 21]             512
            ReLU-463          [-1, 256, 32, 21]               0
     BatchNorm2d-464         [-1, 1024, 32, 21]           2,048
          Conv2d-465         [-1, 1024, 32, 21]         262,144
            ReLU-466         [-1, 1024, 32, 21]               0
      Bottleneck-467         [-1, 1024, 32, 21]               0
     BatchNorm2d-468         [-1, 1024, 32, 21]           2,048
          Conv2d-469          [-1, 256, 32, 21]         262,144
            ReLU-470         [-1, 1024, 32, 21]               0
      Bottleneck-471         [-1, 1024, 32, 21]               0
          Conv2d-472          [-1, 256, 32, 21]         262,144
     BatchNorm2d-473          [-1, 256, 32, 21]             512
     BatchNorm2d-474          [-1, 256, 32, 21]             512
            ReLU-475          [-1, 256, 32, 21]               0
            ReLU-476          [-1, 256, 32, 21]               0
          Conv2d-477          [-1, 256, 32, 21]         589,824
          Conv2d-478          [-1, 256, 32, 21]         589,824
     BatchNorm2d-479          [-1, 256, 32, 21]             512
     BatchNorm2d-480          [-1, 256, 32, 21]             512
            ReLU-481          [-1, 256, 32, 21]               0
            ReLU-482          [-1, 256, 32, 21]               0
          Conv2d-483         [-1, 1024, 32, 21]         262,144
          Conv2d-484         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-485         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-486         [-1, 1024, 32, 21]           2,048
            ReLU-487         [-1, 1024, 32, 21]               0
      Bottleneck-488         [-1, 1024, 32, 21]               0
            ReLU-489         [-1, 1024, 32, 21]               0
      Bottleneck-490         [-1, 1024, 32, 21]               0
          Conv2d-491          [-1, 256, 32, 21]         262,144
          Conv2d-492          [-1, 256, 32, 21]         262,144
     BatchNorm2d-493          [-1, 256, 32, 21]             512
     BatchNorm2d-494          [-1, 256, 32, 21]             512
            ReLU-495          [-1, 256, 32, 21]               0
            ReLU-496          [-1, 256, 32, 21]               0
          Conv2d-497          [-1, 256, 32, 21]         589,824
          Conv2d-498          [-1, 256, 32, 21]         589,824
     BatchNorm2d-499          [-1, 256, 32, 21]             512
     BatchNorm2d-500          [-1, 256, 32, 21]             512
            ReLU-501          [-1, 256, 32, 21]               0
            ReLU-502          [-1, 256, 32, 21]               0
          Conv2d-503         [-1, 1024, 32, 21]         262,144
          Conv2d-504         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-505         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-506         [-1, 1024, 32, 21]           2,048
            ReLU-507         [-1, 1024, 32, 21]               0
      Bottleneck-508         [-1, 1024, 32, 21]               0
            ReLU-509         [-1, 1024, 32, 21]               0
      Bottleneck-510         [-1, 1024, 32, 21]               0
          Conv2d-511          [-1, 256, 32, 21]         262,144
          Conv2d-512          [-1, 256, 32, 21]         262,144
     BatchNorm2d-513          [-1, 256, 32, 21]             512
     BatchNorm2d-514          [-1, 256, 32, 21]             512
            ReLU-515          [-1, 256, 32, 21]               0
            ReLU-516          [-1, 256, 32, 21]               0
          Conv2d-517          [-1, 256, 32, 21]         589,824
          Conv2d-518          [-1, 256, 32, 21]         589,824
     BatchNorm2d-519          [-1, 256, 32, 21]             512
     BatchNorm2d-520          [-1, 256, 32, 21]             512
            ReLU-521          [-1, 256, 32, 21]               0
            ReLU-522          [-1, 256, 32, 21]               0
          Conv2d-523         [-1, 1024, 32, 21]         262,144
          Conv2d-524         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-525         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-526         [-1, 1024, 32, 21]           2,048
            ReLU-527         [-1, 1024, 32, 21]               0
      Bottleneck-528         [-1, 1024, 32, 21]               0
            ReLU-529         [-1, 1024, 32, 21]               0
      Bottleneck-530         [-1, 1024, 32, 21]               0
          Conv2d-531          [-1, 256, 32, 21]         262,144
          Conv2d-532          [-1, 256, 32, 21]         262,144
     BatchNorm2d-533          [-1, 256, 32, 21]             512
     BatchNorm2d-534          [-1, 256, 32, 21]             512
            ReLU-535          [-1, 256, 32, 21]               0
            ReLU-536          [-1, 256, 32, 21]               0
          Conv2d-537          [-1, 256, 32, 21]         589,824
          Conv2d-538          [-1, 256, 32, 21]         589,824
     BatchNorm2d-539          [-1, 256, 32, 21]             512
     BatchNorm2d-540          [-1, 256, 32, 21]             512
            ReLU-541          [-1, 256, 32, 21]               0
            ReLU-542          [-1, 256, 32, 21]               0
          Conv2d-543         [-1, 1024, 32, 21]         262,144
          Conv2d-544         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-545         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-546         [-1, 1024, 32, 21]           2,048
            ReLU-547         [-1, 1024, 32, 21]               0
      Bottleneck-548         [-1, 1024, 32, 21]               0
            ReLU-549         [-1, 1024, 32, 21]               0
      Bottleneck-550         [-1, 1024, 32, 21]               0
          Conv2d-551          [-1, 512, 32, 21]         524,288
          Conv2d-552          [-1, 256, 32, 21]         262,144
     BatchNorm2d-553          [-1, 512, 32, 21]           1,024
     BatchNorm2d-554          [-1, 256, 32, 21]             512
            ReLU-555          [-1, 512, 32, 21]               0
            ReLU-556          [-1, 256, 32, 21]               0
          Conv2d-557          [-1, 512, 16, 11]       2,359,296
          Conv2d-558          [-1, 256, 32, 21]         589,824
     BatchNorm2d-559          [-1, 512, 16, 11]           1,024
     BatchNorm2d-560          [-1, 256, 32, 21]             512
            ReLU-561          [-1, 512, 16, 11]               0
            ReLU-562          [-1, 256, 32, 21]               0
          Conv2d-563         [-1, 2048, 16, 11]       1,048,576
          Conv2d-564         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-565         [-1, 2048, 16, 11]           4,096
     BatchNorm2d-566         [-1, 1024, 32, 21]           2,048
            ReLU-567         [-1, 1024, 32, 21]               0
      Bottleneck-568         [-1, 1024, 32, 21]               0
          Conv2d-569         [-1, 2048, 16, 11]       2,097,152
          Conv2d-570          [-1, 256, 32, 21]         262,144
     BatchNorm2d-571         [-1, 2048, 16, 11]           4,096
     BatchNorm2d-572          [-1, 256, 32, 21]             512
            ReLU-573          [-1, 256, 32, 21]               0
            ReLU-574         [-1, 2048, 16, 11]               0
      Bottleneck-575         [-1, 2048, 16, 11]               0
          Conv2d-576          [-1, 256, 32, 21]         589,824
          Conv2d-577          [-1, 512, 16, 11]       1,048,576
     BatchNorm2d-578          [-1, 256, 32, 21]             512
     BatchNorm2d-579          [-1, 512, 16, 11]           1,024
            ReLU-580          [-1, 256, 32, 21]               0
          Conv2d-581         [-1, 1024, 32, 21]         262,144
            ReLU-582          [-1, 512, 16, 11]               0
     BatchNorm2d-583         [-1, 1024, 32, 21]           2,048
            ReLU-584         [-1, 1024, 32, 21]               0
      Bottleneck-585         [-1, 1024, 32, 21]               0
          Conv2d-586          [-1, 256, 32, 21]         262,144
          Conv2d-587          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-588          [-1, 256, 32, 21]             512
     BatchNorm2d-589          [-1, 512, 16, 11]           1,024
            ReLU-590          [-1, 256, 32, 21]               0
          Conv2d-591          [-1, 256, 32, 21]         589,824
            ReLU-592          [-1, 512, 16, 11]               0
          Conv2d-593         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-594          [-1, 256, 32, 21]             512
            ReLU-595          [-1, 256, 32, 21]               0
     BatchNorm2d-596         [-1, 2048, 16, 11]           4,096
          Conv2d-597         [-1, 1024, 32, 21]         262,144
            ReLU-598         [-1, 2048, 16, 11]               0
      Bottleneck-599         [-1, 2048, 16, 11]               0
     BatchNorm2d-600         [-1, 1024, 32, 21]           2,048
          Conv2d-601          [-1, 512, 16, 11]       1,048,576
            ReLU-602         [-1, 1024, 32, 21]               0
      Bottleneck-603         [-1, 1024, 32, 21]               0
     BatchNorm2d-604          [-1, 512, 16, 11]           1,024
          Conv2d-605          [-1, 256, 32, 21]         262,144
            ReLU-606          [-1, 512, 16, 11]               0
          Conv2d-607          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-608          [-1, 256, 32, 21]             512
     BatchNorm2d-609          [-1, 512, 16, 11]           1,024
            ReLU-610          [-1, 256, 32, 21]               0
          Conv2d-611          [-1, 256, 32, 21]         589,824
            ReLU-612          [-1, 512, 16, 11]               0
          Conv2d-613         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-614          [-1, 256, 32, 21]             512
            ReLU-615          [-1, 256, 32, 21]               0
     BatchNorm2d-616         [-1, 2048, 16, 11]           4,096
          Conv2d-617         [-1, 1024, 32, 21]         262,144
            ReLU-618         [-1, 2048, 16, 11]               0
      Bottleneck-619         [-1, 2048, 16, 11]               0
     BatchNorm2d-620         [-1, 1024, 32, 21]           2,048
AdaptiveAvgPool2d-621           [-1, 2048, 1, 1]               0
            ReLU-622         [-1, 1024, 32, 21]               0
      Bottleneck-623         [-1, 1024, 32, 21]               0
          Conv2d-624          [-1, 256, 32, 21]         262,144
     BatchNorm2d-625          [-1, 256, 32, 21]             512
            ReLU-626          [-1, 256, 32, 21]               0
          Conv2d-627          [-1, 256, 32, 21]         589,824
     BatchNorm2d-628          [-1, 256, 32, 21]             512
            ReLU-629          [-1, 256, 32, 21]               0
          Conv2d-630         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-631         [-1, 1024, 32, 21]           2,048
          Linear-632                 [-1, 1000]       2,049,000
            ReLU-633         [-1, 1024, 32, 21]               0
      Bottleneck-634         [-1, 1024, 32, 21]               0
          ResNet-635                 [-1, 1000]               0
          Conv2d-636          [-1, 256, 32, 21]         262,144
     BatchNorm2d-637          [-1, 256, 32, 21]             512
            ReLU-638          [-1, 256, 32, 21]               0
          Conv2d-639          [-1, 256, 32, 21]         589,824
     BatchNorm2d-640          [-1, 256, 32, 21]             512
            ReLU-641          [-1, 256, 32, 21]               0
          Conv2d-642         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-643         [-1, 1024, 32, 21]           2,048
            ReLU-644         [-1, 1024, 32, 21]               0
      Bottleneck-645         [-1, 1024, 32, 21]               0
          Conv2d-646          [-1, 256, 32, 21]         262,144
     BatchNorm2d-647          [-1, 256, 32, 21]             512
            ReLU-648          [-1, 256, 32, 21]               0
          Conv2d-649          [-1, 256, 32, 21]         589,824
     BatchNorm2d-650          [-1, 256, 32, 21]             512
            ReLU-651          [-1, 256, 32, 21]               0
          Conv2d-652         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-653         [-1, 1024, 32, 21]           2,048
            ReLU-654         [-1, 1024, 32, 21]               0
      Bottleneck-655         [-1, 1024, 32, 21]               0
          Conv2d-656          [-1, 512, 32, 21]         524,288
     BatchNorm2d-657          [-1, 512, 32, 21]           1,024
            ReLU-658          [-1, 512, 32, 21]               0
          Conv2d-659          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-660          [-1, 512, 16, 11]           1,024
            ReLU-661          [-1, 512, 16, 11]               0
          Conv2d-662         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-663         [-1, 2048, 16, 11]           4,096
          Conv2d-664         [-1, 2048, 16, 11]       2,097,152
     BatchNorm2d-665         [-1, 2048, 16, 11]           4,096
            ReLU-666         [-1, 2048, 16, 11]               0
      Bottleneck-667         [-1, 2048, 16, 11]               0
          Conv2d-668          [-1, 512, 16, 11]       1,048,576
     BatchNorm2d-669          [-1, 512, 16, 11]           1,024
            ReLU-670          [-1, 512, 16, 11]               0
          Conv2d-671          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-672          [-1, 512, 16, 11]           1,024
            ReLU-673          [-1, 512, 16, 11]               0
          Conv2d-674         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-675         [-1, 2048, 16, 11]           4,096
            ReLU-676         [-1, 2048, 16, 11]               0
      Bottleneck-677         [-1, 2048, 16, 11]               0
          Conv2d-678          [-1, 512, 16, 11]       1,048,576
     BatchNorm2d-679          [-1, 512, 16, 11]           1,024
            ReLU-680          [-1, 512, 16, 11]               0
          Conv2d-681          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-682          [-1, 512, 16, 11]           1,024
            ReLU-683          [-1, 512, 16, 11]               0
          Conv2d-684         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-685         [-1, 2048, 16, 11]           4,096
            ReLU-686         [-1, 2048, 16, 11]               0
      Bottleneck-687         [-1, 2048, 16, 11]               0
AdaptiveAvgPool2d-688           [-1, 2048, 1, 1]               0
          Linear-689                 [-1, 1000]       2,049,000
          ResNet-690                 [-1, 1000]               0
================================================================
Total params: 89,098,320
Trainable params: 44,549,160
Non-trainable params: 44,549,160
----------------------------------------------------------------
Input size (MB): 1.91
Forward/backward pass size (MB): 2919.32
Params size (MB): 339.88
Estimated Total Size (MB): 3261.12
----------------------------------------------------------------
None
