----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 64, 512, 1024]           9,408
       BatchNorm2d-2        [-1, 64, 512, 1024]             128
              ReLU-3        [-1, 64, 512, 1024]               0
         MaxPool2d-4         [-1, 64, 256, 512]               0
            Conv2d-5        [-1, 64, 512, 1024]           9,408
            Conv2d-6         [-1, 64, 256, 512]          36,864
       BatchNorm2d-7         [-1, 64, 256, 512]             128
              ReLU-8         [-1, 64, 256, 512]               0
            Conv2d-9         [-1, 64, 256, 512]          36,864
      BatchNorm2d-10        [-1, 64, 512, 1024]             128
      BatchNorm2d-11         [-1, 64, 256, 512]             128
             ReLU-12        [-1, 64, 512, 1024]               0
        MaxPool2d-13         [-1, 64, 256, 512]               0
             ReLU-14         [-1, 64, 256, 512]               0
       BasicBlock-15         [-1, 64, 256, 512]               0
           Conv2d-16         [-1, 64, 256, 512]          36,864
           Conv2d-17         [-1, 64, 256, 512]          36,864
      BatchNorm2d-18         [-1, 64, 256, 512]             128
      BatchNorm2d-19         [-1, 64, 256, 512]             128
             ReLU-20         [-1, 64, 256, 512]               0
             ReLU-21         [-1, 64, 256, 512]               0
           Conv2d-22         [-1, 64, 256, 512]          36,864
           Conv2d-23         [-1, 64, 256, 512]          36,864
      BatchNorm2d-24         [-1, 64, 256, 512]             128
      BatchNorm2d-25         [-1, 64, 256, 512]             128
             ReLU-26         [-1, 64, 256, 512]               0
       BasicBlock-27         [-1, 64, 256, 512]               0
             ReLU-28         [-1, 64, 256, 512]               0
       BasicBlock-29         [-1, 64, 256, 512]               0
           Conv2d-30         [-1, 64, 256, 512]          36,864
           Conv2d-31         [-1, 64, 256, 512]          36,864
      BatchNorm2d-32         [-1, 64, 256, 512]             128
      BatchNorm2d-33         [-1, 64, 256, 512]             128
             ReLU-34         [-1, 64, 256, 512]               0
           Conv2d-35         [-1, 64, 256, 512]          36,864
             ReLU-36         [-1, 64, 256, 512]               0
           Conv2d-37         [-1, 64, 256, 512]          36,864
      BatchNorm2d-38         [-1, 64, 256, 512]             128
      BatchNorm2d-39         [-1, 64, 256, 512]             128
             ReLU-40         [-1, 64, 256, 512]               0
       BasicBlock-41         [-1, 64, 256, 512]               0
             ReLU-42         [-1, 64, 256, 512]               0
       BasicBlock-43         [-1, 64, 256, 512]               0
           Conv2d-44        [-1, 128, 128, 256]          73,728
           Conv2d-45         [-1, 64, 256, 512]          36,864
      BatchNorm2d-46        [-1, 128, 128, 256]             256
      BatchNorm2d-47         [-1, 64, 256, 512]             128
             ReLU-48        [-1, 128, 128, 256]               0
           Conv2d-49        [-1, 128, 128, 256]         147,456
             ReLU-50         [-1, 64, 256, 512]               0
           Conv2d-51         [-1, 64, 256, 512]          36,864
      BatchNorm2d-52        [-1, 128, 128, 256]             256
      BatchNorm2d-53         [-1, 64, 256, 512]             128
           Conv2d-54        [-1, 128, 128, 256]           8,192
             ReLU-55         [-1, 64, 256, 512]               0
       BasicBlock-56         [-1, 64, 256, 512]               0
      BatchNorm2d-57        [-1, 128, 128, 256]             256
           Conv2d-58        [-1, 128, 128, 256]          73,728
             ReLU-59        [-1, 128, 128, 256]               0
       BasicBlock-60        [-1, 128, 128, 256]               0
      BatchNorm2d-61        [-1, 128, 128, 256]             256
           Conv2d-62        [-1, 128, 128, 256]         147,456
             ReLU-63        [-1, 128, 128, 256]               0
           Conv2d-64        [-1, 128, 128, 256]         147,456
      BatchNorm2d-65        [-1, 128, 128, 256]             256
             ReLU-66        [-1, 128, 128, 256]               0
      BatchNorm2d-67        [-1, 128, 128, 256]             256
           Conv2d-68        [-1, 128, 128, 256]         147,456
           Conv2d-69        [-1, 128, 128, 256]           8,192
      BatchNorm2d-70        [-1, 128, 128, 256]             256
      BatchNorm2d-71        [-1, 128, 128, 256]             256
             ReLU-72        [-1, 128, 128, 256]               0
       BasicBlock-73        [-1, 128, 128, 256]               0
           Conv2d-74        [-1, 128, 128, 256]         147,456
             ReLU-75        [-1, 128, 128, 256]               0
       BasicBlock-76        [-1, 128, 128, 256]               0
           Conv2d-77        [-1, 128, 128, 256]         147,456
      BatchNorm2d-78        [-1, 128, 128, 256]             256
             ReLU-79        [-1, 128, 128, 256]               0
      BatchNorm2d-80        [-1, 128, 128, 256]             256
           Conv2d-81        [-1, 128, 128, 256]         147,456
             ReLU-82        [-1, 128, 128, 256]               0
           Conv2d-83        [-1, 128, 128, 256]         147,456
      BatchNorm2d-84        [-1, 128, 128, 256]             256
      BatchNorm2d-85        [-1, 128, 128, 256]             256
             ReLU-86        [-1, 128, 128, 256]               0
       BasicBlock-87        [-1, 128, 128, 256]               0
           Conv2d-88        [-1, 128, 128, 256]         147,456
             ReLU-89        [-1, 128, 128, 256]               0
       BasicBlock-90        [-1, 128, 128, 256]               0
           Conv2d-91        [-1, 128, 128, 256]         147,456
      BatchNorm2d-92        [-1, 128, 128, 256]             256
             ReLU-93        [-1, 128, 128, 256]               0
      BatchNorm2d-94        [-1, 128, 128, 256]             256
           Conv2d-95        [-1, 128, 128, 256]         147,456
             ReLU-96        [-1, 128, 128, 256]               0
           Conv2d-97        [-1, 128, 128, 256]         147,456
      BatchNorm2d-98        [-1, 128, 128, 256]             256
      BatchNorm2d-99        [-1, 128, 128, 256]             256
            ReLU-100        [-1, 128, 128, 256]               0
      BasicBlock-101        [-1, 128, 128, 256]               0
          Conv2d-102         [-1, 256, 64, 128]         294,912
            ReLU-103        [-1, 128, 128, 256]               0
      BasicBlock-104        [-1, 128, 128, 256]               0
          Conv2d-105        [-1, 128, 128, 256]         147,456
     BatchNorm2d-106         [-1, 256, 64, 128]             512
            ReLU-107         [-1, 256, 64, 128]               0
     BatchNorm2d-108        [-1, 128, 128, 256]             256
          Conv2d-109         [-1, 256, 64, 128]         589,824
            ReLU-110        [-1, 128, 128, 256]               0
          Conv2d-111        [-1, 128, 128, 256]         147,456
     BatchNorm2d-112         [-1, 256, 64, 128]             512
     BatchNorm2d-113        [-1, 128, 128, 256]             256
          Conv2d-114         [-1, 256, 64, 128]          32,768
            ReLU-115        [-1, 128, 128, 256]               0
      BasicBlock-116        [-1, 128, 128, 256]               0
     BatchNorm2d-117         [-1, 256, 64, 128]             512
          Conv2d-118         [-1, 256, 64, 128]         294,912
            ReLU-119         [-1, 256, 64, 128]               0
      BasicBlock-120         [-1, 256, 64, 128]               0
          Conv2d-121         [-1, 256, 64, 128]         589,824
     BatchNorm2d-122         [-1, 256, 64, 128]             512
     BatchNorm2d-123         [-1, 256, 64, 128]             512
            ReLU-124         [-1, 256, 64, 128]               0
          Conv2d-125         [-1, 256, 64, 128]         589,824
            ReLU-126         [-1, 256, 64, 128]               0
          Conv2d-127         [-1, 256, 64, 128]         589,824
     BatchNorm2d-128         [-1, 256, 64, 128]             512
     BatchNorm2d-129         [-1, 256, 64, 128]             512
          Conv2d-130         [-1, 256, 64, 128]          32,768
            ReLU-131         [-1, 256, 64, 128]               0
      BasicBlock-132         [-1, 256, 64, 128]               0
          Conv2d-133         [-1, 256, 64, 128]         589,824
     BatchNorm2d-134         [-1, 256, 64, 128]             512
     BatchNorm2d-135         [-1, 256, 64, 128]             512
            ReLU-136         [-1, 256, 64, 128]               0
      BasicBlock-137         [-1, 256, 64, 128]               0
          Conv2d-138         [-1, 256, 64, 128]         589,824
            ReLU-139         [-1, 256, 64, 128]               0
          Conv2d-140         [-1, 256, 64, 128]         589,824
     BatchNorm2d-141         [-1, 256, 64, 128]             512
     BatchNorm2d-142         [-1, 256, 64, 128]             512
            ReLU-143         [-1, 256, 64, 128]               0
          Conv2d-144         [-1, 256, 64, 128]         589,824
            ReLU-145         [-1, 256, 64, 128]               0
      BasicBlock-146         [-1, 256, 64, 128]               0
          Conv2d-147         [-1, 256, 64, 128]         589,824
     BatchNorm2d-148         [-1, 256, 64, 128]             512
     BatchNorm2d-149         [-1, 256, 64, 128]             512
            ReLU-150         [-1, 256, 64, 128]               0
      BasicBlock-151         [-1, 256, 64, 128]               0
          Conv2d-152         [-1, 256, 64, 128]         589,824
            ReLU-153         [-1, 256, 64, 128]               0
          Conv2d-154         [-1, 256, 64, 128]         589,824
     BatchNorm2d-155         [-1, 256, 64, 128]             512
            ReLU-156         [-1, 256, 64, 128]               0
     BatchNorm2d-157         [-1, 256, 64, 128]             512
          Conv2d-158         [-1, 256, 64, 128]         589,824
            ReLU-159         [-1, 256, 64, 128]               0
      BasicBlock-160         [-1, 256, 64, 128]               0
     BatchNorm2d-161         [-1, 256, 64, 128]             512
          Conv2d-162         [-1, 256, 64, 128]         589,824
            ReLU-163         [-1, 256, 64, 128]               0
      BasicBlock-164         [-1, 256, 64, 128]               0
          Conv2d-165         [-1, 256, 64, 128]         589,824
     BatchNorm2d-166         [-1, 256, 64, 128]             512
            ReLU-167         [-1, 256, 64, 128]               0
     BatchNorm2d-168         [-1, 256, 64, 128]             512
          Conv2d-169         [-1, 256, 64, 128]         589,824
            ReLU-170         [-1, 256, 64, 128]               0
          Conv2d-171         [-1, 256, 64, 128]         589,824
     BatchNorm2d-172         [-1, 256, 64, 128]             512
     BatchNorm2d-173         [-1, 256, 64, 128]             512
            ReLU-174         [-1, 256, 64, 128]               0
      BasicBlock-175         [-1, 256, 64, 128]               0
          Conv2d-176         [-1, 256, 64, 128]         589,824
            ReLU-177         [-1, 256, 64, 128]               0
      BasicBlock-178         [-1, 256, 64, 128]               0
          Conv2d-179         [-1, 256, 64, 128]         589,824
     BatchNorm2d-180         [-1, 256, 64, 128]             512
            ReLU-181         [-1, 256, 64, 128]               0
     BatchNorm2d-182         [-1, 256, 64, 128]             512
          Conv2d-183         [-1, 256, 64, 128]         589,824
            ReLU-184         [-1, 256, 64, 128]               0
          Conv2d-185         [-1, 256, 64, 128]         589,824
     BatchNorm2d-186         [-1, 256, 64, 128]             512
     BatchNorm2d-187         [-1, 256, 64, 128]             512
            ReLU-188         [-1, 256, 64, 128]               0
      BasicBlock-189         [-1, 256, 64, 128]               0
          Conv2d-190          [-1, 512, 32, 64]       1,179,648
            ReLU-191         [-1, 256, 64, 128]               0
      BasicBlock-192         [-1, 256, 64, 128]               0
          Conv2d-193         [-1, 256, 64, 128]         589,824
     BatchNorm2d-194          [-1, 512, 32, 64]           1,024
     BatchNorm2d-195         [-1, 256, 64, 128]             512
            ReLU-196          [-1, 512, 32, 64]               0
            ReLU-197         [-1, 256, 64, 128]               0
          Conv2d-198          [-1, 512, 32, 64]       2,359,296
          Conv2d-199         [-1, 256, 64, 128]         589,824
     BatchNorm2d-200          [-1, 512, 32, 64]           1,024
     BatchNorm2d-201         [-1, 256, 64, 128]             512
            ReLU-202         [-1, 256, 64, 128]               0
      BasicBlock-203         [-1, 256, 64, 128]               0
          Conv2d-204          [-1, 512, 32, 64]         131,072
          Conv2d-205          [-1, 512, 32, 64]       1,179,648
     BatchNorm2d-206          [-1, 512, 32, 64]           1,024
     BatchNorm2d-207          [-1, 512, 32, 64]           1,024
            ReLU-208          [-1, 512, 32, 64]               0
            ReLU-209          [-1, 512, 32, 64]               0
      BasicBlock-210          [-1, 512, 32, 64]               0
          Conv2d-211          [-1, 512, 32, 64]       2,359,296
          Conv2d-212          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-213          [-1, 512, 32, 64]           1,024
     BatchNorm2d-214          [-1, 512, 32, 64]           1,024
          Conv2d-215          [-1, 512, 32, 64]         131,072
            ReLU-216          [-1, 512, 32, 64]               0
          Conv2d-217          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-218          [-1, 512, 32, 64]           1,024
     BatchNorm2d-219          [-1, 512, 32, 64]           1,024
            ReLU-220          [-1, 512, 32, 64]               0
      BasicBlock-221          [-1, 512, 32, 64]               0
          Conv2d-222          [-1, 512, 32, 64]       2,359,296
            ReLU-223          [-1, 512, 32, 64]               0
      BasicBlock-224          [-1, 512, 32, 64]               0
          Conv2d-225          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-226          [-1, 512, 32, 64]           1,024
            ReLU-227          [-1, 512, 32, 64]               0
     BatchNorm2d-228          [-1, 512, 32, 64]           1,024
          Conv2d-229          [-1, 512, 32, 64]       2,359,296
            ReLU-230          [-1, 512, 32, 64]               0
     BatchNorm2d-231          [-1, 512, 32, 64]           1,024
          Conv2d-232          [-1, 512, 32, 64]       2,359,296
            ReLU-233          [-1, 512, 32, 64]               0
      BasicBlock-234          [-1, 512, 32, 64]               0
     BatchNorm2d-235          [-1, 512, 32, 64]           1,024
          Conv2d-236          [-1, 512, 32, 64]       2,359,296
            ReLU-237          [-1, 512, 32, 64]               0
      BasicBlock-238          [-1, 512, 32, 64]               0
     BatchNorm2d-239          [-1, 512, 32, 64]           1,024
AdaptiveAvgPool2d-240            [-1, 512, 1, 1]               0
            ReLU-241          [-1, 512, 32, 64]               0
          Conv2d-242          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-243          [-1, 512, 32, 64]           1,024
            ReLU-244          [-1, 512, 32, 64]               0
      BasicBlock-245          [-1, 512, 32, 64]               0
AdaptiveAvgPool2d-246            [-1, 512, 1, 1]               0
          Linear-247                 [-1, 1000]         513,000
          ResNet-248                 [-1, 1000]               0
          Linear-249                 [-1, 1000]         513,000
          ResNet-250                 [-1, 1000]               0
================================================================
Total params: 43,595,344
Trainable params: 21,797,672
Non-trainable params: 21,797,672
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 8048.04
Params size (MB): 166.30
Estimated Total Size (MB): 8238.34
----------------------------------------------------------------
None
