----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 250, 167]           9,408
       BatchNorm2d-2         [-1, 64, 250, 167]             128
              ReLU-3         [-1, 64, 250, 167]               0
            Conv2d-4         [-1, 64, 250, 167]           9,408
         MaxPool2d-5          [-1, 64, 125, 84]               0
            Conv2d-6          [-1, 64, 125, 84]          36,864
       BatchNorm2d-7          [-1, 64, 125, 84]             128
       BatchNorm2d-8         [-1, 64, 250, 167]             128
              ReLU-9          [-1, 64, 125, 84]               0
             ReLU-10         [-1, 64, 250, 167]               0
           Conv2d-11          [-1, 64, 125, 84]          36,864
        MaxPool2d-12          [-1, 64, 125, 84]               0
           Conv2d-13          [-1, 64, 125, 84]          36,864
      BatchNorm2d-14          [-1, 64, 125, 84]             128
      BatchNorm2d-15          [-1, 64, 125, 84]             128
             ReLU-16          [-1, 64, 125, 84]               0
       BasicBlock-17          [-1, 64, 125, 84]               0
           Conv2d-18          [-1, 64, 125, 84]          36,864
             ReLU-19          [-1, 64, 125, 84]               0
           Conv2d-20          [-1, 64, 125, 84]          36,864
      BatchNorm2d-21          [-1, 64, 125, 84]             128
      BatchNorm2d-22          [-1, 64, 125, 84]             128
             ReLU-23          [-1, 64, 125, 84]               0
           Conv2d-24          [-1, 64, 125, 84]          36,864
             ReLU-25          [-1, 64, 125, 84]               0
       BasicBlock-26          [-1, 64, 125, 84]               0
           Conv2d-27          [-1, 64, 125, 84]          36,864
      BatchNorm2d-28          [-1, 64, 125, 84]             128
      BatchNorm2d-29          [-1, 64, 125, 84]             128
             ReLU-30          [-1, 64, 125, 84]               0
       BasicBlock-31          [-1, 64, 125, 84]               0
           Conv2d-32          [-1, 64, 125, 84]          36,864
             ReLU-33          [-1, 64, 125, 84]               0
           Conv2d-34          [-1, 64, 125, 84]          36,864
      BatchNorm2d-35          [-1, 64, 125, 84]             128
             ReLU-36          [-1, 64, 125, 84]               0
      BatchNorm2d-37          [-1, 64, 125, 84]             128
           Conv2d-38          [-1, 64, 125, 84]          36,864
             ReLU-39          [-1, 64, 125, 84]               0
       BasicBlock-40          [-1, 64, 125, 84]               0
      BatchNorm2d-41          [-1, 64, 125, 84]             128
           Conv2d-42          [-1, 64, 125, 84]          36,864
             ReLU-43          [-1, 64, 125, 84]               0
       BasicBlock-44          [-1, 64, 125, 84]               0
      BatchNorm2d-45          [-1, 64, 125, 84]             128
           Conv2d-46          [-1, 128, 63, 42]          73,728
             ReLU-47          [-1, 64, 125, 84]               0
      BatchNorm2d-48          [-1, 128, 63, 42]             256
           Conv2d-49          [-1, 64, 125, 84]          36,864
             ReLU-50          [-1, 128, 63, 42]               0
           Conv2d-51          [-1, 128, 63, 42]         147,456
      BatchNorm2d-52          [-1, 64, 125, 84]             128
      BatchNorm2d-53          [-1, 128, 63, 42]             256
             ReLU-54          [-1, 64, 125, 84]               0
       BasicBlock-55          [-1, 64, 125, 84]               0
           Conv2d-56          [-1, 128, 63, 42]          73,728
           Conv2d-57          [-1, 128, 63, 42]           8,192
      BatchNorm2d-58          [-1, 128, 63, 42]             256
      BatchNorm2d-59          [-1, 128, 63, 42]             256
             ReLU-60          [-1, 128, 63, 42]               0
             ReLU-61          [-1, 128, 63, 42]               0
       BasicBlock-62          [-1, 128, 63, 42]               0
           Conv2d-63          [-1, 128, 63, 42]         147,456
           Conv2d-64          [-1, 128, 63, 42]         147,456
      BatchNorm2d-65          [-1, 128, 63, 42]             256
      BatchNorm2d-66          [-1, 128, 63, 42]             256
             ReLU-67          [-1, 128, 63, 42]               0
           Conv2d-68          [-1, 128, 63, 42]           8,192
           Conv2d-69          [-1, 128, 63, 42]         147,456
      BatchNorm2d-70          [-1, 128, 63, 42]             256
      BatchNorm2d-71          [-1, 128, 63, 42]             256
             ReLU-72          [-1, 128, 63, 42]               0
       BasicBlock-73          [-1, 128, 63, 42]               0
             ReLU-74          [-1, 128, 63, 42]               0
       BasicBlock-75          [-1, 128, 63, 42]               0
           Conv2d-76          [-1, 128, 63, 42]         147,456
           Conv2d-77          [-1, 128, 63, 42]         147,456
      BatchNorm2d-78          [-1, 128, 63, 42]             256
      BatchNorm2d-79          [-1, 128, 63, 42]             256
             ReLU-80          [-1, 128, 63, 42]               0
             ReLU-81          [-1, 128, 63, 42]               0
           Conv2d-82          [-1, 128, 63, 42]         147,456
           Conv2d-83          [-1, 128, 63, 42]         147,456
      BatchNorm2d-84          [-1, 128, 63, 42]             256
      BatchNorm2d-85          [-1, 128, 63, 42]             256
             ReLU-86          [-1, 128, 63, 42]               0
       BasicBlock-87          [-1, 128, 63, 42]               0
             ReLU-88          [-1, 128, 63, 42]               0
       BasicBlock-89          [-1, 128, 63, 42]               0
           Conv2d-90          [-1, 128, 63, 42]         147,456
           Conv2d-91          [-1, 128, 63, 42]         147,456
      BatchNorm2d-92          [-1, 128, 63, 42]             256
      BatchNorm2d-93          [-1, 128, 63, 42]             256
             ReLU-94          [-1, 128, 63, 42]               0
             ReLU-95          [-1, 128, 63, 42]               0
           Conv2d-96          [-1, 128, 63, 42]         147,456
           Conv2d-97          [-1, 128, 63, 42]         147,456
      BatchNorm2d-98          [-1, 128, 63, 42]             256
      BatchNorm2d-99          [-1, 128, 63, 42]             256
            ReLU-100          [-1, 128, 63, 42]               0
      BasicBlock-101          [-1, 128, 63, 42]               0
            ReLU-102          [-1, 128, 63, 42]               0
      BasicBlock-103          [-1, 128, 63, 42]               0
          Conv2d-104          [-1, 128, 63, 42]         147,456
          Conv2d-105          [-1, 256, 32, 21]         294,912
     BatchNorm2d-106          [-1, 128, 63, 42]             256
     BatchNorm2d-107          [-1, 256, 32, 21]             512
            ReLU-108          [-1, 128, 63, 42]               0
            ReLU-109          [-1, 256, 32, 21]               0
          Conv2d-110          [-1, 128, 63, 42]         147,456
          Conv2d-111          [-1, 256, 32, 21]         589,824
     BatchNorm2d-112          [-1, 128, 63, 42]             256
     BatchNorm2d-113          [-1, 256, 32, 21]             512
            ReLU-114          [-1, 128, 63, 42]               0
      BasicBlock-115          [-1, 128, 63, 42]               0
          Conv2d-116          [-1, 256, 32, 21]         294,912
          Conv2d-117          [-1, 256, 32, 21]          32,768
     BatchNorm2d-118          [-1, 256, 32, 21]             512
            ReLU-119          [-1, 256, 32, 21]               0
          Conv2d-120          [-1, 256, 32, 21]         589,824
     BatchNorm2d-121          [-1, 256, 32, 21]             512
     BatchNorm2d-122          [-1, 256, 32, 21]             512
            ReLU-123          [-1, 256, 32, 21]               0
      BasicBlock-124          [-1, 256, 32, 21]               0
          Conv2d-125          [-1, 256, 32, 21]          32,768
          Conv2d-126          [-1, 256, 32, 21]         589,824
     BatchNorm2d-127          [-1, 256, 32, 21]             512
            ReLU-128          [-1, 256, 32, 21]               0
          Conv2d-129          [-1, 256, 32, 21]         589,824
     BatchNorm2d-130          [-1, 256, 32, 21]             512
     BatchNorm2d-131          [-1, 256, 32, 21]             512
            ReLU-132          [-1, 256, 32, 21]               0
      BasicBlock-133          [-1, 256, 32, 21]               0
            ReLU-134          [-1, 256, 32, 21]               0
      BasicBlock-135          [-1, 256, 32, 21]               0
          Conv2d-136          [-1, 256, 32, 21]         589,824
          Conv2d-137          [-1, 256, 32, 21]         589,824
     BatchNorm2d-138          [-1, 256, 32, 21]             512
     BatchNorm2d-139          [-1, 256, 32, 21]             512
            ReLU-140          [-1, 256, 32, 21]               0
            ReLU-141          [-1, 256, 32, 21]               0
          Conv2d-142          [-1, 256, 32, 21]         589,824
          Conv2d-143          [-1, 256, 32, 21]         589,824
     BatchNorm2d-144          [-1, 256, 32, 21]             512
     BatchNorm2d-145          [-1, 256, 32, 21]             512
            ReLU-146          [-1, 256, 32, 21]               0
      BasicBlock-147          [-1, 256, 32, 21]               0
            ReLU-148          [-1, 256, 32, 21]               0
      BasicBlock-149          [-1, 256, 32, 21]               0
          Conv2d-150          [-1, 256, 32, 21]         589,824
          Conv2d-151          [-1, 256, 32, 21]         589,824
     BatchNorm2d-152          [-1, 256, 32, 21]             512
     BatchNorm2d-153          [-1, 256, 32, 21]             512
            ReLU-154          [-1, 256, 32, 21]               0
          Conv2d-155          [-1, 256, 32, 21]         589,824
            ReLU-156          [-1, 256, 32, 21]               0
          Conv2d-157          [-1, 256, 32, 21]         589,824
     BatchNorm2d-158          [-1, 256, 32, 21]             512
     BatchNorm2d-159          [-1, 256, 32, 21]             512
            ReLU-160          [-1, 256, 32, 21]               0
      BasicBlock-161          [-1, 256, 32, 21]               0
          Conv2d-162          [-1, 256, 32, 21]         589,824
            ReLU-163          [-1, 256, 32, 21]               0
      BasicBlock-164          [-1, 256, 32, 21]               0
          Conv2d-165          [-1, 256, 32, 21]         589,824
     BatchNorm2d-166          [-1, 256, 32, 21]             512
            ReLU-167          [-1, 256, 32, 21]               0
     BatchNorm2d-168          [-1, 256, 32, 21]             512
          Conv2d-169          [-1, 256, 32, 21]         589,824
            ReLU-170          [-1, 256, 32, 21]               0
          Conv2d-171          [-1, 256, 32, 21]         589,824
     BatchNorm2d-172          [-1, 256, 32, 21]             512
     BatchNorm2d-173          [-1, 256, 32, 21]             512
            ReLU-174          [-1, 256, 32, 21]               0
      BasicBlock-175          [-1, 256, 32, 21]               0
          Conv2d-176          [-1, 256, 32, 21]         589,824
            ReLU-177          [-1, 256, 32, 21]               0
      BasicBlock-178          [-1, 256, 32, 21]               0
          Conv2d-179          [-1, 256, 32, 21]         589,824
     BatchNorm2d-180          [-1, 256, 32, 21]             512
            ReLU-181          [-1, 256, 32, 21]               0
     BatchNorm2d-182          [-1, 256, 32, 21]             512
          Conv2d-183          [-1, 256, 32, 21]         589,824
            ReLU-184          [-1, 256, 32, 21]               0
          Conv2d-185          [-1, 256, 32, 21]         589,824
     BatchNorm2d-186          [-1, 256, 32, 21]             512
     BatchNorm2d-187          [-1, 256, 32, 21]             512
            ReLU-188          [-1, 256, 32, 21]               0
      BasicBlock-189          [-1, 256, 32, 21]               0
          Conv2d-190          [-1, 256, 32, 21]         589,824
            ReLU-191          [-1, 256, 32, 21]               0
      BasicBlock-192          [-1, 256, 32, 21]               0
          Conv2d-193          [-1, 512, 16, 11]       1,179,648
     BatchNorm2d-194          [-1, 256, 32, 21]             512
            ReLU-195          [-1, 256, 32, 21]               0
     BatchNorm2d-196          [-1, 512, 16, 11]           1,024
          Conv2d-197          [-1, 256, 32, 21]         589,824
            ReLU-198          [-1, 512, 16, 11]               0
     BatchNorm2d-199          [-1, 256, 32, 21]             512
            ReLU-200          [-1, 256, 32, 21]               0
      BasicBlock-201          [-1, 256, 32, 21]               0
          Conv2d-202          [-1, 512, 16, 11]       1,179,648
          Conv2d-203          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-204          [-1, 512, 16, 11]           1,024
            ReLU-205          [-1, 512, 16, 11]               0
     BatchNorm2d-206          [-1, 512, 16, 11]           1,024
          Conv2d-207          [-1, 512, 16, 11]         131,072
     BatchNorm2d-208          [-1, 512, 16, 11]           1,024
          Conv2d-209          [-1, 512, 16, 11]       2,359,296
            ReLU-210          [-1, 512, 16, 11]               0
      BasicBlock-211          [-1, 512, 16, 11]               0
     BatchNorm2d-212          [-1, 512, 16, 11]           1,024
          Conv2d-213          [-1, 512, 16, 11]       2,359,296
          Conv2d-214          [-1, 512, 16, 11]         131,072
     BatchNorm2d-215          [-1, 512, 16, 11]           1,024
            ReLU-216          [-1, 512, 16, 11]               0
     BatchNorm2d-217          [-1, 512, 16, 11]           1,024
          Conv2d-218          [-1, 512, 16, 11]       2,359,296
            ReLU-219          [-1, 512, 16, 11]               0
      BasicBlock-220          [-1, 512, 16, 11]               0
     BatchNorm2d-221          [-1, 512, 16, 11]           1,024
          Conv2d-222          [-1, 512, 16, 11]       2,359,296
            ReLU-223          [-1, 512, 16, 11]               0
      BasicBlock-224          [-1, 512, 16, 11]               0
     BatchNorm2d-225          [-1, 512, 16, 11]           1,024
          Conv2d-226          [-1, 512, 16, 11]       2,359,296
            ReLU-227          [-1, 512, 16, 11]               0
          Conv2d-228          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-229          [-1, 512, 16, 11]           1,024
            ReLU-230          [-1, 512, 16, 11]               0
     BatchNorm2d-231          [-1, 512, 16, 11]           1,024
          Conv2d-232          [-1, 512, 16, 11]       2,359,296
            ReLU-233          [-1, 512, 16, 11]               0
      BasicBlock-234          [-1, 512, 16, 11]               0
     BatchNorm2d-235          [-1, 512, 16, 11]           1,024
          Conv2d-236          [-1, 512, 16, 11]       2,359,296
            ReLU-237          [-1, 512, 16, 11]               0
      BasicBlock-238          [-1, 512, 16, 11]               0
     BatchNorm2d-239          [-1, 512, 16, 11]           1,024
AdaptiveAvgPool2d-240            [-1, 512, 1, 1]               0
            ReLU-241          [-1, 512, 16, 11]               0
          Conv2d-242          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-243          [-1, 512, 16, 11]           1,024
            ReLU-244          [-1, 512, 16, 11]               0
      BasicBlock-245          [-1, 512, 16, 11]               0
AdaptiveAvgPool2d-246            [-1, 512, 1, 1]               0
          Linear-247                 [-1, 1000]         513,000
          ResNet-248                 [-1, 1000]               0
          Linear-249                 [-1, 1000]         513,000
          ResNet-250                 [-1, 1000]               0
================================================================
Total params: 43,595,344
Trainable params: 21,797,672
Non-trainable params: 21,797,672
----------------------------------------------------------------
Input size (MB): 1.91
Forward/backward pass size (MB): 650.10
Params size (MB): 166.30
Estimated Total Size (MB): 818.32
----------------------------------------------------------------
None
