----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 250, 167]           9,408
       BatchNorm2d-2         [-1, 64, 250, 167]             128
              ReLU-3         [-1, 64, 250, 167]               0
         MaxPool2d-4          [-1, 64, 125, 84]               0
            Conv2d-5         [-1, 64, 250, 167]           9,408
            Conv2d-6          [-1, 64, 125, 84]           4,096
       BatchNorm2d-7          [-1, 64, 125, 84]             128
              ReLU-8          [-1, 64, 125, 84]               0
            Conv2d-9          [-1, 64, 125, 84]          36,864
      BatchNorm2d-10         [-1, 64, 250, 167]             128
      BatchNorm2d-11          [-1, 64, 125, 84]             128
             ReLU-12          [-1, 64, 125, 84]               0
           Conv2d-13         [-1, 256, 125, 84]          16,384
             ReLU-14         [-1, 64, 250, 167]               0
        MaxPool2d-15          [-1, 64, 125, 84]               0
      BatchNorm2d-16         [-1, 256, 125, 84]             512
           Conv2d-17          [-1, 64, 125, 84]           4,096
           Conv2d-18         [-1, 256, 125, 84]          16,384
      BatchNorm2d-19          [-1, 64, 125, 84]             128
             ReLU-20          [-1, 64, 125, 84]               0
      BatchNorm2d-21         [-1, 256, 125, 84]             512
           Conv2d-22          [-1, 64, 125, 84]          36,864
             ReLU-23         [-1, 256, 125, 84]               0
       Bottleneck-24         [-1, 256, 125, 84]               0
           Conv2d-25          [-1, 64, 125, 84]          16,384
      BatchNorm2d-26          [-1, 64, 125, 84]             128
      BatchNorm2d-27          [-1, 64, 125, 84]             128
             ReLU-28          [-1, 64, 125, 84]               0
             ReLU-29          [-1, 64, 125, 84]               0
           Conv2d-30         [-1, 256, 125, 84]          16,384
           Conv2d-31          [-1, 64, 125, 84]          36,864
      BatchNorm2d-32          [-1, 64, 125, 84]             128
      BatchNorm2d-33         [-1, 256, 125, 84]             512
             ReLU-34          [-1, 64, 125, 84]               0
           Conv2d-35         [-1, 256, 125, 84]          16,384
      BatchNorm2d-36         [-1, 256, 125, 84]             512
           Conv2d-37         [-1, 256, 125, 84]          16,384
             ReLU-38         [-1, 256, 125, 84]               0
       Bottleneck-39         [-1, 256, 125, 84]               0
           Conv2d-40          [-1, 64, 125, 84]          16,384
      BatchNorm2d-41          [-1, 64, 125, 84]             128
             ReLU-42          [-1, 64, 125, 84]               0
           Conv2d-43          [-1, 64, 125, 84]          36,864
      BatchNorm2d-44         [-1, 256, 125, 84]             512
      BatchNorm2d-45          [-1, 64, 125, 84]             128
             ReLU-46          [-1, 64, 125, 84]               0
             ReLU-47         [-1, 256, 125, 84]               0
       Bottleneck-48         [-1, 256, 125, 84]               0
           Conv2d-49         [-1, 256, 125, 84]          16,384
           Conv2d-50          [-1, 64, 125, 84]          16,384
      BatchNorm2d-51         [-1, 256, 125, 84]             512
             ReLU-52         [-1, 256, 125, 84]               0
       Bottleneck-53         [-1, 256, 125, 84]               0
      BatchNorm2d-54          [-1, 64, 125, 84]             128
           Conv2d-55         [-1, 128, 125, 84]          32,768
      BatchNorm2d-56         [-1, 128, 125, 84]             256
             ReLU-57          [-1, 64, 125, 84]               0
             ReLU-58         [-1, 128, 125, 84]               0
           Conv2d-59          [-1, 64, 125, 84]          36,864
           Conv2d-60          [-1, 128, 63, 42]         147,456
      BatchNorm2d-61          [-1, 64, 125, 84]             128
      BatchNorm2d-62          [-1, 128, 63, 42]             256
             ReLU-63          [-1, 64, 125, 84]               0
             ReLU-64          [-1, 128, 63, 42]               0
           Conv2d-65         [-1, 256, 125, 84]          16,384
           Conv2d-66          [-1, 512, 63, 42]          65,536
      BatchNorm2d-67          [-1, 512, 63, 42]           1,024
      BatchNorm2d-68         [-1, 256, 125, 84]             512
           Conv2d-69          [-1, 512, 63, 42]         131,072
      BatchNorm2d-70          [-1, 512, 63, 42]           1,024
             ReLU-71         [-1, 256, 125, 84]               0
       Bottleneck-72         [-1, 256, 125, 84]               0
             ReLU-73          [-1, 512, 63, 42]               0
       Bottleneck-74          [-1, 512, 63, 42]               0
           Conv2d-75          [-1, 64, 125, 84]          16,384
           Conv2d-76          [-1, 128, 63, 42]          65,536
      BatchNorm2d-77          [-1, 64, 125, 84]             128
      BatchNorm2d-78          [-1, 128, 63, 42]             256
             ReLU-79          [-1, 64, 125, 84]               0
             ReLU-80          [-1, 128, 63, 42]               0
           Conv2d-81          [-1, 64, 125, 84]          36,864
           Conv2d-82          [-1, 128, 63, 42]         147,456
      BatchNorm2d-83          [-1, 64, 125, 84]             128
      BatchNorm2d-84          [-1, 128, 63, 42]             256
             ReLU-85          [-1, 128, 63, 42]               0
             ReLU-86          [-1, 64, 125, 84]               0
           Conv2d-87          [-1, 512, 63, 42]          65,536
           Conv2d-88         [-1, 256, 125, 84]          16,384
      BatchNorm2d-89          [-1, 512, 63, 42]           1,024
      BatchNorm2d-90         [-1, 256, 125, 84]             512
             ReLU-91          [-1, 512, 63, 42]               0
       Bottleneck-92          [-1, 512, 63, 42]               0
             ReLU-93         [-1, 256, 125, 84]               0
       Bottleneck-94         [-1, 256, 125, 84]               0
           Conv2d-95          [-1, 128, 63, 42]          65,536
           Conv2d-96         [-1, 128, 125, 84]          32,768
      BatchNorm2d-97          [-1, 128, 63, 42]             256
      BatchNorm2d-98         [-1, 128, 125, 84]             256
             ReLU-99          [-1, 128, 63, 42]               0
            ReLU-100         [-1, 128, 125, 84]               0
          Conv2d-101          [-1, 128, 63, 42]         147,456
          Conv2d-102          [-1, 128, 63, 42]         147,456
     BatchNorm2d-103          [-1, 128, 63, 42]             256
     BatchNorm2d-104          [-1, 128, 63, 42]             256
            ReLU-105          [-1, 128, 63, 42]               0
            ReLU-106          [-1, 128, 63, 42]               0
          Conv2d-107          [-1, 512, 63, 42]          65,536
          Conv2d-108          [-1, 512, 63, 42]          65,536
     BatchNorm2d-109          [-1, 512, 63, 42]           1,024
     BatchNorm2d-110          [-1, 512, 63, 42]           1,024
          Conv2d-111          [-1, 512, 63, 42]         131,072
            ReLU-112          [-1, 512, 63, 42]               0
      Bottleneck-113          [-1, 512, 63, 42]               0
     BatchNorm2d-114          [-1, 512, 63, 42]           1,024
          Conv2d-115          [-1, 128, 63, 42]          65,536
            ReLU-116          [-1, 512, 63, 42]               0
      Bottleneck-117          [-1, 512, 63, 42]               0
          Conv2d-118          [-1, 128, 63, 42]          65,536
     BatchNorm2d-119          [-1, 128, 63, 42]             256
     BatchNorm2d-120          [-1, 128, 63, 42]             256
            ReLU-121          [-1, 128, 63, 42]               0
          Conv2d-122          [-1, 128, 63, 42]         147,456
            ReLU-123          [-1, 128, 63, 42]               0
          Conv2d-124          [-1, 128, 63, 42]         147,456
     BatchNorm2d-125          [-1, 128, 63, 42]             256
     BatchNorm2d-126          [-1, 128, 63, 42]             256
            ReLU-127          [-1, 128, 63, 42]               0
            ReLU-128          [-1, 128, 63, 42]               0
          Conv2d-129          [-1, 512, 63, 42]          65,536
          Conv2d-130          [-1, 512, 63, 42]          65,536
     BatchNorm2d-131          [-1, 512, 63, 42]           1,024
     BatchNorm2d-132          [-1, 512, 63, 42]           1,024
            ReLU-133          [-1, 512, 63, 42]               0
      Bottleneck-134          [-1, 512, 63, 42]               0
            ReLU-135          [-1, 512, 63, 42]               0
      Bottleneck-136          [-1, 512, 63, 42]               0
          Conv2d-137          [-1, 128, 63, 42]          65,536
          Conv2d-138          [-1, 256, 63, 42]         131,072
     BatchNorm2d-139          [-1, 128, 63, 42]             256
     BatchNorm2d-140          [-1, 256, 63, 42]             512
            ReLU-141          [-1, 128, 63, 42]               0
          Conv2d-142          [-1, 128, 63, 42]         147,456
            ReLU-143          [-1, 256, 63, 42]               0
     BatchNorm2d-144          [-1, 128, 63, 42]             256
            ReLU-145          [-1, 128, 63, 42]               0
          Conv2d-146          [-1, 512, 63, 42]          65,536
     BatchNorm2d-147          [-1, 512, 63, 42]           1,024
          Conv2d-148          [-1, 256, 32, 21]         589,824
            ReLU-149          [-1, 512, 63, 42]               0
      Bottleneck-150          [-1, 512, 63, 42]               0
          Conv2d-151          [-1, 128, 63, 42]          65,536
     BatchNorm2d-152          [-1, 256, 32, 21]             512
     BatchNorm2d-153          [-1, 128, 63, 42]             256
            ReLU-154          [-1, 256, 32, 21]               0
            ReLU-155          [-1, 128, 63, 42]               0
          Conv2d-156         [-1, 1024, 32, 21]         262,144
          Conv2d-157          [-1, 128, 63, 42]         147,456
     BatchNorm2d-158         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-159          [-1, 128, 63, 42]             256
            ReLU-160          [-1, 128, 63, 42]               0
          Conv2d-161         [-1, 1024, 32, 21]         524,288
          Conv2d-162          [-1, 512, 63, 42]          65,536
     BatchNorm2d-163         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-164          [-1, 512, 63, 42]           1,024
            ReLU-165         [-1, 1024, 32, 21]               0
      Bottleneck-166         [-1, 1024, 32, 21]               0
            ReLU-167          [-1, 512, 63, 42]               0
      Bottleneck-168          [-1, 512, 63, 42]               0
          Conv2d-169          [-1, 256, 32, 21]         262,144
          Conv2d-170          [-1, 256, 63, 42]         131,072
     BatchNorm2d-171          [-1, 256, 32, 21]             512
     BatchNorm2d-172          [-1, 256, 63, 42]             512
            ReLU-173          [-1, 256, 32, 21]               0
            ReLU-174          [-1, 256, 63, 42]               0
          Conv2d-175          [-1, 256, 32, 21]         589,824
          Conv2d-176          [-1, 256, 32, 21]         589,824
     BatchNorm2d-177          [-1, 256, 32, 21]             512
     BatchNorm2d-178          [-1, 256, 32, 21]             512
            ReLU-179          [-1, 256, 32, 21]               0
            ReLU-180          [-1, 256, 32, 21]               0
          Conv2d-181         [-1, 1024, 32, 21]         262,144
          Conv2d-182         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-183         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-184         [-1, 1024, 32, 21]           2,048
          Conv2d-185         [-1, 1024, 32, 21]         524,288
            ReLU-186         [-1, 1024, 32, 21]               0
      Bottleneck-187         [-1, 1024, 32, 21]               0
          Conv2d-188          [-1, 256, 32, 21]         262,144
     BatchNorm2d-189         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-190          [-1, 256, 32, 21]             512
            ReLU-191         [-1, 1024, 32, 21]               0
      Bottleneck-192         [-1, 1024, 32, 21]               0
          Conv2d-193          [-1, 256, 32, 21]         262,144
            ReLU-194          [-1, 256, 32, 21]               0
          Conv2d-195          [-1, 256, 32, 21]         589,824
     BatchNorm2d-196          [-1, 256, 32, 21]             512
            ReLU-197          [-1, 256, 32, 21]               0
     BatchNorm2d-198          [-1, 256, 32, 21]             512
          Conv2d-199         [-1, 1024, 32, 21]         262,144
            ReLU-200          [-1, 256, 32, 21]               0
     BatchNorm2d-201         [-1, 1024, 32, 21]           2,048
          Conv2d-202          [-1, 256, 32, 21]         589,824
            ReLU-203         [-1, 1024, 32, 21]               0
      Bottleneck-204         [-1, 1024, 32, 21]               0
          Conv2d-205          [-1, 256, 32, 21]         262,144
     BatchNorm2d-206          [-1, 256, 32, 21]             512
     BatchNorm2d-207          [-1, 256, 32, 21]             512
            ReLU-208          [-1, 256, 32, 21]               0
          Conv2d-209         [-1, 1024, 32, 21]         262,144
            ReLU-210          [-1, 256, 32, 21]               0
          Conv2d-211          [-1, 256, 32, 21]         589,824
     BatchNorm2d-212         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-213          [-1, 256, 32, 21]             512
            ReLU-214         [-1, 1024, 32, 21]               0
      Bottleneck-215         [-1, 1024, 32, 21]               0
          Conv2d-216          [-1, 256, 32, 21]         262,144
            ReLU-217          [-1, 256, 32, 21]               0
          Conv2d-218         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-219          [-1, 256, 32, 21]             512
     BatchNorm2d-220         [-1, 1024, 32, 21]           2,048
            ReLU-221          [-1, 256, 32, 21]               0
          Conv2d-222          [-1, 256, 32, 21]         589,824
            ReLU-223         [-1, 1024, 32, 21]               0
      Bottleneck-224         [-1, 1024, 32, 21]               0
          Conv2d-225          [-1, 256, 32, 21]         262,144
     BatchNorm2d-226          [-1, 256, 32, 21]             512
     BatchNorm2d-227          [-1, 256, 32, 21]             512
            ReLU-228          [-1, 256, 32, 21]               0
          Conv2d-229         [-1, 1024, 32, 21]         262,144
            ReLU-230          [-1, 256, 32, 21]               0
          Conv2d-231          [-1, 256, 32, 21]         589,824
     BatchNorm2d-232         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-233          [-1, 256, 32, 21]             512
            ReLU-234         [-1, 1024, 32, 21]               0
      Bottleneck-235         [-1, 1024, 32, 21]               0
          Conv2d-236          [-1, 256, 32, 21]         262,144
            ReLU-237          [-1, 256, 32, 21]               0
          Conv2d-238         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-239          [-1, 256, 32, 21]             512
     BatchNorm2d-240         [-1, 1024, 32, 21]           2,048
            ReLU-241          [-1, 256, 32, 21]               0
          Conv2d-242          [-1, 256, 32, 21]         589,824
            ReLU-243         [-1, 1024, 32, 21]               0
      Bottleneck-244         [-1, 1024, 32, 21]               0
          Conv2d-245          [-1, 256, 32, 21]         262,144
     BatchNorm2d-246          [-1, 256, 32, 21]             512
     BatchNorm2d-247          [-1, 256, 32, 21]             512
            ReLU-248          [-1, 256, 32, 21]               0
          Conv2d-249         [-1, 1024, 32, 21]         262,144
            ReLU-250          [-1, 256, 32, 21]               0
          Conv2d-251          [-1, 256, 32, 21]         589,824
     BatchNorm2d-252         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-253          [-1, 256, 32, 21]             512
            ReLU-254         [-1, 1024, 32, 21]               0
      Bottleneck-255         [-1, 1024, 32, 21]               0
            ReLU-256          [-1, 256, 32, 21]               0
          Conv2d-257          [-1, 256, 32, 21]         262,144
          Conv2d-258         [-1, 1024, 32, 21]         262,144
     BatchNorm2d-259          [-1, 256, 32, 21]             512
     BatchNorm2d-260         [-1, 1024, 32, 21]           2,048
            ReLU-261          [-1, 256, 32, 21]               0
            ReLU-262         [-1, 1024, 32, 21]               0
      Bottleneck-263         [-1, 1024, 32, 21]               0
          Conv2d-264          [-1, 256, 32, 21]         589,824
          Conv2d-265          [-1, 512, 32, 21]         524,288
     BatchNorm2d-266          [-1, 256, 32, 21]             512
     BatchNorm2d-267          [-1, 512, 32, 21]           1,024
            ReLU-268          [-1, 256, 32, 21]               0
          Conv2d-269         [-1, 1024, 32, 21]         262,144
            ReLU-270          [-1, 512, 32, 21]               0
          Conv2d-271          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-272         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-273          [-1, 512, 16, 11]           1,024
            ReLU-274         [-1, 1024, 32, 21]               0
      Bottleneck-275         [-1, 1024, 32, 21]               0
          Conv2d-276          [-1, 256, 32, 21]         262,144
            ReLU-277          [-1, 512, 16, 11]               0
          Conv2d-278         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-279          [-1, 256, 32, 21]             512
     BatchNorm2d-280         [-1, 2048, 16, 11]           4,096
            ReLU-281          [-1, 256, 32, 21]               0
          Conv2d-282          [-1, 256, 32, 21]         589,824
          Conv2d-283         [-1, 2048, 16, 11]       2,097,152
     BatchNorm2d-284          [-1, 256, 32, 21]             512
     BatchNorm2d-285         [-1, 2048, 16, 11]           4,096
            ReLU-286          [-1, 256, 32, 21]               0
          Conv2d-287         [-1, 1024, 32, 21]         262,144
            ReLU-288         [-1, 2048, 16, 11]               0
      Bottleneck-289         [-1, 2048, 16, 11]               0
          Conv2d-290          [-1, 512, 16, 11]       1,048,576
     BatchNorm2d-291         [-1, 1024, 32, 21]           2,048
     BatchNorm2d-292          [-1, 512, 16, 11]           1,024
            ReLU-293         [-1, 1024, 32, 21]               0
      Bottleneck-294         [-1, 1024, 32, 21]               0
          Conv2d-295          [-1, 512, 32, 21]         524,288
            ReLU-296          [-1, 512, 16, 11]               0
     BatchNorm2d-297          [-1, 512, 32, 21]           1,024
            ReLU-298          [-1, 512, 32, 21]               0
          Conv2d-299          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-300          [-1, 512, 16, 11]           1,024
          Conv2d-301          [-1, 512, 16, 11]       2,359,296
            ReLU-302          [-1, 512, 16, 11]               0
          Conv2d-303         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-304          [-1, 512, 16, 11]           1,024
     BatchNorm2d-305         [-1, 2048, 16, 11]           4,096
            ReLU-306          [-1, 512, 16, 11]               0
          Conv2d-307         [-1, 2048, 16, 11]       1,048,576
          Conv2d-308         [-1, 2048, 16, 11]       2,097,152
     BatchNorm2d-309         [-1, 2048, 16, 11]           4,096
     BatchNorm2d-310         [-1, 2048, 16, 11]           4,096
            ReLU-311         [-1, 2048, 16, 11]               0
      Bottleneck-312         [-1, 2048, 16, 11]               0
            ReLU-313         [-1, 2048, 16, 11]               0
      Bottleneck-314         [-1, 2048, 16, 11]               0
          Conv2d-315          [-1, 512, 16, 11]       1,048,576
          Conv2d-316          [-1, 512, 16, 11]       1,048,576
     BatchNorm2d-317          [-1, 512, 16, 11]           1,024
     BatchNorm2d-318          [-1, 512, 16, 11]           1,024
            ReLU-319          [-1, 512, 16, 11]               0
            ReLU-320          [-1, 512, 16, 11]               0
          Conv2d-321          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-322          [-1, 512, 16, 11]           1,024
            ReLU-323          [-1, 512, 16, 11]               0
          Conv2d-324          [-1, 512, 16, 11]       2,359,296
          Conv2d-325         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-326          [-1, 512, 16, 11]           1,024
     BatchNorm2d-327         [-1, 2048, 16, 11]           4,096
            ReLU-328          [-1, 512, 16, 11]               0
            ReLU-329         [-1, 2048, 16, 11]               0
      Bottleneck-330         [-1, 2048, 16, 11]               0
          Conv2d-331         [-1, 2048, 16, 11]       1,048,576
AdaptiveAvgPool2d-332           [-1, 2048, 1, 1]               0
     BatchNorm2d-333         [-1, 2048, 16, 11]           4,096
            ReLU-334         [-1, 2048, 16, 11]               0
      Bottleneck-335         [-1, 2048, 16, 11]               0
          Conv2d-336          [-1, 512, 16, 11]       1,048,576
     BatchNorm2d-337          [-1, 512, 16, 11]           1,024
            ReLU-338          [-1, 512, 16, 11]               0
          Conv2d-339          [-1, 512, 16, 11]       2,359,296
     BatchNorm2d-340          [-1, 512, 16, 11]           1,024
            ReLU-341          [-1, 512, 16, 11]               0
          Conv2d-342         [-1, 2048, 16, 11]       1,048,576
     BatchNorm2d-343         [-1, 2048, 16, 11]           4,096
            ReLU-344         [-1, 2048, 16, 11]               0
      Bottleneck-345         [-1, 2048, 16, 11]               0
AdaptiveAvgPool2d-346           [-1, 2048, 1, 1]               0
          Linear-347                 [-1, 1000]       2,049,000
          ResNet-348                 [-1, 1000]               0
          Linear-349                 [-1, 1000]       2,049,000
          ResNet-350                 [-1, 1000]               0
================================================================
Total params: 51,114,064
Trainable params: 25,557,032
Non-trainable params: 25,557,032
----------------------------------------------------------------
Input size (MB): 1.91
Forward/backward pass size (MB): 1937.57
Params size (MB): 194.98
Estimated Total Size (MB): 2134.47
----------------------------------------------------------------
None
