Number of GPUs Available: 8
CUDA Current Device Id: 0
Type of GPU: GeForce RTX 2080 Ti

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 64, 512, 1024]           9,408
       BatchNorm2d-2        [-1, 64, 512, 1024]             128
              ReLU-3        [-1, 64, 512, 1024]               0
         MaxPool2d-4         [-1, 64, 256, 512]               0
            Conv2d-5         [-1, 64, 256, 512]          36,864
       BatchNorm2d-6         [-1, 64, 256, 512]             128
              ReLU-7         [-1, 64, 256, 512]               0
            Conv2d-8         [-1, 64, 256, 512]          36,864
              ReLU-9         [-1, 64, 256, 512]               0
      BatchNorm2d-10         [-1, 64, 256, 512]             128
             ReLU-11         [-1, 64, 256, 512]               0
       BasicBlock-12         [-1, 64, 256, 512]               0
           Conv2d-13         [-1, 64, 256, 512]          36,864
      BatchNorm2d-14         [-1, 64, 256, 512]             128
             ReLU-15         [-1, 64, 256, 512]               0
           Conv2d-16         [-1, 64, 256, 512]          36,864
             ReLU-17         [-1, 64, 256, 512]               0
      BatchNorm2d-18         [-1, 64, 256, 512]             128
             ReLU-19         [-1, 64, 256, 512]               0
       BasicBlock-20         [-1, 64, 256, 512]               0
           Conv2d-21         [-1, 64, 256, 512]          36,864
      BatchNorm2d-22         [-1, 64, 256, 512]             128
             ReLU-23         [-1, 64, 256, 512]               0
           Conv2d-24         [-1, 64, 256, 512]          36,864
             ReLU-25         [-1, 64, 256, 512]               0
      BatchNorm2d-26         [-1, 64, 256, 512]             128
             ReLU-27         [-1, 64, 256, 512]               0
       BasicBlock-28         [-1, 64, 256, 512]               0
           Conv2d-29        [-1, 128, 128, 256]          73,728
      BatchNorm2d-30        [-1, 128, 128, 256]             256
             ReLU-31        [-1, 128, 128, 256]               0
           Conv2d-32        [-1, 128, 128, 256]         147,456
             ReLU-33        [-1, 128, 128, 256]               0
      BatchNorm2d-34        [-1, 128, 128, 256]             256
           Conv2d-35        [-1, 128, 128, 256]           8,192
      BatchNorm2d-36        [-1, 128, 128, 256]             256
             ReLU-37        [-1, 128, 128, 256]               0
       BasicBlock-38        [-1, 128, 128, 256]               0
           Conv2d-39        [-1, 128, 128, 256]         147,456
      BatchNorm2d-40        [-1, 128, 128, 256]             256
             ReLU-41        [-1, 128, 128, 256]               0
           Conv2d-42        [-1, 128, 128, 256]         147,456
             ReLU-43        [-1, 128, 128, 256]               0
      BatchNorm2d-44        [-1, 128, 128, 256]             256
             ReLU-45        [-1, 128, 128, 256]               0
       BasicBlock-46        [-1, 128, 128, 256]               0
           Conv2d-47        [-1, 128, 128, 256]         147,456
      BatchNorm2d-48        [-1, 128, 128, 256]             256
             ReLU-49        [-1, 128, 128, 256]               0
           Conv2d-50        [-1, 128, 128, 256]         147,456
             ReLU-51        [-1, 128, 128, 256]               0
      BatchNorm2d-52        [-1, 128, 128, 256]             256
             ReLU-53        [-1, 128, 128, 256]               0
       BasicBlock-54        [-1, 128, 128, 256]               0
           Conv2d-55        [-1, 128, 128, 256]         147,456
      BatchNorm2d-56        [-1, 128, 128, 256]             256
             ReLU-57        [-1, 128, 128, 256]               0
           Conv2d-58        [-1, 128, 128, 256]         147,456
             ReLU-59        [-1, 128, 128, 256]               0
      BatchNorm2d-60        [-1, 128, 128, 256]             256
             ReLU-61        [-1, 128, 128, 256]               0
       BasicBlock-62        [-1, 128, 128, 256]               0
           Conv2d-63         [-1, 256, 64, 128]         294,912
      BatchNorm2d-64         [-1, 256, 64, 128]             512
             ReLU-65         [-1, 256, 64, 128]               0
           Conv2d-66         [-1, 256, 64, 128]         589,824
             ReLU-67         [-1, 256, 64, 128]               0
      BatchNorm2d-68         [-1, 256, 64, 128]             512
           Conv2d-69         [-1, 256, 64, 128]          32,768
      BatchNorm2d-70         [-1, 256, 64, 128]             512
             ReLU-71         [-1, 256, 64, 128]               0
       BasicBlock-72         [-1, 256, 64, 128]               0
           Conv2d-73         [-1, 256, 64, 128]         589,824
      BatchNorm2d-74         [-1, 256, 64, 128]             512
             ReLU-75         [-1, 256, 64, 128]               0
           Conv2d-76         [-1, 256, 64, 128]         589,824
             ReLU-77         [-1, 256, 64, 128]               0
      BatchNorm2d-78         [-1, 256, 64, 128]             512
             ReLU-79         [-1, 256, 64, 128]               0
       BasicBlock-80         [-1, 256, 64, 128]               0
           Conv2d-81         [-1, 256, 64, 128]         589,824
      BatchNorm2d-82         [-1, 256, 64, 128]             512
             ReLU-83         [-1, 256, 64, 128]               0
           Conv2d-84         [-1, 256, 64, 128]         589,824
             ReLU-85         [-1, 256, 64, 128]               0
      BatchNorm2d-86         [-1, 256, 64, 128]             512
             ReLU-87         [-1, 256, 64, 128]               0
       BasicBlock-88         [-1, 256, 64, 128]               0
           Conv2d-89         [-1, 256, 64, 128]         589,824
      BatchNorm2d-90         [-1, 256, 64, 128]             512
             ReLU-91         [-1, 256, 64, 128]               0
           Conv2d-92         [-1, 256, 64, 128]         589,824
             ReLU-93         [-1, 256, 64, 128]               0
      BatchNorm2d-94         [-1, 256, 64, 128]             512
             ReLU-95         [-1, 256, 64, 128]               0
       BasicBlock-96         [-1, 256, 64, 128]               0
           Conv2d-97         [-1, 256, 64, 128]         589,824
      BatchNorm2d-98         [-1, 256, 64, 128]             512
             ReLU-99         [-1, 256, 64, 128]               0
          Conv2d-100         [-1, 256, 64, 128]         589,824
            ReLU-101         [-1, 256, 64, 128]               0
     BatchNorm2d-102         [-1, 256, 64, 128]             512
            ReLU-103         [-1, 256, 64, 128]               0
      BasicBlock-104         [-1, 256, 64, 128]               0
          Conv2d-105         [-1, 256, 64, 128]         589,824
     BatchNorm2d-106         [-1, 256, 64, 128]             512
            ReLU-107         [-1, 256, 64, 128]               0
          Conv2d-108         [-1, 256, 64, 128]         589,824
            ReLU-109         [-1, 256, 64, 128]               0
     BatchNorm2d-110         [-1, 256, 64, 128]             512
            ReLU-111         [-1, 256, 64, 128]               0
      BasicBlock-112         [-1, 256, 64, 128]               0
          Conv2d-113          [-1, 512, 32, 64]       1,179,648
     BatchNorm2d-114          [-1, 512, 32, 64]           1,024
            ReLU-115          [-1, 512, 32, 64]               0
          Conv2d-116          [-1, 512, 32, 64]       2,359,296
            ReLU-117          [-1, 512, 32, 64]               0
     BatchNorm2d-118          [-1, 512, 32, 64]           1,024
          Conv2d-119          [-1, 512, 32, 64]         131,072
     BatchNorm2d-120          [-1, 512, 32, 64]           1,024
            ReLU-121          [-1, 512, 32, 64]               0
      BasicBlock-122          [-1, 512, 32, 64]               0
          Conv2d-123          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-124          [-1, 512, 32, 64]           1,024
            ReLU-125          [-1, 512, 32, 64]               0
          Conv2d-126          [-1, 512, 32, 64]       2,359,296
            ReLU-127          [-1, 512, 32, 64]               0
     BatchNorm2d-128          [-1, 512, 32, 64]           1,024
            ReLU-129          [-1, 512, 32, 64]               0
      BasicBlock-130          [-1, 512, 32, 64]               0
          Conv2d-131          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-132          [-1, 512, 32, 64]           1,024
            ReLU-133          [-1, 512, 32, 64]               0
          Conv2d-134          [-1, 512, 32, 64]       2,359,296
            ReLU-135          [-1, 512, 32, 64]               0
     BatchNorm2d-136          [-1, 512, 32, 64]           1,024
            ReLU-137          [-1, 512, 32, 64]               0
      BasicBlock-138          [-1, 512, 32, 64]               0
AdaptiveAvgPool2d-139            [-1, 512, 1, 1]               0
          Linear-140                 [-1, 1000]         513,000
================================================================
Total params: 21,797,672
Trainable params: 21,797,672
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 4464.01
Params size (MB): 83.15
Estimated Total Size (MB): 4571.16
----------------------------------------------------------------
