Number of GPUs Available: 8
CUDA Current Device Id: 0
Type of GPU: GeForce RTX 2080 Ti

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 64, 512, 1024]           9,408
       BatchNorm2d-2        [-1, 64, 512, 1024]             128
              ReLU-3        [-1, 64, 512, 1024]               0
         MaxPool2d-4         [-1, 64, 256, 512]               0
            Conv2d-5         [-1, 64, 256, 512]          36,864
       BatchNorm2d-6         [-1, 64, 256, 512]             128
              ReLU-7         [-1, 64, 256, 512]               0
            Conv2d-8         [-1, 64, 256, 512]          36,864
              ReLU-9         [-1, 64, 256, 512]               0
      BatchNorm2d-10         [-1, 64, 256, 512]             128
             ReLU-11         [-1, 64, 256, 512]               0
       BasicBlock-12         [-1, 64, 256, 512]               0
           Conv2d-13         [-1, 64, 256, 512]          36,864
      BatchNorm2d-14         [-1, 64, 256, 512]             128
             ReLU-15         [-1, 64, 256, 512]               0
           Conv2d-16         [-1, 64, 256, 512]          36,864
             ReLU-17         [-1, 64, 256, 512]               0
      BatchNorm2d-18         [-1, 64, 256, 512]             128
             ReLU-19         [-1, 64, 256, 512]               0
       BasicBlock-20         [-1, 64, 256, 512]               0
           Conv2d-21        [-1, 128, 128, 256]          73,728
      BatchNorm2d-22        [-1, 128, 128, 256]             256
             ReLU-23        [-1, 128, 128, 256]               0
           Conv2d-24        [-1, 128, 128, 256]         147,456
             ReLU-25        [-1, 128, 128, 256]               0
      BatchNorm2d-26        [-1, 128, 128, 256]             256
           Conv2d-27        [-1, 128, 128, 256]           8,192
      BatchNorm2d-28        [-1, 128, 128, 256]             256
             ReLU-29        [-1, 128, 128, 256]               0
       BasicBlock-30        [-1, 128, 128, 256]               0
           Conv2d-31        [-1, 128, 128, 256]         147,456
      BatchNorm2d-32        [-1, 128, 128, 256]             256
             ReLU-33        [-1, 128, 128, 256]               0
           Conv2d-34        [-1, 128, 128, 256]         147,456
             ReLU-35        [-1, 128, 128, 256]               0
      BatchNorm2d-36        [-1, 128, 128, 256]             256
             ReLU-37        [-1, 128, 128, 256]               0
       BasicBlock-38        [-1, 128, 128, 256]               0
           Conv2d-39         [-1, 256, 64, 128]         294,912
      BatchNorm2d-40         [-1, 256, 64, 128]             512
             ReLU-41         [-1, 256, 64, 128]               0
           Conv2d-42         [-1, 256, 64, 128]         589,824
             ReLU-43         [-1, 256, 64, 128]               0
      BatchNorm2d-44         [-1, 256, 64, 128]             512
           Conv2d-45         [-1, 256, 64, 128]          32,768
      BatchNorm2d-46         [-1, 256, 64, 128]             512
             ReLU-47         [-1, 256, 64, 128]               0
       BasicBlock-48         [-1, 256, 64, 128]               0
           Conv2d-49         [-1, 256, 64, 128]         589,824
      BatchNorm2d-50         [-1, 256, 64, 128]             512
             ReLU-51         [-1, 256, 64, 128]               0
           Conv2d-52         [-1, 256, 64, 128]         589,824
             ReLU-53         [-1, 256, 64, 128]               0
      BatchNorm2d-54         [-1, 256, 64, 128]             512
             ReLU-55         [-1, 256, 64, 128]               0
       BasicBlock-56         [-1, 256, 64, 128]               0
           Conv2d-57          [-1, 512, 32, 64]       1,179,648
      BatchNorm2d-58          [-1, 512, 32, 64]           1,024
             ReLU-59          [-1, 512, 32, 64]               0
           Conv2d-60          [-1, 512, 32, 64]       2,359,296
             ReLU-61          [-1, 512, 32, 64]               0
      BatchNorm2d-62          [-1, 512, 32, 64]           1,024
           Conv2d-63          [-1, 512, 32, 64]         131,072
      BatchNorm2d-64          [-1, 512, 32, 64]           1,024
             ReLU-65          [-1, 512, 32, 64]               0
       BasicBlock-66          [-1, 512, 32, 64]               0
           Conv2d-67          [-1, 512, 32, 64]       2,359,296
      BatchNorm2d-68          [-1, 512, 32, 64]           1,024
             ReLU-69          [-1, 512, 32, 64]               0
           Conv2d-70          [-1, 512, 32, 64]       2,359,296
             ReLU-71          [-1, 512, 32, 64]               0
      BatchNorm2d-72          [-1, 512, 32, 64]           1,024
             ReLU-73          [-1, 512, 32, 64]               0
       BasicBlock-74          [-1, 512, 32, 64]               0
AdaptiveAvgPool2d-75            [-1, 512, 1, 1]               0
           Linear-76                 [-1, 1000]         513,000
================================================================
Total params: 11,689,512
Trainable params: 11,689,512
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 2864.01
Params size (MB): 44.59
Estimated Total Size (MB): 2932.60
----------------------------------------------------------------