----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 64, 512, 1024]           9,408
       BatchNorm2d-2        [-1, 64, 512, 1024]             128
              ReLU-3        [-1, 64, 512, 1024]               0
         MaxPool2d-4         [-1, 64, 256, 512]               0
            Conv2d-5         [-1, 64, 256, 512]           4,096
       BatchNorm2d-6         [-1, 64, 256, 512]             128
              ReLU-7         [-1, 64, 256, 512]               0
            Conv2d-8         [-1, 64, 256, 512]          36,864
       BatchNorm2d-9         [-1, 64, 256, 512]             128
             ReLU-10         [-1, 64, 256, 512]               0
           Conv2d-11        [-1, 64, 512, 1024]           9,408
           Conv2d-12        [-1, 256, 256, 512]          16,384
      BatchNorm2d-13        [-1, 256, 256, 512]             512
           Conv2d-14        [-1, 256, 256, 512]          16,384
      BatchNorm2d-15        [-1, 64, 512, 1024]             128
             ReLU-16        [-1, 64, 512, 1024]               0
        MaxPool2d-17         [-1, 64, 256, 512]               0
           Conv2d-18         [-1, 64, 256, 512]           4,096
      BatchNorm2d-19        [-1, 256, 256, 512]             512
      BatchNorm2d-20         [-1, 64, 256, 512]             128
             ReLU-21        [-1, 256, 256, 512]               0
       Bottleneck-22        [-1, 256, 256, 512]               0
           Conv2d-23         [-1, 64, 256, 512]          16,384
             ReLU-24         [-1, 64, 256, 512]               0
           Conv2d-25         [-1, 64, 256, 512]          36,864
      BatchNorm2d-26         [-1, 64, 256, 512]             128
             ReLU-27         [-1, 64, 256, 512]               0
      BatchNorm2d-28         [-1, 64, 256, 512]             128
           Conv2d-29         [-1, 64, 256, 512]          36,864
             ReLU-30         [-1, 64, 256, 512]               0
      BatchNorm2d-31         [-1, 64, 256, 512]             128
           Conv2d-32        [-1, 256, 256, 512]          16,384
             ReLU-33         [-1, 64, 256, 512]               0
           Conv2d-34        [-1, 256, 256, 512]          16,384
      BatchNorm2d-35        [-1, 256, 256, 512]             512
             ReLU-36        [-1, 256, 256, 512]               0
       Bottleneck-37        [-1, 256, 256, 512]               0
           Conv2d-38         [-1, 64, 256, 512]          16,384
      BatchNorm2d-39         [-1, 64, 256, 512]             128
             ReLU-40         [-1, 64, 256, 512]               0
           Conv2d-41         [-1, 64, 256, 512]          36,864
      BatchNorm2d-42        [-1, 256, 256, 512]             512
      BatchNorm2d-43         [-1, 64, 256, 512]             128
             ReLU-44         [-1, 64, 256, 512]               0
           Conv2d-45        [-1, 256, 256, 512]          16,384
           Conv2d-46        [-1, 256, 256, 512]          16,384
      BatchNorm2d-47        [-1, 256, 256, 512]             512
             ReLU-48        [-1, 256, 256, 512]               0
       Bottleneck-49        [-1, 256, 256, 512]               0
           Conv2d-50        [-1, 128, 256, 512]          32,768
      BatchNorm2d-51        [-1, 128, 256, 512]             256
             ReLU-52        [-1, 128, 256, 512]               0
      BatchNorm2d-53        [-1, 256, 256, 512]             512
           Conv2d-54        [-1, 128, 128, 256]         147,456
      BatchNorm2d-55        [-1, 128, 128, 256]             256
             ReLU-56        [-1, 256, 256, 512]               0
       Bottleneck-57        [-1, 256, 256, 512]               0
             ReLU-58        [-1, 128, 128, 256]               0
           Conv2d-59         [-1, 64, 256, 512]          16,384
           Conv2d-60        [-1, 512, 128, 256]          65,536
      BatchNorm2d-61        [-1, 512, 128, 256]           1,024
      BatchNorm2d-62         [-1, 64, 256, 512]             128
           Conv2d-63        [-1, 512, 128, 256]         131,072
             ReLU-64         [-1, 64, 256, 512]               0
           Conv2d-65         [-1, 64, 256, 512]          36,864
      BatchNorm2d-66        [-1, 512, 128, 256]           1,024
             ReLU-67        [-1, 512, 128, 256]               0
       Bottleneck-68        [-1, 512, 128, 256]               0
      BatchNorm2d-69         [-1, 64, 256, 512]             128
           Conv2d-70        [-1, 128, 128, 256]          65,536
             ReLU-71         [-1, 64, 256, 512]               0
      BatchNorm2d-72        [-1, 128, 128, 256]             256
           Conv2d-73        [-1, 256, 256, 512]          16,384
             ReLU-74        [-1, 128, 128, 256]               0
           Conv2d-75        [-1, 128, 128, 256]         147,456
      BatchNorm2d-76        [-1, 256, 256, 512]             512
      BatchNorm2d-77        [-1, 128, 128, 256]             256
             ReLU-78        [-1, 128, 128, 256]               0
             ReLU-79        [-1, 256, 256, 512]               0
       Bottleneck-80        [-1, 256, 256, 512]               0
           Conv2d-81        [-1, 512, 128, 256]          65,536
           Conv2d-82         [-1, 64, 256, 512]          16,384
      BatchNorm2d-83        [-1, 512, 128, 256]           1,024
      BatchNorm2d-84         [-1, 64, 256, 512]             128
             ReLU-85        [-1, 512, 128, 256]               0
       Bottleneck-86        [-1, 512, 128, 256]               0
           Conv2d-87        [-1, 128, 128, 256]          65,536
             ReLU-88         [-1, 64, 256, 512]               0
           Conv2d-89         [-1, 64, 256, 512]          36,864
      BatchNorm2d-90        [-1, 128, 128, 256]             256
             ReLU-91        [-1, 128, 128, 256]               0
      BatchNorm2d-92         [-1, 64, 256, 512]             128
           Conv2d-93        [-1, 128, 128, 256]         147,456
      BatchNorm2d-94        [-1, 128, 128, 256]             256
             ReLU-95         [-1, 64, 256, 512]               0
           Conv2d-96        [-1, 256, 256, 512]          16,384
             ReLU-97        [-1, 128, 128, 256]               0
           Conv2d-98        [-1, 512, 128, 256]          65,536
      BatchNorm2d-99        [-1, 256, 256, 512]             512
     BatchNorm2d-100        [-1, 512, 128, 256]           1,024
            ReLU-101        [-1, 256, 256, 512]               0
      Bottleneck-102        [-1, 256, 256, 512]               0
          Conv2d-103        [-1, 128, 256, 512]          32,768
            ReLU-104        [-1, 512, 128, 256]               0
      Bottleneck-105        [-1, 512, 128, 256]               0
          Conv2d-106        [-1, 128, 128, 256]          65,536
     BatchNorm2d-107        [-1, 128, 256, 512]             256
     BatchNorm2d-108        [-1, 128, 128, 256]             256
            ReLU-109        [-1, 128, 256, 512]               0
            ReLU-110        [-1, 128, 128, 256]               0
          Conv2d-111        [-1, 128, 128, 256]         147,456
          Conv2d-112        [-1, 128, 128, 256]         147,456
     BatchNorm2d-113        [-1, 128, 128, 256]             256
     BatchNorm2d-114        [-1, 128, 128, 256]             256
            ReLU-115        [-1, 128, 128, 256]               0
            ReLU-116        [-1, 128, 128, 256]               0
          Conv2d-117        [-1, 512, 128, 256]          65,536
          Conv2d-118        [-1, 512, 128, 256]          65,536
     BatchNorm2d-119        [-1, 512, 128, 256]           1,024
     BatchNorm2d-120        [-1, 512, 128, 256]           1,024
          Conv2d-121        [-1, 512, 128, 256]         131,072
            ReLU-122        [-1, 512, 128, 256]               0
      Bottleneck-123        [-1, 512, 128, 256]               0
          Conv2d-124        [-1, 256, 128, 256]         131,072
     BatchNorm2d-125        [-1, 512, 128, 256]           1,024
     BatchNorm2d-126        [-1, 256, 128, 256]             512
            ReLU-127        [-1, 512, 128, 256]               0
      Bottleneck-128        [-1, 512, 128, 256]               0
          Conv2d-129        [-1, 128, 128, 256]          65,536
            ReLU-130        [-1, 256, 128, 256]               0
          Conv2d-131         [-1, 256, 64, 128]         589,824
     BatchNorm2d-132        [-1, 128, 128, 256]             256
     BatchNorm2d-133         [-1, 256, 64, 128]             512
            ReLU-134        [-1, 128, 128, 256]               0
          Conv2d-135        [-1, 128, 128, 256]         147,456
            ReLU-136         [-1, 256, 64, 128]               0
          Conv2d-137        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-138        [-1, 128, 128, 256]             256
            ReLU-139        [-1, 128, 128, 256]               0
     BatchNorm2d-140        [-1, 1024, 64, 128]           2,048
          Conv2d-141        [-1, 512, 128, 256]          65,536
          Conv2d-142        [-1, 1024, 64, 128]         524,288
     BatchNorm2d-143        [-1, 512, 128, 256]           1,024
     BatchNorm2d-144        [-1, 1024, 64, 128]           2,048
            ReLU-145        [-1, 512, 128, 256]               0
      Bottleneck-146        [-1, 512, 128, 256]               0
          Conv2d-147        [-1, 128, 128, 256]          65,536
            ReLU-148        [-1, 1024, 64, 128]               0
      Bottleneck-149        [-1, 1024, 64, 128]               0
          Conv2d-150         [-1, 256, 64, 128]         262,144
     BatchNorm2d-151        [-1, 128, 128, 256]             256
     BatchNorm2d-152         [-1, 256, 64, 128]             512
            ReLU-153        [-1, 128, 128, 256]               0
          Conv2d-154        [-1, 128, 128, 256]         147,456
            ReLU-155         [-1, 256, 64, 128]               0
          Conv2d-156         [-1, 256, 64, 128]         589,824
     BatchNorm2d-157        [-1, 128, 128, 256]             256
     BatchNorm2d-158         [-1, 256, 64, 128]             512
            ReLU-159        [-1, 128, 128, 256]               0
          Conv2d-160        [-1, 512, 128, 256]          65,536
            ReLU-161         [-1, 256, 64, 128]               0
          Conv2d-162        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-163        [-1, 512, 128, 256]           1,024
     BatchNorm2d-164        [-1, 1024, 64, 128]           2,048
            ReLU-165        [-1, 512, 128, 256]               0
      Bottleneck-166        [-1, 512, 128, 256]               0
          Conv2d-167        [-1, 128, 128, 256]          65,536
            ReLU-168        [-1, 1024, 64, 128]               0
      Bottleneck-169        [-1, 1024, 64, 128]               0
          Conv2d-170         [-1, 256, 64, 128]         262,144
     BatchNorm2d-171        [-1, 128, 128, 256]             256
            ReLU-172        [-1, 128, 128, 256]               0
     BatchNorm2d-173         [-1, 256, 64, 128]             512
          Conv2d-174        [-1, 128, 128, 256]         147,456
            ReLU-175         [-1, 256, 64, 128]               0
     BatchNorm2d-176        [-1, 128, 128, 256]             256
          Conv2d-177         [-1, 256, 64, 128]         589,824
            ReLU-178        [-1, 128, 128, 256]               0
          Conv2d-179        [-1, 512, 128, 256]          65,536
     BatchNorm2d-180         [-1, 256, 64, 128]             512
     BatchNorm2d-181        [-1, 512, 128, 256]           1,024
            ReLU-182         [-1, 256, 64, 128]               0
          Conv2d-183        [-1, 1024, 64, 128]         262,144
            ReLU-184        [-1, 512, 128, 256]               0
      Bottleneck-185        [-1, 512, 128, 256]               0
          Conv2d-186        [-1, 256, 128, 256]         131,072
     BatchNorm2d-187        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-188        [-1, 256, 128, 256]             512
            ReLU-189        [-1, 1024, 64, 128]               0
      Bottleneck-190        [-1, 1024, 64, 128]               0
            ReLU-191        [-1, 256, 128, 256]               0
          Conv2d-192         [-1, 256, 64, 128]         262,144
          Conv2d-193         [-1, 256, 64, 128]         589,824
     BatchNorm2d-194         [-1, 256, 64, 128]             512
     BatchNorm2d-195         [-1, 256, 64, 128]             512
            ReLU-196         [-1, 256, 64, 128]               0
            ReLU-197         [-1, 256, 64, 128]               0
          Conv2d-198         [-1, 256, 64, 128]         589,824
          Conv2d-199        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-200         [-1, 256, 64, 128]             512
     BatchNorm2d-201        [-1, 1024, 64, 128]           2,048
            ReLU-202         [-1, 256, 64, 128]               0
          Conv2d-203        [-1, 1024, 64, 128]         524,288
          Conv2d-204        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-205        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-206        [-1, 1024, 64, 128]           2,048
            ReLU-207        [-1, 1024, 64, 128]               0
      Bottleneck-208        [-1, 1024, 64, 128]               0
          Conv2d-209         [-1, 256, 64, 128]         262,144
            ReLU-210        [-1, 1024, 64, 128]               0
      Bottleneck-211        [-1, 1024, 64, 128]               0
          Conv2d-212         [-1, 256, 64, 128]         262,144
     BatchNorm2d-213         [-1, 256, 64, 128]             512
            ReLU-214         [-1, 256, 64, 128]               0
          Conv2d-215         [-1, 256, 64, 128]         589,824
     BatchNorm2d-216         [-1, 256, 64, 128]             512
     BatchNorm2d-217         [-1, 256, 64, 128]             512
            ReLU-218         [-1, 256, 64, 128]               0
          Conv2d-219        [-1, 1024, 64, 128]         262,144
            ReLU-220         [-1, 256, 64, 128]               0
          Conv2d-221         [-1, 256, 64, 128]         589,824
     BatchNorm2d-222        [-1, 1024, 64, 128]           2,048
            ReLU-223        [-1, 1024, 64, 128]               0
      Bottleneck-224        [-1, 1024, 64, 128]               0
     BatchNorm2d-225         [-1, 256, 64, 128]             512
          Conv2d-226         [-1, 256, 64, 128]         262,144
     BatchNorm2d-227         [-1, 256, 64, 128]             512
            ReLU-228         [-1, 256, 64, 128]               0
            ReLU-229         [-1, 256, 64, 128]               0
          Conv2d-230        [-1, 1024, 64, 128]         262,144
          Conv2d-231         [-1, 256, 64, 128]         589,824
     BatchNorm2d-232         [-1, 256, 64, 128]             512
     BatchNorm2d-233        [-1, 1024, 64, 128]           2,048
            ReLU-234         [-1, 256, 64, 128]               0
          Conv2d-235        [-1, 1024, 64, 128]         262,144
            ReLU-236        [-1, 1024, 64, 128]               0
      Bottleneck-237        [-1, 1024, 64, 128]               0
          Conv2d-238         [-1, 256, 64, 128]         262,144
     BatchNorm2d-239        [-1, 1024, 64, 128]           2,048
            ReLU-240        [-1, 1024, 64, 128]               0
      Bottleneck-241        [-1, 1024, 64, 128]               0
     BatchNorm2d-242         [-1, 256, 64, 128]             512
          Conv2d-243         [-1, 256, 64, 128]         262,144
     BatchNorm2d-244         [-1, 256, 64, 128]             512
            ReLU-245         [-1, 256, 64, 128]               0
            ReLU-246         [-1, 256, 64, 128]               0
          Conv2d-247         [-1, 256, 64, 128]         589,824
          Conv2d-248         [-1, 256, 64, 128]         589,824
     BatchNorm2d-249         [-1, 256, 64, 128]             512
     BatchNorm2d-250         [-1, 256, 64, 128]             512
            ReLU-251         [-1, 256, 64, 128]               0
          Conv2d-252        [-1, 1024, 64, 128]         262,144
            ReLU-253         [-1, 256, 64, 128]               0
     BatchNorm2d-254        [-1, 1024, 64, 128]           2,048
          Conv2d-255        [-1, 1024, 64, 128]         262,144
            ReLU-256        [-1, 1024, 64, 128]               0
      Bottleneck-257        [-1, 1024, 64, 128]               0
     BatchNorm2d-258        [-1, 1024, 64, 128]           2,048
          Conv2d-259         [-1, 256, 64, 128]         262,144
     BatchNorm2d-260         [-1, 256, 64, 128]             512
            ReLU-261        [-1, 1024, 64, 128]               0
      Bottleneck-262        [-1, 1024, 64, 128]               0
            ReLU-263         [-1, 256, 64, 128]               0
          Conv2d-264         [-1, 256, 64, 128]         262,144
          Conv2d-265         [-1, 256, 64, 128]         589,824
     BatchNorm2d-266         [-1, 256, 64, 128]             512
     BatchNorm2d-267         [-1, 256, 64, 128]             512
            ReLU-268         [-1, 256, 64, 128]               0
          Conv2d-269        [-1, 1024, 64, 128]         262,144
            ReLU-270         [-1, 256, 64, 128]               0
          Conv2d-271         [-1, 256, 64, 128]         589,824
     BatchNorm2d-272        [-1, 1024, 64, 128]           2,048
            ReLU-273        [-1, 1024, 64, 128]               0
      Bottleneck-274        [-1, 1024, 64, 128]               0
     BatchNorm2d-275         [-1, 256, 64, 128]             512
          Conv2d-276         [-1, 256, 64, 128]         262,144
     BatchNorm2d-277         [-1, 256, 64, 128]             512
            ReLU-278         [-1, 256, 64, 128]               0
            ReLU-279         [-1, 256, 64, 128]               0
          Conv2d-280        [-1, 1024, 64, 128]         262,144
          Conv2d-281         [-1, 256, 64, 128]         589,824
     BatchNorm2d-282         [-1, 256, 64, 128]             512
     BatchNorm2d-283        [-1, 1024, 64, 128]           2,048
            ReLU-284         [-1, 256, 64, 128]               0
          Conv2d-285        [-1, 1024, 64, 128]         262,144
            ReLU-286        [-1, 1024, 64, 128]               0
      Bottleneck-287        [-1, 1024, 64, 128]               0
     BatchNorm2d-288        [-1, 1024, 64, 128]           2,048
          Conv2d-289         [-1, 256, 64, 128]         262,144
            ReLU-290        [-1, 1024, 64, 128]               0
      Bottleneck-291        [-1, 1024, 64, 128]               0
          Conv2d-292         [-1, 256, 64, 128]         262,144
     BatchNorm2d-293         [-1, 256, 64, 128]             512
     BatchNorm2d-294         [-1, 256, 64, 128]             512
            ReLU-295         [-1, 256, 64, 128]               0
          Conv2d-296         [-1, 256, 64, 128]         589,824
            ReLU-297         [-1, 256, 64, 128]               0
          Conv2d-298         [-1, 256, 64, 128]         589,824
     BatchNorm2d-299         [-1, 256, 64, 128]             512
     BatchNorm2d-300         [-1, 256, 64, 128]             512
            ReLU-301         [-1, 256, 64, 128]               0
          Conv2d-302        [-1, 1024, 64, 128]         262,144
            ReLU-303         [-1, 256, 64, 128]               0
          Conv2d-304        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-305        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-306        [-1, 1024, 64, 128]           2,048
            ReLU-307        [-1, 1024, 64, 128]               0
      Bottleneck-308        [-1, 1024, 64, 128]               0
          Conv2d-309         [-1, 256, 64, 128]         262,144
            ReLU-310        [-1, 1024, 64, 128]               0
      Bottleneck-311        [-1, 1024, 64, 128]               0
          Conv2d-312         [-1, 256, 64, 128]         262,144
     BatchNorm2d-313         [-1, 256, 64, 128]             512
     BatchNorm2d-314         [-1, 256, 64, 128]             512
            ReLU-315         [-1, 256, 64, 128]               0
          Conv2d-316         [-1, 256, 64, 128]         589,824
            ReLU-317         [-1, 256, 64, 128]               0
          Conv2d-318         [-1, 256, 64, 128]         589,824
     BatchNorm2d-319         [-1, 256, 64, 128]             512
     BatchNorm2d-320         [-1, 256, 64, 128]             512
            ReLU-321         [-1, 256, 64, 128]               0
          Conv2d-322        [-1, 1024, 64, 128]         262,144
            ReLU-323         [-1, 256, 64, 128]               0
          Conv2d-324        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-325        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-326        [-1, 1024, 64, 128]           2,048
            ReLU-327        [-1, 1024, 64, 128]               0
      Bottleneck-328        [-1, 1024, 64, 128]               0
          Conv2d-329         [-1, 256, 64, 128]         262,144
            ReLU-330        [-1, 1024, 64, 128]               0
      Bottleneck-331        [-1, 1024, 64, 128]               0
          Conv2d-332         [-1, 256, 64, 128]         262,144
     BatchNorm2d-333         [-1, 256, 64, 128]             512
     BatchNorm2d-334         [-1, 256, 64, 128]             512
            ReLU-335         [-1, 256, 64, 128]               0
          Conv2d-336         [-1, 256, 64, 128]         589,824
            ReLU-337         [-1, 256, 64, 128]               0
          Conv2d-338         [-1, 256, 64, 128]         589,824
     BatchNorm2d-339         [-1, 256, 64, 128]             512
     BatchNorm2d-340         [-1, 256, 64, 128]             512
            ReLU-341         [-1, 256, 64, 128]               0
            ReLU-342         [-1, 256, 64, 128]               0
          Conv2d-343        [-1, 1024, 64, 128]         262,144
          Conv2d-344        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-345        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-346        [-1, 1024, 64, 128]           2,048
            ReLU-347        [-1, 1024, 64, 128]               0
      Bottleneck-348        [-1, 1024, 64, 128]               0
            ReLU-349        [-1, 1024, 64, 128]               0
      Bottleneck-350        [-1, 1024, 64, 128]               0
          Conv2d-351         [-1, 256, 64, 128]         262,144
          Conv2d-352         [-1, 256, 64, 128]         262,144
     BatchNorm2d-353         [-1, 256, 64, 128]             512
     BatchNorm2d-354         [-1, 256, 64, 128]             512
            ReLU-355         [-1, 256, 64, 128]               0
            ReLU-356         [-1, 256, 64, 128]               0
          Conv2d-357         [-1, 256, 64, 128]         589,824
          Conv2d-358         [-1, 256, 64, 128]         589,824
     BatchNorm2d-359         [-1, 256, 64, 128]             512
     BatchNorm2d-360         [-1, 256, 64, 128]             512
            ReLU-361         [-1, 256, 64, 128]               0
          Conv2d-362        [-1, 1024, 64, 128]         262,144
            ReLU-363         [-1, 256, 64, 128]               0
          Conv2d-364        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-365        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-366        [-1, 1024, 64, 128]           2,048
            ReLU-367        [-1, 1024, 64, 128]               0
      Bottleneck-368        [-1, 1024, 64, 128]               0
          Conv2d-369         [-1, 256, 64, 128]         262,144
            ReLU-370        [-1, 1024, 64, 128]               0
      Bottleneck-371        [-1, 1024, 64, 128]               0
          Conv2d-372         [-1, 256, 64, 128]         262,144
     BatchNorm2d-373         [-1, 256, 64, 128]             512
     BatchNorm2d-374         [-1, 256, 64, 128]             512
            ReLU-375         [-1, 256, 64, 128]               0
          Conv2d-376         [-1, 256, 64, 128]         589,824
            ReLU-377         [-1, 256, 64, 128]               0
          Conv2d-378         [-1, 256, 64, 128]         589,824
     BatchNorm2d-379         [-1, 256, 64, 128]             512
            ReLU-380         [-1, 256, 64, 128]               0
     BatchNorm2d-381         [-1, 256, 64, 128]             512
          Conv2d-382        [-1, 1024, 64, 128]         262,144
            ReLU-383         [-1, 256, 64, 128]               0
     BatchNorm2d-384        [-1, 1024, 64, 128]           2,048
          Conv2d-385        [-1, 1024, 64, 128]         262,144
            ReLU-386        [-1, 1024, 64, 128]               0
      Bottleneck-387        [-1, 1024, 64, 128]               0
          Conv2d-388         [-1, 256, 64, 128]         262,144
     BatchNorm2d-389        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-390         [-1, 256, 64, 128]             512
            ReLU-391        [-1, 1024, 64, 128]               0
      Bottleneck-392        [-1, 1024, 64, 128]               0
          Conv2d-393         [-1, 256, 64, 128]         262,144
            ReLU-394         [-1, 256, 64, 128]               0
          Conv2d-395         [-1, 256, 64, 128]         589,824
     BatchNorm2d-396         [-1, 256, 64, 128]             512
     BatchNorm2d-397         [-1, 256, 64, 128]             512
            ReLU-398         [-1, 256, 64, 128]               0
          Conv2d-399         [-1, 256, 64, 128]         589,824
            ReLU-400         [-1, 256, 64, 128]               0
          Conv2d-401        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-402         [-1, 256, 64, 128]             512
     BatchNorm2d-403        [-1, 1024, 64, 128]           2,048
            ReLU-404         [-1, 256, 64, 128]               0
          Conv2d-405        [-1, 1024, 64, 128]         262,144
            ReLU-406        [-1, 1024, 64, 128]               0
      Bottleneck-407        [-1, 1024, 64, 128]               0
          Conv2d-408         [-1, 256, 64, 128]         262,144
     BatchNorm2d-409        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-410         [-1, 256, 64, 128]             512
            ReLU-411        [-1, 1024, 64, 128]               0
      Bottleneck-412        [-1, 1024, 64, 128]               0
          Conv2d-413         [-1, 256, 64, 128]         262,144
            ReLU-414         [-1, 256, 64, 128]               0
          Conv2d-415         [-1, 256, 64, 128]         589,824
     BatchNorm2d-416         [-1, 256, 64, 128]             512
     BatchNorm2d-417         [-1, 256, 64, 128]             512
            ReLU-418         [-1, 256, 64, 128]               0
          Conv2d-419         [-1, 256, 64, 128]         589,824
            ReLU-420         [-1, 256, 64, 128]               0
          Conv2d-421        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-422         [-1, 256, 64, 128]             512
     BatchNorm2d-423        [-1, 1024, 64, 128]           2,048
            ReLU-424         [-1, 256, 64, 128]               0
          Conv2d-425        [-1, 1024, 64, 128]         262,144
            ReLU-426        [-1, 1024, 64, 128]               0
      Bottleneck-427        [-1, 1024, 64, 128]               0
          Conv2d-428         [-1, 256, 64, 128]         262,144
     BatchNorm2d-429        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-430         [-1, 256, 64, 128]             512
            ReLU-431        [-1, 1024, 64, 128]               0
      Bottleneck-432        [-1, 1024, 64, 128]               0
          Conv2d-433         [-1, 256, 64, 128]         262,144
            ReLU-434         [-1, 256, 64, 128]               0
          Conv2d-435         [-1, 256, 64, 128]         589,824
     BatchNorm2d-436         [-1, 256, 64, 128]             512
     BatchNorm2d-437         [-1, 256, 64, 128]             512
            ReLU-438         [-1, 256, 64, 128]               0
          Conv2d-439         [-1, 256, 64, 128]         589,824
            ReLU-440         [-1, 256, 64, 128]               0
          Conv2d-441        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-442         [-1, 256, 64, 128]             512
     BatchNorm2d-443        [-1, 1024, 64, 128]           2,048
            ReLU-444         [-1, 256, 64, 128]               0
          Conv2d-445        [-1, 1024, 64, 128]         262,144
            ReLU-446        [-1, 1024, 64, 128]               0
      Bottleneck-447        [-1, 1024, 64, 128]               0
          Conv2d-448         [-1, 256, 64, 128]         262,144
     BatchNorm2d-449        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-450         [-1, 256, 64, 128]             512
            ReLU-451        [-1, 1024, 64, 128]               0
      Bottleneck-452        [-1, 1024, 64, 128]               0
          Conv2d-453         [-1, 256, 64, 128]         262,144
            ReLU-454         [-1, 256, 64, 128]               0
          Conv2d-455         [-1, 256, 64, 128]         589,824
     BatchNorm2d-456         [-1, 256, 64, 128]             512
     BatchNorm2d-457         [-1, 256, 64, 128]             512
            ReLU-458         [-1, 256, 64, 128]               0
          Conv2d-459         [-1, 256, 64, 128]         589,824
            ReLU-460         [-1, 256, 64, 128]               0
          Conv2d-461        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-462         [-1, 256, 64, 128]             512
     BatchNorm2d-463        [-1, 1024, 64, 128]           2,048
            ReLU-464         [-1, 256, 64, 128]               0
          Conv2d-465        [-1, 1024, 64, 128]         262,144
            ReLU-466        [-1, 1024, 64, 128]               0
      Bottleneck-467        [-1, 1024, 64, 128]               0
          Conv2d-468         [-1, 256, 64, 128]         262,144
     BatchNorm2d-469        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-470         [-1, 256, 64, 128]             512
            ReLU-471        [-1, 1024, 64, 128]               0
      Bottleneck-472        [-1, 1024, 64, 128]               0
            ReLU-473         [-1, 256, 64, 128]               0
          Conv2d-474         [-1, 256, 64, 128]         262,144
          Conv2d-475         [-1, 256, 64, 128]         589,824
     BatchNorm2d-476         [-1, 256, 64, 128]             512
            ReLU-477         [-1, 256, 64, 128]               0
     BatchNorm2d-478         [-1, 256, 64, 128]             512
          Conv2d-479         [-1, 256, 64, 128]         589,824
            ReLU-480         [-1, 256, 64, 128]               0
     BatchNorm2d-481         [-1, 256, 64, 128]             512
          Conv2d-482        [-1, 1024, 64, 128]         262,144
            ReLU-483         [-1, 256, 64, 128]               0
          Conv2d-484        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-485        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-486        [-1, 1024, 64, 128]           2,048
            ReLU-487        [-1, 1024, 64, 128]               0
      Bottleneck-488        [-1, 1024, 64, 128]               0
          Conv2d-489         [-1, 256, 64, 128]         262,144
            ReLU-490        [-1, 1024, 64, 128]               0
      Bottleneck-491        [-1, 1024, 64, 128]               0
     BatchNorm2d-492         [-1, 256, 64, 128]             512
          Conv2d-493         [-1, 256, 64, 128]         262,144
            ReLU-494         [-1, 256, 64, 128]               0
          Conv2d-495         [-1, 256, 64, 128]         589,824
     BatchNorm2d-496         [-1, 256, 64, 128]             512
     BatchNorm2d-497         [-1, 256, 64, 128]             512
            ReLU-498         [-1, 256, 64, 128]               0
          Conv2d-499         [-1, 256, 64, 128]         589,824
            ReLU-500         [-1, 256, 64, 128]               0
          Conv2d-501        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-502         [-1, 256, 64, 128]             512
     BatchNorm2d-503        [-1, 1024, 64, 128]           2,048
            ReLU-504         [-1, 256, 64, 128]               0
          Conv2d-505        [-1, 1024, 64, 128]         262,144
            ReLU-506        [-1, 1024, 64, 128]               0
      Bottleneck-507        [-1, 1024, 64, 128]               0
          Conv2d-508         [-1, 256, 64, 128]         262,144
     BatchNorm2d-509        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-510         [-1, 256, 64, 128]             512
            ReLU-511        [-1, 1024, 64, 128]               0
      Bottleneck-512        [-1, 1024, 64, 128]               0
          Conv2d-513         [-1, 256, 64, 128]         262,144
            ReLU-514         [-1, 256, 64, 128]               0
          Conv2d-515         [-1, 256, 64, 128]         589,824
     BatchNorm2d-516         [-1, 256, 64, 128]             512
     BatchNorm2d-517         [-1, 256, 64, 128]             512
            ReLU-518         [-1, 256, 64, 128]               0
          Conv2d-519         [-1, 256, 64, 128]         589,824
            ReLU-520         [-1, 256, 64, 128]               0
          Conv2d-521        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-522         [-1, 256, 64, 128]             512
     BatchNorm2d-523        [-1, 1024, 64, 128]           2,048
            ReLU-524         [-1, 256, 64, 128]               0
          Conv2d-525        [-1, 1024, 64, 128]         262,144
            ReLU-526        [-1, 1024, 64, 128]               0
      Bottleneck-527        [-1, 1024, 64, 128]               0
          Conv2d-528         [-1, 256, 64, 128]         262,144
     BatchNorm2d-529        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-530         [-1, 256, 64, 128]             512
            ReLU-531        [-1, 1024, 64, 128]               0
      Bottleneck-532        [-1, 1024, 64, 128]               0
          Conv2d-533         [-1, 256, 64, 128]         262,144
            ReLU-534         [-1, 256, 64, 128]               0
          Conv2d-535         [-1, 256, 64, 128]         589,824
     BatchNorm2d-536         [-1, 256, 64, 128]             512
     BatchNorm2d-537         [-1, 256, 64, 128]             512
            ReLU-538         [-1, 256, 64, 128]               0
          Conv2d-539         [-1, 256, 64, 128]         589,824
            ReLU-540         [-1, 256, 64, 128]               0
          Conv2d-541        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-542         [-1, 256, 64, 128]             512
     BatchNorm2d-543        [-1, 1024, 64, 128]           2,048
            ReLU-544         [-1, 256, 64, 128]               0
          Conv2d-545        [-1, 1024, 64, 128]         262,144
            ReLU-546        [-1, 1024, 64, 128]               0
      Bottleneck-547        [-1, 1024, 64, 128]               0
          Conv2d-548         [-1, 256, 64, 128]         262,144
     BatchNorm2d-549        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-550         [-1, 256, 64, 128]             512
            ReLU-551        [-1, 1024, 64, 128]               0
      Bottleneck-552        [-1, 1024, 64, 128]               0
          Conv2d-553         [-1, 256, 64, 128]         262,144
            ReLU-554         [-1, 256, 64, 128]               0
          Conv2d-555         [-1, 256, 64, 128]         589,824
     BatchNorm2d-556         [-1, 256, 64, 128]             512
     BatchNorm2d-557         [-1, 256, 64, 128]             512
            ReLU-558         [-1, 256, 64, 128]               0
            ReLU-559         [-1, 256, 64, 128]               0
          Conv2d-560         [-1, 256, 64, 128]         589,824
          Conv2d-561        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-562         [-1, 256, 64, 128]             512
     BatchNorm2d-563        [-1, 1024, 64, 128]           2,048
            ReLU-564         [-1, 256, 64, 128]               0
            ReLU-565        [-1, 1024, 64, 128]               0
      Bottleneck-566        [-1, 1024, 64, 128]               0
          Conv2d-567        [-1, 1024, 64, 128]         262,144
          Conv2d-568         [-1, 256, 64, 128]         262,144
     BatchNorm2d-569        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-570         [-1, 256, 64, 128]             512
            ReLU-571        [-1, 1024, 64, 128]               0
      Bottleneck-572        [-1, 1024, 64, 128]               0
          Conv2d-573         [-1, 256, 64, 128]         262,144
            ReLU-574         [-1, 256, 64, 128]               0
          Conv2d-575         [-1, 256, 64, 128]         589,824
     BatchNorm2d-576         [-1, 256, 64, 128]             512
     BatchNorm2d-577         [-1, 256, 64, 128]             512
            ReLU-578         [-1, 256, 64, 128]               0
          Conv2d-579         [-1, 256, 64, 128]         589,824
            ReLU-580         [-1, 256, 64, 128]               0
          Conv2d-581        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-582         [-1, 256, 64, 128]             512
     BatchNorm2d-583        [-1, 1024, 64, 128]           2,048
            ReLU-584         [-1, 256, 64, 128]               0
          Conv2d-585        [-1, 1024, 64, 128]         262,144
            ReLU-586        [-1, 1024, 64, 128]               0
      Bottleneck-587        [-1, 1024, 64, 128]               0
          Conv2d-588         [-1, 256, 64, 128]         262,144
     BatchNorm2d-589        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-590         [-1, 256, 64, 128]             512
            ReLU-591        [-1, 1024, 64, 128]               0
      Bottleneck-592        [-1, 1024, 64, 128]               0
          Conv2d-593         [-1, 256, 64, 128]         262,144
            ReLU-594         [-1, 256, 64, 128]               0
          Conv2d-595         [-1, 256, 64, 128]         589,824
     BatchNorm2d-596         [-1, 256, 64, 128]             512
     BatchNorm2d-597         [-1, 256, 64, 128]             512
            ReLU-598         [-1, 256, 64, 128]               0
          Conv2d-599         [-1, 256, 64, 128]         589,824
            ReLU-600         [-1, 256, 64, 128]               0
          Conv2d-601        [-1, 1024, 64, 128]         262,144
     BatchNorm2d-602         [-1, 256, 64, 128]             512
     BatchNorm2d-603        [-1, 1024, 64, 128]           2,048
            ReLU-604         [-1, 256, 64, 128]               0
          Conv2d-605        [-1, 1024, 64, 128]         262,144
            ReLU-606        [-1, 1024, 64, 128]               0
      Bottleneck-607        [-1, 1024, 64, 128]               0
          Conv2d-608         [-1, 512, 64, 128]         524,288
     BatchNorm2d-609        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-610         [-1, 512, 64, 128]           1,024
            ReLU-611        [-1, 1024, 64, 128]               0
      Bottleneck-612        [-1, 1024, 64, 128]               0
          Conv2d-613         [-1, 256, 64, 128]         262,144
            ReLU-614         [-1, 512, 64, 128]               0
          Conv2d-615          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-616         [-1, 256, 64, 128]             512
     BatchNorm2d-617          [-1, 512, 32, 64]           1,024
            ReLU-618         [-1, 256, 64, 128]               0
          Conv2d-619         [-1, 256, 64, 128]         589,824
            ReLU-620          [-1, 512, 32, 64]               0
          Conv2d-621         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-622         [-1, 256, 64, 128]             512
     BatchNorm2d-623         [-1, 2048, 32, 64]           4,096
            ReLU-624         [-1, 256, 64, 128]               0
          Conv2d-625        [-1, 1024, 64, 128]         262,144
          Conv2d-626         [-1, 2048, 32, 64]       2,097,152
     BatchNorm2d-627        [-1, 1024, 64, 128]           2,048
     BatchNorm2d-628         [-1, 2048, 32, 64]           4,096
            ReLU-629        [-1, 1024, 64, 128]               0
      Bottleneck-630        [-1, 1024, 64, 128]               0
          Conv2d-631         [-1, 512, 64, 128]         524,288
            ReLU-632         [-1, 2048, 32, 64]               0
      Bottleneck-633         [-1, 2048, 32, 64]               0
          Conv2d-634          [-1, 512, 32, 64]       1,048,576
     BatchNorm2d-635         [-1, 512, 64, 128]           1,024
     BatchNorm2d-636          [-1, 512, 32, 64]           1,024
            ReLU-637         [-1, 512, 64, 128]               0
          Conv2d-638          [-1, 512, 32, 64]       2,359,296
            ReLU-639          [-1, 512, 32, 64]               0
          Conv2d-640          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-641          [-1, 512, 32, 64]           1,024
     BatchNorm2d-642          [-1, 512, 32, 64]           1,024
            ReLU-643          [-1, 512, 32, 64]               0
          Conv2d-644         [-1, 2048, 32, 64]       1,048,576
            ReLU-645          [-1, 512, 32, 64]               0
          Conv2d-646         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-647         [-1, 2048, 32, 64]           4,096
     BatchNorm2d-648         [-1, 2048, 32, 64]           4,096
          Conv2d-649         [-1, 2048, 32, 64]       2,097,152
            ReLU-650         [-1, 2048, 32, 64]               0
      Bottleneck-651         [-1, 2048, 32, 64]               0
     BatchNorm2d-652         [-1, 2048, 32, 64]           4,096
          Conv2d-653          [-1, 512, 32, 64]       1,048,576
            ReLU-654         [-1, 2048, 32, 64]               0
      Bottleneck-655         [-1, 2048, 32, 64]               0
          Conv2d-656          [-1, 512, 32, 64]       1,048,576
     BatchNorm2d-657          [-1, 512, 32, 64]           1,024
     BatchNorm2d-658          [-1, 512, 32, 64]           1,024
            ReLU-659          [-1, 512, 32, 64]               0
          Conv2d-660          [-1, 512, 32, 64]       2,359,296
            ReLU-661          [-1, 512, 32, 64]               0
          Conv2d-662          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-663          [-1, 512, 32, 64]           1,024
     BatchNorm2d-664          [-1, 512, 32, 64]           1,024
            ReLU-665          [-1, 512, 32, 64]               0
          Conv2d-666         [-1, 2048, 32, 64]       1,048,576
            ReLU-667          [-1, 512, 32, 64]               0
          Conv2d-668         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-669         [-1, 2048, 32, 64]           4,096
     BatchNorm2d-670         [-1, 2048, 32, 64]           4,096
            ReLU-671         [-1, 2048, 32, 64]               0
      Bottleneck-672         [-1, 2048, 32, 64]               0
            ReLU-673         [-1, 2048, 32, 64]               0
      Bottleneck-674         [-1, 2048, 32, 64]               0
AdaptiveAvgPool2d-675           [-1, 2048, 1, 1]               0
          Conv2d-676          [-1, 512, 32, 64]       1,048,576
     BatchNorm2d-677          [-1, 512, 32, 64]           1,024
            ReLU-678          [-1, 512, 32, 64]               0
          Conv2d-679          [-1, 512, 32, 64]       2,359,296
     BatchNorm2d-680          [-1, 512, 32, 64]           1,024
            ReLU-681          [-1, 512, 32, 64]               0
          Conv2d-682         [-1, 2048, 32, 64]       1,048,576
     BatchNorm2d-683         [-1, 2048, 32, 64]           4,096
            ReLU-684         [-1, 2048, 32, 64]               0
      Bottleneck-685         [-1, 2048, 32, 64]               0
AdaptiveAvgPool2d-686           [-1, 2048, 1, 1]               0
          Linear-687                 [-1, 1000]       2,049,000
          ResNet-688                 [-1, 1000]               0
          Linear-689                 [-1, 1000]       2,049,000
          ResNet-690                 [-1, 1000]               0
================================================================
Total params: 89,098,320
Trainable params: 44,549,160
Non-trainable params: 44,549,160
----------------------------------------------------------------
Input size (MB): 24.00
Forward/backward pass size (MB): 35920.06
Params size (MB): 339.88
Estimated Total Size (MB): 36283.94
----------------------------------------------------------------
None
